package com.example.bibleapp.books;

import com.example.bibleapp.models.Book;
import com.example.bibleapp.models.Chapter;
import com.example.bibleapp.models.Verse;

import java.util.ArrayList;
import java.util.List;

public class PHILEMON {
    private Book PHILEMONBook;

    public PHILEMON() {
        List<Chapter> chapters = new ArrayList<>();
        chapters.add(chapterOne());

        PHILEMONBook = new Book("ወደ ፊልሞና", chapters);
    }

    public Book getPHILEMONBook() {
        return PHILEMONBook;
    }

    private Chapter chapterOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "የክርስቶስ ኢየሱስ እስር ጳውሎስ ወንድሙም ጢሞቴዎስ፥ ለተወደደውና አብሮን ለሚሠራ ለፊልሞና፥\n" +
                "2 ለእኅታችንም ለአፍብያ፥ ከእኛም ጋር አብሮ ወታደር ለሆነ ለአርክጳ፥ በቤትህም ላለች ቤተ ክርስቲያን፤\n" +
                "3 ከእግዚአብሔር ከአባታችን ከጌታም ከኢየሱስ ክርስቶስ ጸጋና ሰላም ለእናንተ ይሁን።\n" +
                "4 -\n" +
                "5 በጌታ በኢየሱስ ዘንድ በቅዱሳንም ሁሉ ዘንድ ስላለህ ስለ ፍቅርህና ስለ እምነትህ ሰምቼ፥ በጸሎቴ እያሳሰብሁ ሁልጊዜ አምላኬን አመሰግናለሁ፤\n" +
                "6 የእምነትህም ኅብረት፥ በእኛ ዘንድ ያለውን በጎ ነገር ሁሉ በማወቅ፥ ለክርስቶስ ኢየሱስ ፍሬ እንዲያፈራ እለምናለሁ፤\n" +
                "7 የቅዱሳን ልብ በአንተ ስራ ስለ ዐረፈ፥ ወንድሜ ሆይ፥ በፍቅርህ ብዙ ደስታንና መጽናናትን አግኝቼአለሁና።\n" +
                "8 ስለዚህ የሚገባውን አዝህ ዘንድ በክርስቶስ ምንም እንኳ ብዙ ድፍረት ቢኖረኝ፥\n" +
                "9 ይልቁንም እንደዚህ የሆንሁ እኔ ጳውሎስ ሽማግሌው፥ አሁንም ደግሞ የኢየሱስ ክርስቶስ እስር የሆንሁ፥ ስለ ፍቅር እለምናለሁ።\n" +
                "10 -\n" +
                "11 አስቀድሞ ስላልጠቀመህ፥ አሁን ግን ለእኔም ለአንተም ስለሚጠቅም በእስራቴ ስለ ወለድሁት ስለ ልጄ ስለ አናሲሞስ እለምንሃለሁ።\n" +
                "12 እርሱን እልከዋለሁ፤\n" +
                "13 አንተም ልቤ እንደሚሆን ተቀበለው። እኔስ በወንጌል እስራት ስለ አንተ እንዲያገለግለኝ ለራሴ ላስቀረው እፈቅድ ነበር፥\n" +
                "14 ነገር ግን በጎነትህ በፈቃድህ እንጂ በግድ እንዳይሆን፥ ሳልማከርህ ምንም እንኳ ላደርግ አልወደድሁም።\n" +
                "15 ተቀብለህ ለዘላለም እንድትይዘው ስለዚህ ምናልባት ለጊዜው ተለይቶሃልና፤\n" +
                "16 ከእንግዲህ ወዲህ እንደ ባሪያ አይሆንም፥ ነገር ግን ለእኔ በተለየ የተወደደ ወንድም ከሆነ፥ ለአንተማ ይልቅ በስጋውም በጌታም ዘንድ ከባሪያ የሚሻል የተወደደ ወንድም እንዴት አይሆንም።\n" +
                "17 እንግዲህ እንደ ባልንጀራ ብትቈጥረኝ፥ እንደ እኔ አድርገህ ተቀበለው።\n" +
                "18 በአንዳች ነገር የበደለህ ቢኖር ግን ወይም ብድር ያለበት እንደሆነ፥ ይህን በእኔ ላይ ቍጠር፤\n" +
                "19 እኔ ጳውሎስ። እኔ እመልሰዋለሁ ብዬ በእጄ እጽፋለሁ፤ ከዚህም በላይ ለእኔ የራስህ ደግሞ ብድር እንዳለብህ አልልህም።\n" +
                "20 አዎን፥ ወንድሜ ሆይ፥ በጌታ እኔ እንድጠቀምብህ ይሁን፤ በክርስቶስ ልቤን አሳርፍልኝ።\n" +
                "21 ከምልህ ይልቅ አብልጠህ እንድታደርግ አውቄ እንድትታዘዝም ታምኜ እጽፍልሃለሁ።\n" +
                "22 ደግሞ ከዚህም ጋር የማስተናገጃ ቤት አዘጋጅልኝ፤ በጸሎታችሁ ለእናንተ እንድሰጥ ተስፋ አደርጋለሁና።\n" +
                "23 በክርስቶስ ኢየሱስ ከእኔ ጋር የታሰረ ኤጳፍራ\n" +
                "24 አብረውኝም የሚሰሩ ማርቆስና አርስጥሮኮስ ዴማስም ሉቃስም ሰላምታ ያቀርቡልሃል።\n" +
                "25 የጌታችን የኢሱስ ክርስቶስ ጸጋ ከመንፈሳችሁ ጋር ይሁን፤ አሜን።\n"));
        // Add more verses as needed
        return new Chapter(1, verses);
    }

}