package com.example.bibleapp.books;

import com.example.bibleapp.models.Book;
import com.example.bibleapp.models.Chapter;
import com.example.bibleapp.models.Verse;

import java.util.ArrayList;
import java.util.List;

public class TITUS {
    private Book TITUSBook;

    public TITUS() {
        List<Chapter> chapters = new ArrayList<>();
        chapters.add(chapterOne());
        chapters.add(chapterTwo());
        chapters.add(chapterThree());

        TITUSBook = new Book("ወደ ቲቶ", chapters);
    }

    public Book getTITUSBook() {
        return TITUSBook;
    }

    private Chapter chapterOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "የእግዚአብሔር ባሪያና የኢየሱስ ክርስቶስ ሐዋርያ የሆነ ጳውሎስ፥\n" +
                "2 በእግዚአብሔር ለተመረጡት እምነት እንዲሆንላቸው በዘላለምም ሕይወት ተስፋ እንደ አምልኮት ያለውን እውነት እንዲያውቁ የተላከ፤ ስለዚህም ሕይወት የማይዋሽ እግዚአብሔር ከዘላለም ዘመናት በፊት ተስፋ ሰጠ፥\n" +
                "3 በዘመኑም ጊዜ፥ መድኃኒታችን እግዚአብሔር እንዳዘዘ፥ ለእኔ አደራ በተሰጠኝ ስብከት ቃሉን ገለጠ፤\n" +
                "4 በሃይማኖት ኅብረት እውነተኛ ልጄ ለሚሆን ለቲቶ፤ ከእግዚአብሔር አብ ከመድኃኒታችንም ከጌታ ከኢየሱስ ክርስቶስ ጸጋና ምሕረት ሰላምም ይሁን።\n" +
                "5 ስለዚህ ምክንያት የቀረውን እንድታደራጅ በየከተማውም፥ እኔ አንተን እንዳዘዝሁ፥ ሽማግሌዎችን እንድትሾም በቀርጤስ ተውሁህ፤\n" +
                "6 የማይነቀፍና የአንዲት ሚስት ባል የሚሆን፥ የሚያምኑም ልጆች ያሉት፥ ስለ መዳራትም ወይም ስለ አለመታዘዝ የማይከሰስ ማንም ቢኖር፥ ሹመው።\n" +
                "7 ኤጲስ ቆጶስ፥ እንደ እግዚአብሔር መጋቢ፥ የማይነቀፍ ሊሆን ይገባዋልና፤ የማይኮራ፥ የማይቆጣ፥ የማይሰክር፥ የማይጨቃጨቅ፥ ነውረኛ ረብ የማይወድ፥\n" +
                "8 ነገር ግን እንግዳ ተቀባይ፥ በጎ የሆነውን ነገር የሚወድ፥ ጠንቃቃ፥ ጻድቅ፥ ቅዱስ፥ ራሱን የሚገዛ ይሁን፤\n" +
                "9 ሕይወት በሚገኝበት ትምህርት ደግሞ ሊመክር ተቃዋሚዎቹንም ሊወቅስ ይችል ዘንድ፥ እንደተማረው በታመነ ቃል ይጽና።\n" +
                "10 የማይታዘዙና ከንቱ የሚናገሩ የሚያታልሉ ይልቁንም ከተገረዙት ወገን የሚሆኑ ብዙ ናቸውና፤\n" +
                "11 እነዚህም ስለ ነውረኛ ረብ የማይገባውን እያስተማሩ ቤቶችን በሞላው ስለ ሚገለብጡ፥ አፋቸውን መዝጋት ይገባል።\n" +
                "12 የገዛ ራሳቸው ነቢይ የሆነ ከእነርሱ አንዱ። የቀርጤስ ሰዎች ዘወትር ውሸተኞች፥ ክፉዎች አራዊት፥ በላተኞች፥ ሥራ ፈቶች ናቸው ብሎአል።\n" +
                "13 -\n" +
                "14 ይህ ምስክር እውነተኛ ነው። ስለዚህ ምክንያት የአይሁድን ተረትና ከእውነት ፈቀቅ የሚሉትን ሰዎች ትእዛዝ ሳያዳምጡ፥ በሃይማኖት ጤናሞች እንዲሆኑ በብርቱ ውቀሳቸው።\n" +
                "15 ሁሉ ለንጹሖች ንጹሕ ነው፤ ለርኵሳንና ለማያምኑ ግን ንጹሕ የሆነ ምንም የለም፥ ነገር ግን አእምሮአቸውም ሕሊናቸውም ረክሶአል።\n" +
                "16 እግዚአብሔርን እንዲያውቁ በግልጥ ይናገራሉ፥ ዳሩ ግን የሚያስጸይፉና የማይታዘዙ ለበጎ ሥራም ሁሉ የማይበቁ ስለ ሆኑ፥ በሥራቸው ይክዱታል።" +
                "\n"));
        // Add more verses as needed
        return new Chapter(1, verses);
    }

    private Chapter chapterTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "አንተ ግን ሕይወት ለሚገኝበት ትምህርት የሚገባውን ተናገር።\n" +
                "2 ሽማግሌዎች ልከኞች፥ ጭምቶች፥ ራሳቸውን የሚገዙ፥ በእምነትና በፍቅር በመጽናትም ጤናሞች እንዲሆኑ ምከራቸው፤\n" +
                "3 እንዲሁም አሮጊቶች ሴቶች አካሄዳቸው ለቅዱስ አገልግሎት የሚገባ፥ የማያሙ፥ ለብዙ ወይን ጠጅ የማይገዙ፥ በጎ የሆነውን ነገር የሚያስተምሩ ይሁኑ፤\n" +
                "4 -\n" +
                "5 ቆነጃጅትም የእግዚአብሔር ቃል እንዳይሰደብ፥ ባሎቻቸውን የሚወዱ፥ ልጆቻቸውን የሚወዱ፥ ራሳቸውን የሚገዙ፥ ንጹሖች፥ በቤት የሚሠሩ፥ በጎዎች፥ ለባሎቻቸው የሚታዘዙ እንዲሆኑ ይምከሩአቸው።\n" +
                "6 ጎበዞችም እንዲሁ ራሳቸውን እንዲገዙ ምከራቸው።\n" +
                "7 -\n" +
                "8 የሚቃወም ሰው ስለ እኛ የሚናገረውን መጥፎ ነገር ሲያጣ እንዲያፍር፥ በነገር ሁሉ መልካምን በማድረግህ ምሳሌ የሚሆን ራስህን አሳይ፤ በትምህርትህም ደኅንነትን፥ ጭምትነትን፥ ጤናማና የማይነቀፍ ንግግርን ግለጥ።\n" +
                "9 -\n" +
                "10 ባሪያዎች ስለ መድኃኒታችን ስለ እግዚአብሔር የሚሆነውን ትምህርት በሁሉ ነገር ያስመሰግኑ ዘንድ፥ ለገዛ ጌቶቻቸው እንዲገዙ በሁሉም ደስ እንዲያሰኙ፥ ሳይቃወሙና ሳይሰርቁም በጎ ታማኝነትን ሁሉ እንዲያሳዩ ምከራቸው።\n" +
                "11 ሰዎችን ሁሉ የሚያድን የእግዚአብሔር ጸጋ ተገልጦአልና፤\n" +
                "12 -\n" +
                "13 ይህም ጸጋ፥ ኃጢአተኝነትንና ዓለማዊን ምኞት ክደን፥ የተባረከውን ተስፋችንን እርሱም የታላቁን የአምላካችንንና የመድኃኒታችንን የኢየሱስ ክርስቶስን ክብር መገለጥ እየጠበቅን፥ ራሳችንን በመግዛትና በጽድቅ እግዚአብሔርንም በመምሰል በአሁኑ ዘመን እንድንኖር ያስተምረናል፤\n" +
                "14 መድኃኒታችንም ከዓመፅ ሁሉ እንዲቤዠን፥ መልካሙንም ለማድረግ የሚቀናውን ገንዘቡም የሚሆነውን ሕዝብ ለራሱ እንዲያነጻ፥ ስለ እኛ ነፍሱን ሰጥቶአል።\n" +
                "15 ይህን በሙሉ ሥልጣን ተናገርና ምከር ገሥጽም፤ ማንም አይናቅህ።\n"));
        // Add more verses as needed
        return new Chapter(2, verses);
    }

    private Chapter chapterThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ለገዦችና ለባለ ሥልጣኖች የሚገዙና የሚታዘዙ፥ ለበጎ ሥራ ሁሉ የተዘጋጁ፥ ማንንም የማይሰድቡ፥\n" +
                "2 የማይከራከሩ፥ ገሮች፥ ለሰው ሁሉ የዋህነትን ሁሉ የሚያሳዩ እንዲሆኑ ኣሳስባቸው።\n" +
                "3 እኛ ደግሞ አስቀድመን የማናስተውል ነበርንና፤ የማንታዘዝ፥ የምንስት፥ ለምኞትና ለልዩ ልዩ ተድላ እንደ ባሪያዎች የምንገዛ፥ በክፋትና በምቀኝነት የምንኖር፥ የምንጣላ፥ እርስ በርሳችን የምንጠላላ ነበርን።\n" +
                "4 ነገር ግን የመድኃኒታችን የእግዚአብሔር ቸርነትና ሰውን መውደዱ በተገለጠ ጊዜ፥\n" +
                "5 እንደ ምሕረቱ መጠን ለአዲስ ልደት በሚሆነው መታጠብና በመንፈስ ቅዱስ በመታደስ አዳነን እንጂ፥ እኛ ስላደረግነው በጽድቅ ስለ ነበረው ሥራ አይደለም፤\n" +
                "6 -\n" +
                "7 ያን መንፈስም፥ በጸጋው ጸድቀን በዘላለም ሕይወት ተስፋ ወራሾች እንድንሆን፥ በመድኃኒታችን በኢየሱስ ክርስቶስ በእኛ ላይ አትርፎ አፈሰሰው።\n" +
                "8 ቃሉ የታመነ ነው። እግዚአብሔርንም የሚያምኑት በመልካም ሥራ በጥንቃቄ እንዲጸኑ፥ እነዚህን አስረግጠህ እንድትናገር እፈቅዳለሁ። ይህ መልካምና ለሰዎች የሚጠቅም ነው፤\n" +
                "9 ነገር ግን ሞኝነት ካለው ምርመራና ከትውልዶች ታሪክ ከክርክርም ስለ ሕግም ከሚሆን ጠብ ራቅ፤ የማይጠቅሙና ከንቱዎች ናቸውና፤\n" +
                "10 -\n" +
                "11 መለያየትን የሚያነሣ ሰው ጠማማ እንዲሆን በራሱም ላይ ፈርዶ ኃጢአትን እንዲያደርግ አውቀህ፥ አንድ ጊዜ ሁለት ጊዜም ከገሠጽኸው በኋላ እንዲህ ከሚመስል ሰው ራቅ።\n" +
                "12 አርጢሞንን ወይም ቲኪቆስን ወደ አንተ ስልክ፥ ወደ ኒቆጵልዮን ወደ እኔ እንድትመጣ ትጋ፤ በዚያ ልከርም ቈርጬአለሁና።\n" +
                "13 ሕግ አዋቂውን ዜማስንና አጵሎስን ምንም እንዳይጎድልባቸው በጉዞአቸው ተግተህ እርዳ።\n" +
                "14 ከወገናችንም ያሉት ደግሞ ፍሬ ቢሶች ሆነው እንዳይቀሩ፥ የግድ ስለሚያስፈልገው ነገር በመልካም ሥራ እንዲጸኑ ይማሩ።\n" +
                "15 ከእኔ ጋር ያሉት ሁሉ ሰላምታ ያቀርቡልሃል። በእምነት ለሚወዱን ሰላምታ አቅርብልን። ጸጋ ከሁላችሁ ጋር ይሁን፤ አሜን።\n"));

        return new Chapter(3, verses);
    }

}