package com.example.bibleapp.books.added;

import com.example.bibleapp.models.Book;
import com.example.bibleapp.models.Chapter;
import com.example.bibleapp.models.Verse;

import java.util.ArrayList;
import java.util.List;

public class AMOS {
    private Book AMOSBook;

    public AMOS() {
        List<Chapter> chapters = new ArrayList<>();
        chapters.add(chapterOne());
        chapters.add(chapterTwo());
        chapters.add(chapterThree());
        chapters.add(chapterFour());
        chapters.add(chapterFive());
        chapters.add(chapterSix());
        chapters.add(chapterSeven());
        chapters.add(chapterEight());
        chapters.add(chapterNine());
 
        AMOSBook = new Book("ትንቢተ አሞጽ", chapters);
    }

    public Book getAMOSBook() {
        return AMOSBook;
    }

    private Chapter chapterOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","በቴቁሔ ከላም ጠባቂዎች መካከል የነበረ አሞጽ በይሁዳ ንጉሥ በዖዝያን ዘመን፥ በእስራኤልም ንጉሥ በዮአስ ልጅ በኢዮርብዓም ዘመን፥ የምድር መናወጥ ከሆነበቱ ከሁለት ዓመት በፊት ስለ እስራኤል ያየው ቃል ይህ ነው።  \n" +   
                "2 ፤ እንዲህም አለ። እግዚአብሔር በጽዮን ሆኖ ድምፁን ከፍ አድርጎ ይጮኻል፥ በኢየሩሳሌምም ሆኖ ቃሉን ይሰጣል፤ የእረኞችም ማሰማርያዎች ያለቅሳሉ፥ የቀርሜሎስም ራስ ይደርቃል።  \n" +   
                "3 ፤ እግዚአብሔር እንዲህ ይላል። ገለዓድን በብረት መንኰራኵር አሂዶአልና ስለ ሦስት ወይም ስለ አራት የደማስቆ ኃጢአት መቅሠፍቴን ከማድረግ አልመለስም።  \n" +   
                "4 ፤ በአዛሄል ቤት እሳትን እሰድዳለሁ፥ የወልደ አዴርንም አዳራሾች ትበላለች።  \n" +   
                "5 ፤ የደማስቆንም መወርወሪያ እሰብራለሁ፥ ተቀማጮችንም ከአዌን ሸለቆ አጠፋለሁ፥ በትር የያዘውንም ከዔደን ቤት አጠፋለሁ፤ የሶርያም ሕዝብ ወደ ቂር ይማረካል፥ ይላል እግዚአብሔር።  \n" +   
                "6 ፤ እግዚአብሔር እንዲህ ይላል። ለኤዶምያስ አሳልፈው ይሰጡአቸው ዘንድ ምርኮኞችን ሁሉ ማርከዋልና ስለ ሦስት ወይም ስለ አራት የጋዛ ኃጢአት መቅሠፍቴን ከማድረግ አልመለስም።  \n" +   
                "7 ፤ በጋዛ ቅጥር ላይ እሳትን እሰድዳለሁ፥ አዳራሾችዋንም ትበላለች።  \n" +   
                "8 ፤ ተቀማጮችን ከአዛጦን አጠፋለሁ፥ በትር የያዘውንም ከአስቀሎና አጠፋለሁ፤ እጄንም በአቃሮን ላይ እመልሳለሁ፥ ከፍልስጥኤማውያንም የቀሩት ይጠፋሉ፥ ይላል ጌታ እግዚአብሔር።  \n" +   
                "9 ፤ እግዚአብሔር እንዲህ ይላል። ምርኮኞችን ሁሉ ለኤዶምያስ አሳልፈው ሰጥተዋልና፥ የወንድሞችንም ቃል ኪዳን አላሰቡምና ስለ ሦስት ወይም ስለ አራት የጢሮስ ኃጢአት መቅሠፍቴን ከማድረግ አልመለስም።  \n" +   
                "10 ፤ በጢሮስ ቅጥር ላይ እሳትን እሰድዳለሁ፥ አዳራሾችዋንም ትበላለች።  \n" +   
                "11 ፤ እግዚአብሔር እንዲህ ይላል። ወንድሙን በሰይፍ አሳድዶታልና፥ ርኅራኄንም ሁሉ ጥሎአልና፥ ቍጣውም ሁልጊዜ ቀድዶአልና፥ መዓቱንም ለዘላለም ጠብቆአልና ስለ ሦስት ወይም ስለ አራት የኤዶምያስ ኃጢአት መቅሠፍቴን ከማድረግ አልመለስም።  \n" +   
                "12 ፤ በቴማን ላይ እሳትን እሰድዳለሁ፥ የባሶራንም አዳራሾች ትበላለች።  \n" +   
                "13 ፤ እግዚአብሔር እንዲህ ይላል። ዳርቻቸውን ያሰፉ ዘንድ የገለዓድን እርጕዞች ቀድደዋልና ስለ ሦስት ወይም ስለ አራት የአሞን ልጆች ኃጢአት መቅሠፍቴን ከማድረግ አልመለስም።  \n" +   
                "14 ፤ በረባት ቅጥር ላይ እሳትን አነድዳለሁ፤ በሰልፍም ቀን በጩኸት በዐውሎ ነፋስም ቀን በሁከት አዳራሾችዋን ትበላለች፤  \n" +   
                "15 ፤ ንጉሣቸውም ከአለቆቹ ጋር በአንድነት ይማረካል፥ ይላል እግዚአብሔር።"));

        return new Chapter(1, verses);
    }

    private Chapter chapterTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "እግዚአብሔር እንዲህ ይላል። የኤዶምያስን ንጉሥ አጥንት አመድ እስኪሆን ድረስ አቃጥሎታልና ስለ ሦስት ወይም ስለ አራት የሞዓብ ኃጢአት መቅሠፍቴን ከማድረግ አልመለስም።  \n" +   
                "2 ፤ በሞዓብ ላይ እሳትን እሰድዳለሁ፥ የቂርዮትንም አዳራሾች ትበላለች፤ ሞዓብም በውካታና በጩኸት በመለከትም ድምፅ ይሞታል፤  \n" +   
                "3 ፤ ፈራጅንም ከመካከልዋ አጠፋለሁ፥ ከእርሱም ጋር አለቆችዋን ሁሉ እገድላለሁ፥ ይላል እግዚአብሔር።  \n" +   
                "4 ፤ እግዚአብሔር እንዲህ ይላል። የእግዚአብሔርን ሕግ ጥለዋልና፥ ትእዛዙንም አልጠበቁምና፥ አባቶቻቸውም የተከተሉት ሐሰታቸው አስቶአቸዋልና ስለ ሦስት ወይም ስለ አራት የይሁዳ ኃጢአት መቅሠፍቴን ከማድረግ አልመለስም።  \n" +   
                "5 ፤ በይሁዳ ላይ እሳትን እሰድዳለሁ፥ የኢየሩሳሌምንም አዳራሾች ትበላለች።  \n" +   
                "6 ፤ እግዚአብሔር እንዲህ ይላል። ጻድቁን ስለ ብር፥ ችጋረኛውንም ስለ አንድ ጥንድ ጫማ ሽጠውታልና ስለ ሦስት ወይም ስለ አራት የእስራኤል ኃጢአት መቅሠፍቴን ከማድረግ አልመለስም።  \n" +   
                "7 ፤ የድሆችን ራስ በምድር ትቢያ ላይ ይረግጣሉ፥ የትሑታንንም መንገድ ያጣምማሉ፤ ቅዱሱንም ስሜን ያረክሱ ዘንድ አባትና ልጁ ወደ አንዲት ሴት ይገባሉ፤  \n" +   
                "8 ፤ በመሠዊያውም ሁሉ አጠገብ ለመያዣነት በተወሰደው ልብስ ላይ ይተኛሉ፤ በአምላካቸውም ቤት ውስጥ በካሣ የተወሰደውን ወይን ጠጅ ይጠጣሉ።  \n" +   
                "9 ፤ እኔ ግን ቁመቱ እንደ ዝግባ ቁመት፥ ብርታቱም እንደ ኮምበል ዛፍ የነበረውን አሞራዊውን ከፊታቸው አጠፋሁ፤ ፍሬውንም ከላዩ፥ ሥሩንም ከታቹ አጠፋሁ።  \n" +   
                "10 ፤ የአሞራዊውንም ምድር ትወርሱ ዘንድ ከግብጽ ምድር አወጣኋችሁ፥ በምድረ በዳም አርባ ዓመት መራኋችሁ።  \n" +   
                "11 ፤ ከወንድ ልጆቻችሁም ነቢያትን፥ ከጐበዛዝቶቻችሁም ናዝራውያንን አስነሣሁ፤ እናንተ የእስራኤል ልጆች ሆይ፥ ይህ እንደዚህ አይደለምን? ይላል እግዚአብሔር።  \n" +   
                "12 ፤ እናንተ ግን ናዝራውያኑን የወይን ጠጅ አጠጣችኋቸው፤ ነቢያቱንም። ትንቢትን አትናገሩ ብላችሁ አዘዛችኋቸው።  \n" +   
                "13 ፤ እነሆ፥ ነዶ የተሞላች ሰረገላ እንደምትደቀድቅ እንዲሁ እደቀድቃችኋለሁ።  \n" +   
                "14 ፤ ከርዋጪም ሽሽት ይጠፋል፥ ብርቱውም በብርታቱ አይበረታም፥ ኃያሉም ነፍሱን አያድንም፤  \n" +   
                "15 ፤ ቀስተኛውም አይቆምም፥ ፈጣኑም አይድንም፥ ፈረሰኛውም ነፍሱን አያድንም፤  \n" +   
                "16 ፤ በኃያላኑም መካከል ልበ ሙሉው በዚያ ቀን ዕራቁቱን ሆኖ ይሸሻል፥ ይላል እግዚአብሔር።"));
        return new Chapter(2, verses);
    }

    private Chapter chapterThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "የእስራኤል ልጆች ሆይ፥ እግዚአብሔር በእናንተ፥ ከግብጽ ምድር ባወጣሁት ወገን ሁሉ ላይ የተናገረውን ይህን ቃል ስሙ፤  \n" +   
                "2 ፤ እንዲህም ብሎአል። እኔ ከምድር ወገን ሁሉ እናንተን ብቻችሁን አውቄአችኋለሁ፤ ስለዚህ ስለ ኃጢአታችሁ ሁሉ እበቀላችኋለሁ።  \n" +   
                "3 ፤ በውኑ ሁለት ሰዎች ሳይስማሙ በአንድነት ይሄዳሉን?  \n" +   
                "4 ፤ ወይስ አንበሳ የሚነጥቀው ነገር ሳያገኝ በጫካ ውስጥ ያገሣልን? ወይስ የአንበሳ ደቦል አንዳች ሳይዝ በመደቡ ሆኖ ይጮኻልን?  \n" +   
                "5 ፤ ወይስ ወፍ፥ አጥማጅ ከሌለው፥ በምድር ላይ በወጥመድ ይያዛልን? ወይስ ወስፈንጠር አንዳች ሳይዝ ከምድር ይፈነጠራልን?  \n" +   
                "6 ፤ ወይስ በከተማ ውስጥ መለከት ሲነፋ ሕዝቡ አይፈራምን? ወይስ ክፉ ነገር በከተማ ላይ የመጣ እንደ ሆነ ያደረገው እግዚአብሔር አይደለምን?  \n" +   
                "7 ፤ በእውነት ጌታ እግዚአብሔር ምሥጢሩን ለባሪያዎቹ ለነቢያት ካልነገረ በቀር ምንም አያደርግም።  \n" +   
                "8 ፤ አንበሳው አገሣ፤ የማይፈራ ማን ነው? ጌታ እግዚአብሔር ተናገረ፤ ትንቢት የማይናገር ማን ነው?  \n" +   
                "9 ፤ በአዛጦን አዳራሾችና በግብጽ ምድር አዳራሾች አውሩና። በሰማርያ ተራሮች ላይ ተሰብሰቡ፥ በውስጥዋም የሆነውን ታላቁን ውካታ፥ በመካከልዋም ያለውን ግፍ ተመልከቱ በሉ።  \n" +   
                "10 ፤ ግፍንና ቅሚያን በአዳራሾቻቸው የሚያከማቹት ቅን ነገርን ያደርጉ ዘንድ አያውቁም፥ ይላል እግዚአብሔር።  \n" +   
                "11 ፤ ስለዚህ ጌታ እግዚአብሔር እንዲህ ይላል። በምድሪቱ ዙሪያ ጠላት ይመጣል፤ ብርታትሽንም ከአንቺ ያወርዳል፥ አዳራሾችሽም ይበዘበዛሉ።  \n" +   
                "12 ፤ እግዚአብሔር እንዲህ ይላል። እረኛ ከአንበሳ አፍ ሁለት እግርን ወይም የጆሮን ጫፍ እንደሚያድን፥ እንዲሁ በሰማርያ በአልጋ ማዕዘን፥ በደማስቆም በምንጣፍ ላይ የተቀመጡት የእስራኤል ልጆች ይድናሉ።  \n" +   
                "13 ፤ ስሙ፥ በያዕቆብም ቤት ላይ መስክሩ፥ ይላል የሠራዊት አምላክ ጌታ እግዚአብሔር።  \n" +   
                "14 ፤ እስራኤልን ስለ ኃጢአቱ በምበቀልበት ቀን የቤቴልን መሠዊያዎች ደግሞ እበቀላለሁ፤ የመሠዊያው ቀንዶች ይሰበራሉ፥ ወደ ምድርም ይወድቃሉ።  \n" +   
                "15 ፤ የክረምቱንና የበጋውን ቤት እመታለሁ፤ በዝሆንም ጥርስ የተለበጡት ቤቶች ይጠፋሉ፥ ታላላቆችም ቤቶች ይፈርሳሉ፥ ይላል እግዚአብሔር።" +   
                ""));

        return new Chapter(3, verses);
    }
     
    private Chapter chapterFour() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "በሰማርያ ተራራ የምትኖሩ፥ ድሆችንም የምትበድሉ፥ ችጋረኞችንም የምታሰጨንቁ፥ ጌቶቻቸውንም። አምጡ እንጠጣ የምትሉ እናንተ የባሳን ላሞች ሆይ፥ ይህን ቃል ስሙ።  \n" +   
                "2 ፤ ጌታ እግዚአብሔር። እናንተን በሰልፍ ዕቃ፥ ቅሬታችሁንም በመቃጥን የሚወስዱበት ቀን፥ እነሆ፥ በላያችሁ ይመጣል ብሎ በቅዱስነቱ ምሎአል።  \n" +   
                "3 ፤ እያንዳንዳችሁ በየፊታችሁ በተነደለ ስፍራ ትወጣላችሁ፤ በሬማንም ትጣላላችሁ፥ ይላል እግዚአብሔር።  \n" +   
                "4 ፤ የእስራኤል ልጆች ሆይ፥ ይህን ወድዳችኋልና ወደ ቤቴል ኑና ኃጢአትን ሥሩ፤ ወደ ጌልገላ ኑና ኃጢአትን አብዙ፤ በየማለዳውም መሥዋዕታችሁን፥ በየሦስተኛውም ቀን አሥራታችሁን አቅርቡ፤  \n" +   
                "5 ፤ እርሾ ካለበትም የምስጋናውን መሥዋዕት አቅርቡ፥ በፈቃዳችሁም የምታቀርቡትን አውጁና አውሩ፥ ይላል ጌታ እግዚአብሔር።  \n" +   
                "6 ፤ በከተማችሁ ሁሉ ጥርስን ማጥራት፥ በስፍራችሁም ሁሉ እንጀራን ማጣት ሰጠኋችሁ፤ እናንተ ግን ወደ እኔ አልተመለሳችሁም፥ ይላል እግዚአብሔር።  \n" +   
                "7 ፤ መከር ሳይደርስ ገና ከሦስት ወር በፊት ዝናብ ከለከልኋችሁ፤ በአንድም ከተማ ላይ አዘነብሁ፥ በሌላውም ከተማ ላይ እንዳይዘንብ አደረግሁ፤ በአንድ ወገን ዘነበ፥ ያልዘነበበትም ወገን ደረቀ።  \n" +   
                "8 ፤ የሁለት ወይም የሦስት ከተሞች ሰዎች ወደ አንዲት ከተማ ወኃ ይጠጡ ዘንድ ሄዱ፥ ነገር ግን አልረኩም፤ እናንተ ግን ወደ እኔ አልተመለሳችሁም፥ ይላል እግዚአብሔር።  \n" +   
                "9 ፤ በዋግና በአረማሞ መታኋችሁ፤ የአታክልቶቻችሁንም ብዛት ወይኖቻችሁንም በለሶቻችሁንም ወይራዎቻችሁንም ተምች በልቶአል፤ እናንተ ግን ወደ እኔ አልተመለሳችሁም፥ ይላል እግዚአብሔር።  \n" +   
                "10 ፤ በግብጽ እንደ ነበረው ቸነፈርን ሰደድሁባችሁ፤ ጐበዛዝቶቻችሁን በሰይፍ ገደልሁ፥ ፈረሶቻችሁንም አስማረክሁ፤ የሰፈራችሁንም ግማት ወደ አፍንጫችሁ አወጣሁ፤ እናንተ ግን ወደ እኔ አልተመለሳችሁም፥ ይላል እግዚአብሔር።  \n" +   
                "11 ፤ ሰዶምንና ገሞራን እግዚአብሔር እንደ ገለበጣቸው፥ እንዲሁ ገለበጥኋችሁ፥ እናንተም ከእሳት ውስጥ እንደ ተነጠቀ ትንታግ ሆናችሁ፤ ነገር ግን ወደ እኔ አልተመለሳችሁም፥ ይላል እግዚአብሔር።  \n" +   
                "12 ፤ ስለዚህ፥ እስራኤል ሆይ፥ እንደዚህ አደርግብሃለሁ፤ እስራኤልም ሆይ፥ እንደዚህ ስለማደርግብህ አምላክህን ለመገናኘት ተዘጋጅ።  \n" +   
                "13 ፤ እነሆ፥ ተራሮችን የሠራ፥ ነፋስንም የፈጠረ፥ የልቡንም አሳብ ለሰው የሚነግር፥ ንጋትን ጨለማ የሚያደርግ፥ በምድርም ከፍታዎች ላይ የሚረግጥ፥ ስሙ የሠራዊት አምላክ እግዚአብሔር ነው።"));

        return new Chapter(4, verses);
    }

    private Chapter chapterFive() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "የእስራኤል ቤት ሆይ፥ በእናንተ ላይ ለሙሾ የማነሣውን ይህን ቃል ስሙ።  \n" +   
                "2 ፤ የእስራኤል ድንግል ወደቀች፥ ከእንግዲህም ወዲህ አትነሣም፤ በምድርዋ ላይ ተጣለች፥ የሚያስነሣትም የለም።  \n" +   
                "3 ፤ ጌታ እግዚአብሔርም እንዲህ ይላልና። ሺህ ከሚወጣባት ከተማ መቶ ይቀርላታል፥ መቶም ከሚወጣባት ከተማ ለእስራኤል ቤት አሥር ይቀርላታል።  \n" +   
                "4 ፤ እግዚአብሔርም ለእስራኤል ቤት እንዲህ ይላልና። እኔን ፈልጉ፥ በሕይወትም ትኖራላችሁ፤  \n" +   
                "5 ፤ ነገር ግን ጌልገላ ፈጽሞ ትማረካለችና፥ ቤቴልም ከንቱ ትሆናለችና ቤቴልን አትፈልጉ፥ ወደ ጌልገላም አትግቡ፥ ወደ ቤርሳቤህም አትለፉ።  \n" +   
                "6 ፤ በዮሴፍ ቤት እሳት እንዳትቃጠል፥ በቤቴል የሚያጠፋትም ሳይኖር እንዳትበላ፥ እግዚአብሔርን ፈልጉ፥ በሕይወትም ትኖራላችሁ።  \n" +   
                "7 ፤ ፍርድን ወደ እሬት የምትለውጡ፥ ጽድቅንም በምድር ላይ የምትጥሉ እናንተ ሆይ፥  \n" +   
                "8 ፤ ሰባቱን ከዋክብትና ኦሪዮን የተባለውን ኮከብ የፈጠረውን፥ የሞትን ጥላ ወደ ንጋት የሚለውጠውን፥ ቀኑንም በሌሊት የሚያጨልመውን፥ የባሕሩንም ውኆች ጠርቶ በምድር ፊት ላይ የሚያፈስሳቸውን፥  \n" +   
                "9 ፤ አምባውም እንዲፈርስ በብርቱ ላይ የድንገት ጥፋት የሚያመጣውን ፈልጉ፤ ስሙ እግዚአብሔር ነው።  \n" +   
                "10 ፤ በበሩ አደባባይ የሚገሥጸውን ጠሉ፥ እውነትም የሚናገረውን ተጸየፉ።  \n" +   
                "11 ፤ ድሀውንም ደብድባችኋልና፥ የስንዴውንም ቀረጥ ከእርሱ ወስዳችኋልና ከተጠረበ ድንጋይ ቤቶችን ሠርታችኋል፥ ነገር ግን አትቀመጡባቸውም፤ ያማሩ የወይን ቦታዎች ተክላችኋል፥ ነገር ግን ከወይን ጠጃቸው አትጠጡም።  \n" +   
                "12 ፤ ጻድቁን የምታስጨንቁ፥ ጉቦንም የምትቀበሉ፥ በበሩም አደባባይ የችጋረኛውን ፍርድ የምታጣምሙ እናንተ ሆይ፥ በደላችሁ እንዴት እንደ በዛ፥ ኃጢአታችሁም እንዴት እንደ ጸና እኔ አውቃለሁና።  \n" +   
                "13 ፤ ስለዚህ ክፉ ዘመን ነውና በዚያ ዘመን አስተዋይ የሚሆን ዝም ይላል።  \n" +   
                "14 ፤ በሕይወት ትኖሩ ዘንድ መልካሙን እንጂ ክፉውን አትፈልጉ፤ እንዲህም እናንተ እንደ ተናገራችሁ የሠራዊት አምላክ እግዚአብሔር ከእናንተ ጋር ይሆናል።  \n" +   
                "15 ፤ ክፉውን ጥሉ፥ መልካሙንም ውደዱ፥ በበሩም አደባባይ ፍርድን አጽኑ፤ ምናልባት የሠራዊት አምላክ እግዚአብሔር ለዮሴፍ ቅሬታ ይራራ ይሆናል።  \n" +   
                "16 ፤ ስለዚህ ጌታ የሠራዊት አምላክ እግዚአብሔር እንዲህ ይላል። በየአደባባዩ ሁሉ ላይ ዋይታ ይሆናል፤ በየመንገዱም ሁሉ ላይ ወዮ ወዮ ይባላል፤ ገበሬዎቹም ወደ ልቅሶ፥ አልቃሾቹም ወደ ዋይታ ይጠራሉ።  \n" +   
                "17 ፤ በመካከልህ አልፋለሁና በወይኑ ቦታ ሁሉ ልቅሶ ይሆናል፥ ይላል እግዚአብሔር።  \n" +   
                "18 ፤ የእግዚአብሔርን ቀን ለምትፈልጉ ወዮላችሁ! የእግዚአብሔርን ቀን ለምን ትፈልጋላችሁ? ጨለማ ነው እንጂ ብርሃን አይደለም።  \n" +   
                "19 ፤ ከአንበሳ ፊት እንደ ሸሸ ድብም እንዳገኘው ሰው፥ ወይም ወደ ቤት ገብቶ እጁን በግድግዳ ላይ እንዳስደገፈና እባብ እንደ ነደፈው ሰው ነው።  \n" +   
                "20 ፤ የእግዚአብሔር ቀን ብርሃን ሳይሆን ጨለማ አይደለምን? ፀዳል የሌለውም ድቅድቅ ጨለማ አይደለምን?  \n" +   
                "21 ፤ ዓመት በዓላችሁን ጠልቼዋለሁ ተጸይፌውማለሁ፤ የተቀደሰውም ጉባኤአችሁ ደስ አያሰኘኝም።  \n" +   
                "22 ፤ የሚቃጠለውን መሥዋዕታችሁና የእህሉን ቍርባናችሁን ብታቀርቡልኝም እንኳ አልቀበለውም፤ ለምስጋና መሥዋዕት የምታቀርቡልኝን የሰቡትን እንስሶች አልመለከትም።  \n" +   
                "23 ፤ የዝማሬህንም ጩኸት ከእኔ ዘንድ አርቅ፤ የመሰንቆህንም ዜማ አላደምጥም።  \n" +   
                "24 ፤ ነገር ግን ፍርድ እንደ ውኃ፥ ጽድቅም እንደማይደርቅ ፈሳሽ ይፍሰስ።  \n" +   
                "25 ፤ የእስራኤል ቤት ሆይ፥ በውኑ በምድረ በዳ አርባ ዓመት ሙሉ መሥዋዕትንና ቍርባንን አቅርባችሁልኛልን?  \n" +   
                "26 ፤ ለራሳችሁም የሠራችኋቸውን ምስሎች፥ የሞሎክን ድንኳንና የአምላካችሁን የሬፋን ኮከብ አነሣችሁ።  \n" +   
                "27 ፤ ስለዚህ ከደማስቆ ወደዚያ አስማርካችኋለሁ፥ ይላል ስሙ የሠራዊት አምላክ የተባለ እግዚአብሔር።"));

        return new Chapter(5, verses);
    }

    private Chapter chapterSix() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "በጽዮን ላሉ ዓለመኞች፥ በሰማርያም ተራራ ላይ ተዘልለው ለተቀመጡ፥ የእስራኤልም ቤት ወደ እነርሱ ለመጡባቸው ለአሕዛብ አለቆች ወዮላቸው!  \n" +   
                "2 ፤ ወደ ካልኔ አልፋችሁ ተመልከቱ፤ ከዚያም ወደ ታላቂቱ ሐማት ሂዱ፤ ከዚያም ወደ ፍልስጥኤም ጌት ውረዱ፤ እነርሱ ከእነዚህ መንግሥታት ይሻላሉን? ወይስ ድንበራቸው ከድንበራችሁ ይሰፋልን?  \n" +   
                "3 ፤ ክፉውን ቀን ከእናንተ ለምታርቁ፥ የግፍንም ወንበር ለምታቀርቡ፥  \n" +   
                "4 ፤ ከዝሆን ጥርስ በተሠራ አልጋ ላይ ለምትተኙ፥ በምንጣፋችሁም ላይ ተደላድላችሁ ለምትቀመጡ፥ ከበጎችም መንጋ ጠቦትን ከጋጥም ውስጥ ጥጃን ለምትበሉ፥  \n" +   
                "5 ፤ በመሰንቆም ድምፅ ለምትንጫጩ፥ እንደ ዳዊትም የዜማን ዕቃ ለምታዘጋጁ፥  \n" +   
                "6 ፤ በፋጋ የወይን ጠጅ ለምትጠጡ፥ እጅግ ባማረ ሽቱም ለምትቀቡ፥ ስለ ዮሴፍ መከራ ግን ለማታዝኑ ለእናንተ ወዮላችሁ!  \n" +   
                "7 ፤ ስለዚህ በምርኮ መጀመሪያ ይማረካሉ፥ ተደላድለው ከተቀመጡትም ዘንድ ዘፈን ይርቃል።  \n" +   
                "8 ፤ ጌታ እግዚአብሔር። የያዕቆብን ትዕቢት ተጸይፌአለሁ፥ አዳራሾቹንም ጠልቻለሁ፤ ስለዚህ ከተማይቱንና የሚኖሩባትን ሁሉ አሳልፌ እሰጣለሁ ብሎ በራሱ ምሎአል፥ ይላል የሠራዊት አምላክ እግዚአብሔር።  \n" +   
                "9 ፤ እንዲህም ይሆናል፤ አሥር ሰዎች በአንድ ቤት ውስጥ ቢቀሩ እነርሱ ይሞታሉ።  \n" +   
                "10 ፤ አጥንቱንም ከቤቱ ያወጡ ዘንድ የሰው ዘመድና አቃጣዩ ባነሡት ጊዜ፥ በቤቱም ውስጥ ያለውን። እስከ አሁን ድረስ ገና ሰው በአንተ ዘንድ አለን? ባለው ጊዜ፥ እርሱም። ማንም የለም ባለ ጊዜ፤ ያን ጊዜ። የእግዚአብሔርን ስም እንጠራ ዘንድ አይገባንምና ዝም በል ይለዋል።  \n" +   
                "11 ፤ እነሆም፥ እግዚአብሔር ያዝዛል፤ ታላቁንም ቤት በማፍረስ፥ ታናሹንም ቤት በመሰባበር ይመታል።  \n" +   
                "12 ፤  \n" +   
                "13 ፤ ፍርድን ወደ ሐሞት፥ የጽድቅንም ፍሬ ወደ እሬት የለወጣችሁ፥ በከንቱም ነገር ደስ የሚላችሁ። በኃይላችን ቀንድ የወሰድን አይደለምን? የምትሉ፥ እናንተ ሆይ፥ በውኑ ፈረሶች በጭንጫ ላይ ይጋልባሉን? ወይስ በሬዎች በዚያ ላይ ያርሳሉን?  \n" +   
                "14 ፤ የእስራኤል ቤት ሆይ፥ እነሆ፥ እኔ ሕዝብን አስነሣባችኋለሁ፥ ይላል የሠራዊት አምላክ እግዚአብሔር፤ እነርሱም ከሐማት መግቢያ ጀምረው እስከ ዓረባ ወንዝ ድረስ ያስጨንቋችኋል።"));

        return new Chapter(6, verses);
    }

    private Chapter chapterSeven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ጌታ እግዚአብሔር እንዲህ አሳየኝ፤ እነሆም፥ የኋለኛው ሣር በሚበቅልበት መጀመሪያ ላይ አንበጣን ፈጠረ፤ እነሆም፥ ከንጉሡ አጨዳ በኋላ የበቀለ የገቦ ነበረ።  \n" +   
                "2 ፤ የምድሩንም ሣር በልተው ከጨረሱ በኋላ፥ እኔ። ጌታ እግዚአብሔር ሆይ፥ ይቅር እንድትል እለምንሃለሁ፤ ያዕቆብ ታናሽ ነውና እንዴት ይቆማል? አልሁ።  \n" +   
                "3 ፤ እግዚአብሔርም ስለዚህ ነገር ተጸጸተ፤ ይህ አይሆንም፥ ይላል እግዚአብሔር።  \n" +   
                "4 ፤ ጌታ እግዚአብሔርም እንዲህ አሳየኝ፤ እነሆም፥ ጌታ እግዚአብሔር በእሳት ለመፍረድ ጠራ፤ እርስዋም ታላቁን ቀላይና ምድርን በላች።  \n" +   
                "5 ፤ እኔም። ጌታ እግዚአብሔር ሆይ፥ እንድትተው እለምንሃለሁ፤ ያዕቆብ ታናሽ ነውና እንዴት ይቆማል? አልሁ።  \n" +   
                "6 ፤ እግዚአብሔርም ስለዚህ ነገር ተጸጸተ፤ ይህ ደግሞ አይሆንም፥ ይላል ጌታ እግዚአብሔር።  \n" +   
                "7 ፤ እንዲህም አሳየኝ፤ እነሆም፥ ጌታ ቱንቢውን ይዞ በቱንቢ በተሠራ ቅጥር ላይ ቆሞ ነበር።  \n" +   
                "8 ፤ እግዚአብሔርም። አሞጽ ሆይ፥ የምታየው ምንድር ነው? አለኝ። እኔም። ቱንቢ ነው አልሁ። ጌታም። እነሆ፥ በሕዝቤ በእስራኤል መካከል ቱንቢ አደርጋለሁ፤ ከእንግዲህም ወዲህ ደግሞ አላልፋቸውም፤  \n" +   
                "9 ፤ የይስሐቅም የኮረብታው መስገጃዎች ይፈርሳሉ፥ የእስራኤልም መቅደሶች ባድማ ይሆናሉ፤ በኢዮርብዓምም ቤት ላይ በሰይፍ እነሣለሁ አለ።  \n" +   
                "10 ፤  \n" +   
                "11 ፤ የቤቴልም ካህን አሜስያስ ወደ እስራኤል ንጉሥ ወደ ኢዮርብዓም ልኮ። አሞጽ። ኢዮርብዓም በሰይፍ ይሞታል፥ እስራኤልም ከአገሩ ተማርኮ ይሄዳል ብሎአልና አሞጽ በእስራኤል ቤት መካከል ዐምፆብሃል፤ ምድሪቱም ቃሉን ሁሉ ልትሸከም አትችልም አለ።  \n" +   
                "12 ፤ አሜስያስም አሞጽን። ባለ ራእዩ ሆይ፥ ሂድ ወደ ይሁዳም ምድር ሽሽ፥ በዚያም እንጀራን ብላ፥  \n" +   
                "13 ፤ በዚያም ትንቢትን ተናገር፤ ነገር ግን ቤቴል የንጉሥ መቅደስና የመንግሥት ቤት ናትና ከእንግዲህ ወዲህ በዚህ ደግሞ ትንቢት አትናገር አለው።  \n" +   
                "14 ፤ አሞጽም መልሶ አሜስያስን አለው። እኔ ላም ጠባቂና ወርካ ለቃሚ ነኝ እንጂ ነቢይ ወይም የነቢይ ልጅ አይደለሁም፤  \n" +   
                "15 ፤ እግዚአብሔርም በጎቹን ከመከተል ወሰደኝ፥ እግዚአብሔርም። ሂድ፥ ለሕዝቤም ለእስራኤል ትንቢት ተናገር አለኝ።  \n" +   
                "16 ፤ አሁንም የእግዚአብሔርን ቃል ስማ፤ አንተ። በእስራኤል ላይ ትንቢት አትናገር፥ በይስሐቅም ቤት ላይ አትስበክ ብለሃል፤  \n" +   
                "17 ፤ ስለዚህ እግዚአብሔር እንዲህ ይላል። ሚስትህ በከተማይቱ ውስጥ ጋለሞታ ትሆናለች፥ ወንዶችና ሴቶች ልጆችህም በሰይፍ ይወድቃሉ፥ ምድርህም በገመድ ትከፈላለች፤ አንተም በረከሰች ምድር ትሞታለህ፥ እስራኤልም ከምድሩ ተማርኮ ይሄዳል።"));

        return new Chapter(7, verses);
    }

    private Chapter chapterEight() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ጌታ እግዚአብሔር እንዲህ አሳየኝ እነሆም፥ የቃርሚያ ፍሬ የሞላበት ዕንቅብ ነበረ።  \n" +   
                "2 ፤ እርሱም። አሞጽ ሆይ፥ የምታየው ምንድር ነው? አለኝ። እኔም። የቃርሚያ ፍሬ የሞላበት ዕንቅብ ነው አልሁት። እግዚአብሔርም አለኝ። ፍጻሜ በሕዝቤ በእስራኤል ላይ መጥቶአል፤ ከእንግዲህ ወዲህ ደግሞ አላልፋቸውም።  \n" +   
                "3 ፤ የመቅደሱ ዝማሬ በዚያ ቀን ዋይታ ይሆናል፥ ይላል ጌታ እግዚአብሔር፤ የሰዎችም ሬሳ ይበዛል፥ በስፍራውም ሁሉ በዝምታ ይጣላል።  \n" +   
                "4 ፤ ችጋረኛውን የምትውጡ፥ የአገሩንም ድሀ የምታጠፉ እናንተ ሆይ።  \n" +   
                "5 ፤ እህልን እንሸጥ ዘንድ መባቻው መቼ ያልፋል? የኢፍ መስፈሪያውንም እያሳነስን፥ ሰቅሉንም እያበዛን፥ በሐሰተኛም ሚዛን እያታለልን፥  \n" +   
                "6 ፤ ድሀውን በብር ችጋረኛውንም በአንድ ጥንድ ጫማ እንገዛ ዘንድ፥ የስንዴውን ግርድ እንሸጥ ዘንድ ስንዴውን እንድንሸምት ሰንበት መቼ ያልፋል? የምትሉ እናንተ ሆይ፥ ይህን ስሙ።  \n" +   
                "7 ፤ እግዚአብሔር በያዕቆብ ክብር እንዲህ ብሎ ምሎአል። ሥራቸውን ሁሉ ለዘላለም ምንም አልረሳም።  \n" +   
                "8 ፤ በውኑ ምድሪቱ ስለዚህ ነገር አትናወጥምን? በእርስዋም የሚኖር ሁሉ አያለቅስምን? ሙላዋም እንደ ወንዙ ትነሣለች፤ እንደ ግብጽም ወንዝ ትነሣለች ደግሞም ትወርዳለች።  \n" +   
                "9 ፤ በዚያም ቀን ፀሐይ በቀትር እንድትገባ አደርጋለሁ፥ ይላል ጌታ እግዚአብሔር፤ በብርሃንም ቀን ምድሩን አጨልማለሁ።  \n" +   
                "10 ፤ ዓመት በዓላችሁንም ወደ ልቅሶ፥ ዝማሬአችሁንም ወደ ዋይታ እለውጣለሁ፤ ማቅንም በወገብ ሁሉ፥ ራስ መንጨትንም በሁሉ ላይ አመጣለሁ፤ እንደ አንድያ ልጅም ልቅሶ፥ ፍጻሜውንም እንደ መራራ ቀን አደርገዋለሁ።  \n" +   
                "11 ፤ እነሆ፥ በምድር ላይ ራብን የምሰድድበት ዘመን ይመጣል፥ ይላል ጌታ እግዚአብሔር፤ እርሱም የእግዚአብሔርን ቃል ከመስማት እንጂ እንጀራን ከመራብና ውኃን ከመጠማት አይደለም።  \n" +   
                "12 ፤ ከባሕርም እስከ ባሕር ድረስ፥ ከሰሜንም እስከ ምሥራቅ ድረስ ይቅበዘበዛሉ፤ የእግዚአብሔርን ቃል ለመሻት ይርዋርዋጣሉ፥ አያገኙትምም።  \n" +   
                "13 ፤ በዚያ ቀን መልካካሞች ደናግል ጐበዛዝትም በጥም ይዝላሉ።  \n" +   
                "14 ፤ በሰማርያ ኃጢአት የሚምሉና። ዳን ሆይ፥ ሕያው አምላክህን! ደግሞ። ሕያው የቤርሳቤህን መንገድ! ብለው የሚሉ፥ እነርሱ ይወድቃሉ፥ ደግሞም አይነሡም።y"));

        return new Chapter(8, verses);
    }

    private Chapter chapterNine() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ጌታን በመሠዊያው አጠገብ ቆሞ አየሁት፤ እርሱም እንዲህ አለ። መድረኮቹ ይናወጡ ዘንድ ጕልላቶቹን ምታ፥ በራሳቸውም ሁሉ ላይ ሰባብራቸው፤ እኔም ከእነርሱ የቀሩትን በሰይፍ እገድላለሁ፤ የሚሸሽ አያመልጥም፥ የሚያመልጥም አይድንም።  \n" +   
                "2 ፤ ወደ ሲኦል ቢወርዱ እጄ ከዚያ ታወጣቸዋለች፤ ወደ ሰማይም ቢወጡ ከዚያ አወርዳቸዋለሁ፤  \n" +   
                "3 ፤ በቀርሜሎስም ራስ ውስጥ ቢሸሸጉ ፈልጌ ከዚያ አወጣቸዋለሁ፤ በጥልቅ ባሕርም ውስጥ ከዓይኔ ቢደበቁ ከዚያ እባቡን አዝዛለሁ፥ እርሱም ይነድፋቸዋል፤  \n" +   
                "4 ፤ በጠላቶቻቸውም ፊት ተማርከው ቢሄዱ ከዚያ ሰይፍን አዝዛለሁ፥ እርሱም ይገድላቸዋል፤ ዓይኔንም በእነርሱ ላይ ለክፋት እንጂ ለመልካም አላደርግም።  \n" +   
                "5 ፤ የሠራዊት ጌታ እግዚአብሔር ምድርን ይዳስሳል እርስዋም ትቀልጣለች፥ የሚኖሩባትም ሁሉ ያለቅሳሉ፤ ሙላዋም እንደ ግብጽ ወንዝ ትነሣለች፥ ደግሞ እንደ ግብጽ ወንዝ ትወርዳለች።  \n" +   
                "6 ፤ አዳራሹን በሰማይ የሠራ፥ ጠፈሩንም በምድር ላይ የመሠረተ፥ የባሕርንም ውኃ ጠርቶ በምድር ፊት ላይ የሚያፈስሰው እርሱ ነው፤ ስሙም እግዚአብሔር ነው።  \n" +   
                "7 ፤ የእስራኤል ልጆች ሆይ፥ እናንተ ለእኔ እንደ ኢትዮጵያ ልጆች አይደላችሁምን? ይላል እግዚአብሔር። እስራኤልን ከግብጽ ምድር፥ ፍልስጥኤማውያንንም ከከፍቶር፥ ሶርያውያንንም ከቂር አላወጣሁምን?  \n" +   
                "8 ፤ እነሆ፥ የጌታ የእግዚአብሔር ዓይኖች በኃጢአተኛ መንግሥት ላይ ናቸው፥ ከምድርም ፊት አጠፋታለሁ፤ ነገር ግን የያዕቆብን ቤት ፈጽሜ አላጠፋም፥ ይላል እግዚአብሔር።  \n" +   
                "9 ፤ እነሆ፥ አዝዛለሁ፥ እህልም በወንፊት እንዲነፋ የእስራኤልን ቤት በአሕዛብ ሁሉ መካከል እነፋለሁ፤ ነገር ግን አንዲት ቅንጣት በምድር ላይ አትወድቅም።  \n" +   
                "10 ፤ ክፉው ነገር አይደርስብንም፥ አያገኘንምም የሚሉ የሕዝቤ ኃጢአተኞች ሁሉ በሰይፍ ይሞታሉ።  \n" +   
                "11 ፤ በዚያ ቀን የወደቀችውን የዳዊትን ድንኳን አነሣለሁ፥ የተናደውንም ቅጥርዋን እጠግናለሁ፤ የፈረሰውንም አድሳለሁ፥ እንደ ቀደመውም ዘመን እሠራታለሁ፤  \n" +   
                "12 ፤ ይኸውም የኤዶምያስን ቅሬታ፥ ስሜም የተጠራባቸውን አሕዛብን ሁሉ ይወርሱ ዘንድ ነው፥ ይላል ይህን የሚያደርግ እግዚአብሔር።  \n" +   
                "13 ፤ እነሆ፥ አራሹ አጫጁን፥ ወይን ጠማቂውም ዘሪውን የሚያገኝበት ወራት ይመጣል፥ ይላል እግዚአብሔር፤ ተራሮችም በተሀውን የወይን ጠጅ ያንጠባጥባሉ፥ ኮረብቶችም ሁሉ ይቀልጣሉ።  \n" +   
                "14 ፤ የሕዝቤን የእስራኤልን ምርኮ እመልሳለሁ፥ የፈረሱትንም ከተሞች ሠርተው ይቀመጡባቸዋል፤ ወይንንም ይተክላሉ፥ የወይን ጠጁንም ይጠጣሉ፤ አታክልትንም ያባጃሉ፥ ፍሬውንም ይበላሉ።  \n" +   
                "15 ፤ በምድራቸውም እተክላቸዋለሁ፥ ከእንግዲህም ወዲህ ከሰጠኋቸው ከምድራቸው አይነቀሉም፥ ይላል አምላክህ እግዚአብሔር"));
        return new Chapter(9, verses);

}