package com.example.bibleapp.books.added;

import com.example.bibleapp.models.Book;
import com.example.bibleapp.models.Chapter;
import com.example.bibleapp.models.Verse;

import java.util.ArrayList;
import java.util.List;

public class HAGGAI {
    private Book HAGGAIBook;

    public HAGGAI() {
        List<Chapter> chapters = new ArrayList<>();
        chapters.add(chapterOne());
        chapters.add(chapterTwo());
 
        HAGGAIBook = new Book("ትንቢተ ሐጌ", chapters);
    }

    public Book getHAGGAIBook() {
        return HAGGAIBook;
    }

    private Chapter chapterOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","በንጉሡ በዳርዮስ በሁለተኛው ዓመት በስድስተኛው ወር ከወሩም በመጀመሪያው ቀን የእግዚአብሔር ቃል በነቢዩ በሐጌ እጅ ወደ ይሁዳ አለቃ ወደ ሰላትያል ልጅ ወደ ዘሩባቤል፥ ወደ ታላቁም ካህን ወደ ኢዮሴዴቅ ልጅ ወደ ኢያሱ እንዲህ ሲል መጣ።  \n" +   
                "2 ፤ የሠራዊት ጌታ እግዚአብሔር። ይህ ሕዝብ። ዘመኑ አልደረሰም፥ የእግዚአብሔር ቤት የሚሠራበት ዘመን አልደረሰም ይላል ብሎ ተናገረ።  \n" +   
                "3 ፤ የእግዚአብሔርም ቃል በነቢዩ በሐጌ እጅ እንዲህ ሲል መጣ።  \n" +   
                "4 ፤ በውኑ ይህ ቤት ፈርሶ ሳለ እናንተ ራሳችሁ በተሸለሙ ቤቶቻችሁ ለመኖር ጊዜው ነውን?  \n" +   
                "5 ፤ አሁንም የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። ልባችሁን በመንገዳችሁ ላይ አድርጉ።  \n" +   
                "6 ፤ ብዙ ዘራችሁ፥ ጥቂትም አገባችሁ፤ በላችሁ፥ ነገር ግን አልጠገባችሁም፤ ጠጣችሁ፥ ነገር ግን አልረካችሁም፤ ለበሳችሁ፥ ነገር ግን አልሞቃችሁም፤ ደመወዙን የተቀበለ ሰው በቀዳዳ ከረጢት ያደርገው ዘንድ ደመወዙን ተቀበለ።  \n" +   
                "7 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። ልባችሁን በመንገዳችሁ ላይ አድርጉ።  \n" +   
                "8 ፤ ወደ ተራራው ውጡ፥ እንጨትንም አምጡ፥ ቤቱንም ሥሩ፤ እኔም በእርሱ ደስ ይለኛል፥ እኔም እመሰገናለሁ፥ ይላል እግዚአብሔር።  \n" +   
                "9 ፤ እናንተ ብዙ ነገርን ተስፋ አደረጋችሁ፥ እነሆም፥ ጥቂት ሆነ፤ ወደ ቤትም ባገባችሁት ጊዜ እፍ አልሁበት። ይህ ስለ ምንድር ነው? ይላል የሠራዊት ጌታ እግዚአብሔር። እናንተ ሁሉ ወደ እየቤታችሁ እየሮጣችሁ የእኔ ቤት ፈርሶ ስለ ተቀመጠ ነው።  \n" +   
                "10 ፤ ስለዚህ ሰማያት በላያችሁ ጠልን ከልክለዋል፥ ምድሪቱም ፍሬዋን ከልክላለች።  \n" +   
                "11 ፤ እኔም በምድርና በተራሮች፥ በእህልና በወይንም፥ በዘይትና ምድርም በምታበቅለው ላይ፥ በሰዎችና በእንስሶችም ላይ፥ እጅም በሚደክምበት ሁሉ ላይ ድርቅን ጠርቻለሁ።  \n" +   
                "12 ፤ የሰላትያልም ልጅ ዘሩባቤል፥ ታላቁም ካህን የኢዮሴዴቅ ልጅ ኢያሱ፥ የቀሩትም ሕዝብ ሁሉ የአምላካቸውን የእግዚአብሔርን ድምፅ የነቢዩንም የሐጌን ቃል፥ አምላካቸው እግዚአብሔር እንደ ላከው ሁሉ ሰሙ፤ ሕዝቡም በእግዚአብሔር ፊት ፈሩ።  \n" +   
                "13 ፤ የእግዚአብሔርም መልእክተኛ ሐጌ በእግዚአብሔር መልእክት ሕዝቡን። እኔ ከእናንተ ጋር ነኝ፥ ይላል እግዚአብሔር ብሎ ተናገረ።  \n" +   
                "14 ፤  \n" +   
                "15 ፤ እግዚአብሔርም የይሁዳን አለቃ የሰላትያልን ልጅ የዘሩባቤልን መንፈስ፥ የታላቁንም ካህን የኢዮሴዴቅን ልጅ የኢያሱን መንፈስ፥ የቀሩትንም ሕዝብ ሁሉ መንፈስ አስነሣ፤ በንጉሡም በዳርዮስ በሁለተኛው ዓመት በስድስተኛው ወር ከወሩም በሀያ አራተኛው ቀን መጡ፥ የአምላካቸውንም የሠራዊትን ጌታ የእግዚአብሔርን ቤት ሠሩ።"));

        return new Chapter(1, verses);
    }

    private Chapter chapterTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "በሰባተኛው ወር ከወሩም በሀያ አንደኛው ቀን የእግዚአብሔር ቃል በነቢዩ በሐጌ እጅ እንዲህ ሲል መጣ።  \n" +   
                "2 ፤ ለይሁዳ አለቃ ለሰላትያል ልጅ ለዘሩባቤል፥ ለታላቁም ካህን ለኢዮሴዴቅ ልጅ ለኢያሱ፥ ለቀሩትም ሕዝብ እንዲህ ስትል ተናገር።  \n" +   
                "3 ፤ በቀድሞ ክብሩ ሳለ ይህን ቤት ያየ በእናንተ መካከል የቀረ ማን ነው? ዛሬስ እንዴት ሆኖ አያችሁት? በዓይናችሁ እንደ ምናምን አይደለምን?  \n" +   
                "4 ፤ አሁን ግን፥ ዘሩባቤል ሆይ፥ በርታ፥ ይላል እግዚአብሔር፤ ታላቁም ካህን የኢዮሴዴቅ ልጅ ኢያሱ ሆይ፥ በርታ፥ እናንተም የአገሩ ሕዝብ ሆይ፥ በርቱና ሥሩ፥ ይላል እግዚአብሔር፤ እኔ ከእናንተ ጋር ነኝና፥ ይላል የሠራዊት ጌታ እግዚአብሔር።  \n" +   
                "5 ፤ መንፈሴም በመካከላችሁ ይኖራልና አትፍሩ።  \n" +   
                "6 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላልና። ገና አንድ ጊዜ በቅርብ ዘመን እኔ ሰማያትንና ምድርን ባሕርንና የብስንም አናውጣለሁ፤  \n" +   
                "7 ፤ አሕዛብን ሁሉ አናውጣለሁ፥ በአሕዛብ ሁሉ የተመረጠውም ዕቃ ይመጣል፤ ይህንም ቤት በክብር እሞላዋለሁ፥ ይላል የሠራዊት ጌታ እግዚአብሔር።  \n" +   
                "8 ፤ ብሩ የእኔ ነው፥ ወርቁም የእኔ ነው፥ ይላል የሠራዊት ጌታ እግዚአብሔር።  \n" +   
                "9 ፤ ከፊተኛው ይልቅ የዚህ የሁለተኛው ቤት ክብር ይበልጣል፥ ይላል የሠራዊት ጌታ እግዚአብሔር፤ በዚህም ስፍራ ሰላምን እሰጣለሁ፥ ይላል የሠራዊት ጌታ እግዚአብሔር።  \n" +   
                "10 ፤ በዳርዮስም በሁለተኛው ዓመት በዘጠነኛው ወር በሀያ አራተኛው ቀን የእግዚአብሔር ቃል በነቢዩ በሐጌ እጅ እንዲህ ሲል መጣ።  \n" +   
                "11 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። ካህናቱን ስለ ሕጉ ጠይቅ፤  \n" +   
                "12 ፤ አንድ ሰው የተቀደሰ ሥጋ በልብሱ ዘርፍ ቢይዝ፥ በዘርፉም እንጀራ ወይም ወጥ፥ ወይም የወይን ጠጅ፥ ወይም ዘይት፥ ወይም ማናቸውም መብል ቢነካ ያ የተነካው በውኑ ይቀደሳልን? ብለህ ካህናቱን ጠይቃቸው፤ ካህናቱም። አይሆንም ብለው መለሱ።  \n" +   
                "13 ፤ ሐጌም። በሬሳ የረከሰ ሰው ከእነዚህ አንዱን ቢነካ ያ የተነካው በውኑ ይረክሳልን? አለ። ካህናቱም። አዎን ይረክሳል ብለው መለሱ።  \n" +   
                "14 ፤ ሐጌም መልሶ እንዲህ አለ። ይህ ሕዝብና ይህ ወገን በፊቴ እንዲሁ ነው፥ ይላል እግዚአብሔር፤ የእጃቸውም ሥራ ሁሉ እንዲሁ ነው፤ በዚያም ያቀረቡት ነገር ርኩስ ነው።  \n" +   
                "15 ፤ አሁንም ድንጋይ በድንጋይ ላይ በእግዚአብሔር መቅደስ ሳይነባበር፥ ከዛሬ ጀምራችሁ ወዳለፈው ዘመን ልብ አድርጉ።  \n" +   
                "16 ፤ በዚያን ዘመን ሁሉ ሰው ሀያ መስፈሪያ ወዳለበት ምርት በመጣ ጊዜ፥ የተገኘው አሥር መስፈሪያ ብቻ ነው፤ አምሳ ማድጋም ይቀዳ ዘንድ ወደ መጥመቂያው በመጣ ጊዜ፥ የተገኘው ሀያ ብቻ ነው።  \n" +   
                "17 ፤ በእጃችሁ ሥራ ሁሉ ላይ በዋግና በአረማሞ በበረዶም መታኋችሁ፤ እናንተ ግን ወደ እኔ አልተመለሳችሁም፥ ይላል እግዚአብሔር።  \n" +   
                "18 ፤ ከዛሬው ከዘጠነኛው ወር ከሀያ አራተኛው ቀን ጀምራችሁ የሚመጣውን ዘመን ልብ አድርጉ፤ የእግዚአብሔር መቅደስ መሠረት ከተተከለበት ቀን ጀምሮ ልብ አድርጉ።  \n" +   
                "19 ፤ ዘር በጎተራ ገና ይኖራልን? ወይንና በለስ ሮማንና ወይራ አላፈሩም፤ ከዚህች ቀን ጀምሬ እባርካችኋለሁ።  \n" +   
                "20 ፤ በወሩ በሀያ አራተኛው ቀን የእግዚአብሔር ቃል ሁለተኛ ወደ ሐጌ እንዲህ ሲል መጣ።  \n" +   
                "21 ፤ ለይሁዳ አለቃ ለዘሩባቤል ተናገር እንዲህም በል። ሰማያትንና ምድርን አናውጣለሁ፤  \n" +   
                "22 ፤ የመንግሥታትንም ዙፋን እገለብጣለሁ፥ የአሕዛብንም መንግሥታት ኃይል አጠፋለሁ፤ ሰረገሎችንና የሚቀመጡባቸውንም እገለብጣለሁ፤ ፈረሶችና ፈረሰኞቻቸውም እያንዳንዳቸው በወንድማቸው ሰይፍ ይወድቃሉ።  \n" +   
                "23 ፤ ባሪያዬ የሰላትያል ልጅ ዘሩባቤል ሆይ፥ በዚያ ቀን እወስድሃለሁ፥ ይላል የሠራዊት ጌታ እግዚአብሔር፤ እኔ መርጬሃለሁና፥ ይላል እግዚአብሔር፥ እንደ ቀለበት ማተሚያ አደርግሃለሁ፥ ይላል የሠራዊት ጌታ እግዚአብሔር።"));
        return new Chapter(2, verses);
    }
       
}