package com.example.bibleapp.books.added;

import com.example.bibleapp.models.Book;
import com.example.bibleapp.models.Chapter;
import com.example.bibleapp.models.Verse;

import java.util.ArrayList;
import java.util.List;

public class HOSEA {
    private Book HOSEABook;

    public HOSEA() {
        List<Chapter> chapters = new ArrayList<>();
        chapters.add(chapterOne());
        chapters.add(chapterTwo());
        chapters.add(chapterThree());
        chapters.add(chapterFour());
        chapters.add(chapterFive());
        chapters.add(chapterSix());
        chapters.add(chapterSeven());
        chapters.add(chapterEight());
        chapters.add(chapterNine());
        chapters.add(chapterTen());
        chapters.add(chapterEleven());
        chapters.add(chapterTwelve());
        chapters.add(chapterThirteen());
        chapters.add(chapterFourteen());
 


        HOSEABook = new Book("ትንቢተ ሆሴዕ", chapters);
    }

    public Book getHOSEABook() {
        return HOSEABook;
    }

    private Chapter chapterOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","በይሁዳ ነገሥታት በዖዝያንና በኢዮአታም በአካዝና በሕዝቅያስም ዘመን በእስራኤልም ንጉሥ በዮአስ ልጅ በኢዮርብዓም ዘመን ወደ ብኤሪ ልጅ ወደ ሆሴዕ የመጣ የእግዚአብሔር ቃል ይህ ነው።  \n" +   
                "2 ፤ እግዚአብሔር መጀመሪያ በሆሴዕ በተናገረ ጊዜ፥ እግዚአብሔር ሆሴዕን። ምድሪቱ ከእግዚአብሔር ርቃ ታላቅ ግልሙትና ታደርጋለችና ሂድ፤ ጋለሞታን ሴትና የግልሙትናን ልጆች ለአንተ ውሰድ አለው።  \n" +   
                "3 ፤ እርሱም ሄዶ የዴቤላይምን ልጅ ጎሜርን አገባ፤ እርስዋም ፀነሰች ወንድ ልጅንም ወለደችለት።  \n" +   
                "4 ፤ እግዚአብሔርም። ከጥቂት ዘመን በኋላ የኢይዝራኤልን ደም በኢዩ ቤት ላይ እበቀላለሁና፥ ከእስራኤልም ቤት መንግሥትን እሽራለሁና ስሙን ኢይዝራኤል ብለህ ጥራው፤  \n" +   
                "5 ፤ በዚያም ቀን በኢይዝራኤል ሸለቆ ውስጥ የእስራኤልን ቀስት እሰብራለሁ አለው።  \n" +   
                "6 ፤ ደግሞ ፀነሰች ሴት ልጅንም ወለደች። እግዚአብሔርም። ይቅር እላቸው ዘንድ የእስራኤልን ቤት ከእንግዲህ ወዲህ አልምርምና ስምዋን ሎሩሃማ ብለህ ጥራት፤  \n" +   
                "7 ፤ ነገር ግን የይሁዳን ቤት እምራለሁ፤ በአምላካቸውም በእግዚአብሔር አድናቸዋለሁ እንጂ በቀስት ወይም በሰይፍ ወይም በሰልፍ ወይም በፈረሶች ወይም በፈረሰኞች አላድናቸውም አለው።  \n" +   
                "8 ፤ ሎሩሃማም ጡት ባስጣለች ጊዜ፥ ደግሞ ፀነሰች ወንድ ልጅንም ወለደች።  \n" +   
                "9 ፤ እግዚአብሔርም። ሕዝቤ አይደላችሁምና፥ እኔም አምላክ አልሆናችሁምና ስሙን ሎዓሚ ብለህ ጥራው አለው።"));

        return new Chapter(1, verses);
    }

    private Chapter chapterTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "የእስራኤልም ልጆች ቍጥር እንደማይሰፈርና እንደማይቈጠር እንደ ባሕር አሸዋ ይሆናል፤ እንዲህም ይሆናል፤ እናንተ ሕዝቤ አይደላችሁም ተብሎ በተነገረበት በዚያ ስፍራ የሕያው አምላክ ልጆች ይባላሉ።  \n" +   
                "2 ፤ የይሁዳ ልጆችና የእስራኤል ልጆች በአንድነት ይሰበሰባሉ፥ ለእነርሱም አንድ አለቃ ይሾማሉ፥ ከምድሪቱም ይወጣሉ፤ የኢይዝራኤል ቀን ታላቅ ይሆናልና።  \n" +   
                "3 ፤ ወንድሞቻችሁን። ዓሚ፥ እኅቶቻችሁንም። ሩሃማ በሉአቸው።  \n" +   
                "4 ፤ እናታችሁ ሚስቴ አይደለችምና፥ እኔም ባልዋ አይደለሁምና ተምዋገቱ፤ ከእናታችሁ ጋር ተምዋገቱ። ግልሙትናዋን ከፊትዋ፥ ምንዝርናዋንም ከጡቶችዋ መካከል ታስወግድ፤  \n" +   
                "5 ፤ ዕራቁትዋን እንዳልገፍፋት፥ እንደ ተወለደችበትም ቀን እንዳላደርጋት፥ እንደ ምድረ በዳና እንደ ደረቅ ምድር እንዳላደርጋት፥ በጥማትም እንዳልገድላት፤  \n" +   
                "6 ፤ የግልሙትናዋ ልጆች ናቸውና ልጆችዋን አልምርም።  \n" +   
                "7 ፤ እናታቸው አመንዝራለች፤ የፀነሰቻቸውም። እንጀራዬንና ውኃዬን፥ ጥጤንና የተልባ እግሬን፥ ዘይቴንና መጠጤን ከሚሰጡኝ ከውሽሞቼ በኋላ እሄዳለሁ ብላ አስነወረቻቸው።  \n" +   
                "8 ፤ ስለዚህ፥ እነሆ፥ መንገድሽን በእሾህ እዘጋለሁ፥ መንገድዋንም እንዳታገኝ ቅጥርን እቀጥርባታለሁ።  \n" +   
                "9 ፤ ውሽሞችዋንም ትከተላለች፥ ነገር ግን አትደርስባቸውም፤ ትፈልጋቸውማለች፥ ነገር ግን አታገኛቸውም፤ እርስዋም። ከዛሬ ይልቅ የዚያን ጊዜ ይሻለኝ ነበርና ተመልሼ ወደ ቀደመው ባሌ እሄዳለሁ ትላለች።  \n" +   
                "10 ፤ እርስዋም እህልንና ወይንን ጠጅ ዘይትንም የሰጠኋት፥ ለበኣልም የተሠራውን ብርና ወርቅ ያበዛሁላት እኔ እንደ ሆንሁ አላወቀችም።  \n" +   
                "11 ፤ ስለዚህ እህሌን በጊዜዋ፥ ወይን ጠጄንም በወረትዋ እወስዳለሁ፥ ዕራቁትነትዋንም እንዳትሸፍን ጥጤንና የተልባ እግሬን እገፍፋታለሁ።  \n" +   
                "12 ፤ አሁንም ውሽሞችዋ እያዩ ነውርዋን እገልጣለሁ፤ ከእጄም ማንም አያድናትም።  \n" +   
                "13 ፤ ደስታዋንም ሁሉ፥ በዓላቶችዋንም፥ መባቻዎችዋንም፥ ሰንበቶችዋንም፥ የተቀደሱትንም ጉባኤዎችን ሁሉ አስቀራለሁ።  \n" +   
                "14 ፤ እርስዋም። ውሽሞቼ የሰጡኝ ዋጋዬ ይህ ነው ያለችውን ወይንዋንና በለስዋን አጠፋለሁ፤ ዱርም አደርገዋለሁ፥ የምድረ በዳም አራዊት ይበሉታል።  \n" +   
                "15 ፤ እኔን ረስታ ውሽሞችዋን እየተከተለች፥ በጕትቾችዋና በጌጥዋም እያጌጠች ለበኣሊም ያጠነችበትን ወራት እበቀልባታለሁ፥ ይላል እግዚአብሔር።  \n" +   
                "16 ፤ ስለዚህ፥ እነሆ፥ አባብላታለሁ፥ ወደ ምድረ በዳም አመጣታለሁ፥ ለልብዋም እናገራለሁ።  \n" +   
                "17 ፤ ከዚያም የወይን ቦታዋን፥ የተስፋ በርም እንዲሆንላት የአኮርን ሸለቆ እሰጣታለሁ፤ በዚያም ከግብጽ ምድር እንደ ወጣችበት ቀን እንደ ሕፃንነትዋ ወራት ትዘምራለች።  \n" +   
                "18 ፤ በዚያ ቀን ባሌ ብለሽ ትጠሪኛለሽ እንጂ ዳግመኛ በኣሌ ብለሽ አትጠሪኝም፥ ይላል እግዚአብሔር፤  \n" +   
                "19 ፤ የበኣሊምን ስም ከአፍዋ አስወግደዋለሁና፥ በስማቸውም እንግዲህ አይታሰቡምና።  \n" +   
                "20 ፤ በዚያም ቀን ከምድር አራዊትና ከሰማይ ወፎች ከመሬትም ተንቀሳቃሾች ጋር ቃል ኪዳን አደርግላቸዋለሁ፤ ቀስትንና ሰይፍን ሰልፍንም ከምድሩ እሰብራለሁ፥ ተከልለውም እንዲኖሩ አስተኛቸዋለሁ።  \n" +   
                "21 ፤ ለዘላለምም ለእኔ እንድትሆኚ አጭሻለሁ፤ በጽድቅና በፍርድ በምሕረትና በርኅራኄ አጭሻለሁ።  \n" +   
                "22 ፤ ለእኔም እንድትሆኚ በመታመን አጭሻለሁ፤ አንቺም እግዚአብሔርን ታውቂአለሽ።  \n" +   
                "23 ፤ በዚያንም ቀን እመልሳለሁ፥ ይላል እግዚአብሔር፤ ለሰማይ እመልሳለሁ፥ ሰማይም ለምድር ይመልሳል፤"));
        return new Chapter(2, verses);
    }

    private Chapter chapterThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "እግዚአብሔርም። የእስራኤል ልጆች ወደ ሌሎች አማልክት ቢመለሱና የዘቢብ ጥፍጥፍን ቢወድዱ እንኳ፥ እግዚአብሔር እንደሚወድዳቸው አንተም ውሽማዋን የምትወድደውን አመንዝራይትን ሴት ውደድ አለኝ።  \n" +   
                "2 ፤ እኔም በአሥራ አምስት ብርና በአንድ ቆሮስ መስፈሪያ ተኩል ገብስ ገዛኋት።  \n" +   
                "3 ፤ ከእኔ ጋር ብዙ ወራት ተቀመጪ፥ አታመንዝሪም፥ ለሌላ ሰውም አትሁኚ፤ እኔም እንዲሁ እሆንልሻለሁ አልኋት።  \n" +   
                "4 ፤ የእስራኤል ልጆች ያለ ንጉሥና ያለ አለቃ፥ ያለ መሥዋዕትና ያለ ዓምድ፥ ያለ ኤፉድና ያለ ተራፊም ብዙ ወራት ይቀመጣሉና፤  \n" +   
                "5 ፤ ከዚያም በኋላ የእስራኤል ልጆች ተመልሰው አምላካቸውን እግዚአብሔርንና ንጉሣቸውን ዳዊትን ይፈልጋሉ፤ በኋለኛውም ዘመን ፈርተው ወደ እግዚአብሔርና ወደ በረከቱ ይመጣሉ።"));

        return new Chapter(3, verses);
    }
    private Chapter chapterFour() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "እናንተ የእስራኤል ልጆች ሆይ፥ እውነትና ምሕረት እግዚአብሔርንም ማወቅ በምድር ስለሌለ እግዚአብሔር በምድሩ ላይ ከሚኖሩ ጋር ክርክር አለውና የእግዚአብሔርን ቃል ስሙ።  \n" +   
                "2 ፤ እርግማንና ሐሰት ግዳይና ስርቆት ምንዝርናም ወጥተዋል፤ ደምም ወደ ደም ደርሶአል።  \n" +   
                "3 ፤ ስለዚህ ምድሪቱ ታለቅሳለች፥ በእርስዋም የሚቀመጡ ሁሉ ከምድር አራዊትና ከሰማይ ወፎች ጋር ይደክማሉ፤ የባሕሩም ዓሦች ያልቃሉ።  \n" +   
                "4 ፤ ነገር ግን ሕዝብህ ከካህን ጋር እንደሚከራከሩ ናቸውና ማንም አይከራከር፥ ማንም አይዝለፍ።  \n" +   
                "5 ፤ በቀንም ትሰናከላለህ፥ ነቢዩም ከአንተ ጋር በሌሊት ይሰናከላል፤ እናትህንም አጠፋታለሁ።  \n" +   
                "6 ፤ ሕዝቤ እውቀት ከማጣቱ የተነሣ ጠፍቶአል፤ አንተም እውቀትን ጠልተሃልና እኔ ካህን እንዳትሆነኝ እጠላሃለሁ፤ የአምላክህንም ሕግ ረስተሃልና እኔ ደግሞ ልጆችህን እረሳለሁ።  \n" +   
                "7 ፤ እንደ ብዛታቸው መጠን ኃጢአት ሠሩብኝ፤ እኔም ክብራቸውን ወደ ነውር እለውጣለሁ።  \n" +   
                "8 ፤ የሕዝቤም ኃጢአት መብል ሆኖላቸዋል፥ ልባቸውንም ወደ በደላቸው አድርገዋል።  \n" +   
                "9 ፤ እንደ ሕዝቡም እንዲሁ ካህኑ ይሆናል፤ በመንገዳቸውም እበቀላቸዋለሁ፥ ሥራቸውንም እመልስባቸዋለሁ።  \n" +   
                "10 ፤ እግዚአብሔርንም መጠበቅ ትተዋልና ሲበሉ አይጠግቡም፥ ሲያመነዝሩም አይበዙም።  \n" +   
                "11 ፤ ግልሙትናና የወይን ጠጅ ስካርም አእምሮን ያጠፋል።  \n" +   
                "12 ፤ የግልሙትና መንፈስ ሕዝቤን አስቶአቸዋልና፥ እነርሱም ከአምላካቸው ርቀው አመንዝረዋልና በትራቸውን ይጠይቃሉ፥ ዘንጋቸውም ይመልስላቸዋል።  \n" +   
                "13 ፤ በተራሮችም ራስ ላይ ይሠዋሉ፤ ጥላውም መልካም ነውና ከኮምበልና ከልብን ከአሆማም ዛፍ በታች በኮረብቶች ላይ ያጥናሉ፤ ስለዚህ ሴቶች ልጆቻችሁ ይገለሙታሉ፥ ሙሽሮቻችሁም ያመነዝራሉ።  \n" +   
                "14 ፤ ወንዶችም ደግሞ ከጋለሞቶች ጋር ይጫወታሉና፥ ከጋለሞቶችም ጋር ይሠዋሉና ሴቶች ልጆቻችሁ በገለሞቱ ጊዜ፥ ሙሽሮቻችሁም ባመነዘሩ ጊዜ አልቀጣቸውም፤ የማያስተውልም ሕዝብ ይገለበጣል።  \n" +   
                "15 ፤ እስራኤል ሆይ፥ አንተ ብታመነዝር ይሁዳ አይበድል፤ እናንተም ወደ ጌልገላ አትግቡ፥ ወደ ቤትአዌንም አትውጡ፥ ወይም። ሕያው እግዚአብሔርን! ብላችሁ አትማሉ።  \n" +   
                "16 ፤ እስራኤል እንደ እልከኛ ጊደር እንቢ ብሎአል፤ እግዚአብሔርስ በሰፊው ቦታ እንደ ጠቦት ያሰማራዋልን?  \n" +   
                "17 ፤ ኤፍሬም ከጣዖታት ጋር ተጋጠመ፤ ተወው።  \n" +   
                "18 ፤ ስካርን ፈጽመዋል፥ ግልሙትናንም አብዝተዋል፤ አለቆችዋም ነውርን እጅግ ወደዱ።  \n" +   
                "19 ፤ ነፋስ በክንፍዋ አስሮአታል፤ ከመሥዋዕታቸውም የተነሣ ያፍራሉ።"));
        return new Chapter(4, verses);
    }
    private Chapter chapterFive() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ካህናት ሆይ፥ ይህን ስሙ፤ የእስራኤል ቤት ሆይ፥ አድምጡ፤ የንጉሥ ቤት ሆይ፥ ልብ አድርጉ፤ በምጽጳ ላይ ወጥመድ፥ በታቦርም ላይ የተዘረጋ አሽክላ ሆናችኋልና ፍርድ በእናንተ ላይ ነው።  \n" +   
                "2 ፤ ዓመፀኞችም እርድ አብዝተዋል፤ እኔ ግን እነዚያን ሁሉ እዘልፋለሁ።  \n" +   
                "3 ፤ ኤፍሬምን አውቀዋለሁ፥ እስራኤልም ከእኔ አልተሰወረም፤ ኤፍሬም ሆይ፥ ዛሬ አመንዝረሃል፥ እስራኤልም ረክሶአል።  \n" +   
                "4 ፤ ወደ አምላካቸው ይመለሱ ዘንድ ሥራቸውን አላቀኑም፤ የግልሙትና መንፈስ በውስጣቸው አለና፤ እግዚአብሔርንም አላውቁምና።  \n" +   
                "5 ፤ የእስራኤልም ትዕቢት በፊቱ ይመሰክራል፤ ስለዚህ እስራኤልና ኤፍሬም በኃጢአታቸው ይሰናከላሉ፤ ይሁዳም ደግሞ ከእነሱ ጋር ይሰናከላል።  \n" +   
                "6 ፤ እግዚአብሔርንም ለመሻት በጎቻቸውንና ላሞቻቸውን ነድተው ይሄዳሉ፤ ነገር ግን እርሱ ከእነርሱም ተመልሶአልና አያገኙትም።  \n" +   
                "7 ፤ ዲቃሎችን ልጆች ወልደዋልና እግዚአብሔርን ወንጅለዋል፤ አሁንም አንድ ወር እነርሱንና ርስታቸውን ይበላቸዋል።  \n" +   
                "8 ፤ በጊብዓ መለከትን፥ በራማ እንቢልታን ንፉና። ብንያም ሆይ፥ ከአንተ በኋላ እያላችሁ በቤትአዌን ላይ እሪ በሉ።  \n" +   
                "9 ፤ ኤፍሬም በዘለፋ ቀን የፈረሰ ይሆናል። በእስራኤል ነገዶች ዘንድ በእርግጥ የሚሆነውን ነገር ገልጫለሁ።  \n" +   
                "10 ፤ የይሁዳ አለቆች ድምበርን እንደሚነቅሉ ሆነዋል፤ እኔም መዓቴን እንደ ውኃ አፈስስባቸዋለሁ።  \n" +   
                "11 ፤ ኤፍሬም ከትእዛዝ በኋላ መሄድን ወድዶአልና የተገፋና በፍርድ የተጐዳ ሆኖአል።  \n" +   
                "12 ፤ እኔም ለኤፍሬም እንደ ብል፥ ለይሁዳም ቤት እንደ ነቀዝ ሆኜአለሁ።  \n" +   
                "13 ፤ ኤፍሬምም ደዌውን፥ ይሁዳም ቍስሉን ባየ ጊዜ ኤፍሬም ወደ አሦር ሄደ ወደ ንጉሡም ወደ ኢያሪም መልእክተኛን ላከ፤ እርሱ ግን ይፈውሳችሁ ዘንድ፥ ከቊስላችሁም ያድናችሁ ዘንድ አልቻለም።  \n" +   
                "14 ፤ እኔም ለኤፍሬም እንደ አንበሳ፥ ለይሁዳም ቤት እንደ አንበሳ ደቦል እሆናለሁና፤ እኔም ነጥቄ እሄዳለሁ እወስድማለሁ፥ የሚያድንም አይገኝም።  \n" +   
                "15 ፤ በደላቸውንም እስኪያውቁ ድረስ፥ ፊቴንም እስኪሹ ድረስ ሄጄ ወደ ስፍራዬ እመለሳለሁ፤ በመከራቸው ጊዜ እጅግ አድርገው ፊቴን ይፈልጋሉ።"));
        return new Chapter(5, verses);
    }
    private Chapter chapterSix() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ኑ፥ወደ እግዚአብሔር እንመለስ፤ እርሱ ሰብሮናልና፥ እርሱም ይፈውሰናል፤ እርሱ መትቶናል፥ እርሱም ይጠግነናል።  \n" +   
                "2 ፤ ከሁለት ቀን በኋላ ያድነናል፤ በሦስተኛውም ቀን ያስነሣናል፥ በፊቱም በሕይወት እንኖራለን።  \n" +   
                "3 ፤ እንወቅ፤ እናውቀውም ዘንድ እግዚአብሔርን እንከተል፤ እንደ ወገግታም ተዘጋጅቶ እናገኘዋለን፤ እንደ ዝናብም ምድርንም እንደሚያጠጣ እንደ መጨረሻ ዝናብ ይመጣል።  \n" +   
                "4 ፤ ምሕረታችሁ እንደ ማለዳ ደመና፥ በማለዳም እንደሚያልፍ ጠል ነውና ኤፍሬም ሆይ፥ ምን ላድርግልህ? ይሁዳ ሆይ፥ ምን ላድርግልህ?  \n" +   
                "5 ፤ ስለዚህ በነቢያት እጅ ቈረጥኋቸው፥ በአፌም ቃል ገደልኋቸው፤ ፍርዴም እንደ ብርሃን ይወጣል።  \n" +   
                "6 ፤ ከመሥዋዕት ይልቅ ምሕረትን፥ ከሚቃጠልም መሥዋዕት ይልቅ እግዚአብሔርን ማወቅ እወድዳለሁና።  \n" +   
                "7 ፤ እነርሱ ግን እንደ አዳም ቃል ኪዳንን ተላልፈዋል፤ በዚያም ላይ ወንጅለውኛል።  \n" +   
                "8 ፤ ገለዓድ ኃጢአትን የሚሠሩ ሰዎች ከተማ፥ በደምም የተቀባ ነው።  \n" +   
                "9 ፤ ለሰውም እንደሚያደቡ ወንበዴዎች፥ እንዲሁ የካህናት ወገኖች በሴኬም መንገድ ላይ ይገድላሉ፤ ሴሰኝነትንም ያደርጋሉ።  \n" +   
                "10 ፤ በእስራኤል ቤት የሚያስፈራን ነገር አይቻለሁ፤ በዚያ በኤፍሬም ውስጥ ግልሙትና ተገኘ፥ እስራኤልም ረክሶአል።  \n" +   
                "11 ፤ ይሁዳ ሆይ፥ የሕዝቤን ምርኮ በምመልስበት ጊዜ ለአንተ ደግሞ መከር ተወስኖልሃል።"));

        return new Chapter(6, verses);
    }
    private Chapter chapterSeven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "በሐሰት አድርገዋልና፥ ሌባም ገብቶአልና፥ በውጭም ወንበዴዎች ቀምተዋልና እስራኤልን እፈውስ ዘንድ በወደድሁ ጊዜ የኤፍሬም ኃጢአትና የሰማርያ ክፋት ተገለጠ።  \n" +   
                "2 ፤ እኔም ክፋታቸውን ሁሉ እንዳሰብሁ በልባቸው አያስቡም አሁንም ሥራቸው ከብባቸዋለች፥ በፊቴም አለች።  \n" +   
                "3 ፤ ንጉሡን በክፋታቸው፥ አለቆቹንም በሐሰታቸው ደስ አሰኝተዋል።  \n" +   
                "4 ፤ ሁሉም አመንዝራዎች ናቸው፤ ጋጋሪ እንደሚያነድድበት እንደ ምድጃ ናቸው፤ ሁሉ እስኪቦካ ድረስ እሳትን መቈስቈስና እርሾን መለወስ ይቆያል።  \n" +   
                "5 ፤ በንጉሣችን ቀን አለቆች ከወይን ጠጅ ሙቀት የተነሣ ታመሙ፤ እርሱም ከዋዘኞች ጋር እጁን ዘረጋ።  \n" +   
                "6 ፤ እያደቡ ልባቸውን እንደ ምድጃ አዘጋጅተዋል፤ አበዛቸውም ሌሊቱን ሁሉ አንቀላፋ፤ በጠባም ጊዜ እንደ እሳት ነበልባል ይነድዳል።  \n" +   
                "7 ፤ ሁሉም እንደ ምድጃ ግለዋል፥ ፈራጆቻቸውንም በሉ፤ ነገሥታቶቻቸውም ሁሉ ወደቁ፤ ከእነርሱም ወደ እኔ የሚጮኽ የለም።  \n" +   
                "8 ፤ ኤፍሬም ከአሕዛብ ጋር ተደባለቀ፤ ኤፍሬም እንዳልተገላበጠ ቂጣ ነው።  \n" +   
                "9 ፤ እንግዶች ጕልበቱን በሉት፥ እርሱም አላወቀም፤ ሽበትም ወጣበት፥ እርሱም አላወቀም።  \n" +   
                "10 ፤ የእስራኤልም ትዕቢቱ በፊቱ መሰከረ፤ ወደ አምላካቸው ወደ እግዚአብሔር ግን አልተመለሱም፥ በዚህም ሁሉ አልፈለጉትም።  \n" +   
                "11 ፤ ኤፍሬምም አእምሮ እንደሌላት እንደ ሰነፍ ርግብ ነው፤ ግብጽን ጠሩ፥ ወደ አሦርም ሄዱ።  \n" +   
                "12 ፤ ሲሄዱ አሽክላዬን አዘረጋባቸዋለሁ፤ እንደ ሰማይ ወፎች አወርዳቸዋለሁ፤ መከራቸውን ሲሰሙ እገሥጻቸዋለሁ።  \n" +   
                "13 ፤ ከእኔ ፈቀቅ ብለዋልና ወዮላቸው! በእኔም ላይ ዐመፀዋልና ጥፋት ይምጣባቸው! እኔ ልታደጋቸው ወደድሁ፥ እነርሱ ግን በሐሰት ተናገሩብኝ።  \n" +   
                "14 ፤ በመኝታቸው ላይ ሆነው ያለቅሱ ነበር እንጂ በልባቸው ወደ እኔ አልጮኹም፤ ስለ እህልና ስለ ወይን ጠጅ ይሰበሰቡ ነበር፤ በእኔም ላይ ዐመፁ።  \n" +   
                "15 ፤ እኔም ክንዳቸውን አስተማርሁና አጸናሁ፤ እነርሱ ግን ክፉ ነገርን መከሩብኝ።  \n" +   
                "16 ፤ ወደ ከንቱ ነገር ተመለሱ፤ እንደ ተንኰለኛ ቀስት ሆኑ፤ አለቆቻቸው ከምላሳቸው ቍጣ የተነሣ በሰይፍ ይወድቃሉ፤ ይህ በግብጽ ምድር ውስጥ መሳለቂያ ይሆንባቸዋል።  \n" +   
                "  \n" +   
                ""));
        return new Chapter(7, verses);
    }

    private Chapter chapterEight() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "መለከትን ወደ አፍህ አቅርብ፤ ቃል ኪዳኔን ተላልፈዋልና፥ በሕጌም ላይ ዐምፀዋልና በእግዚአብሔር ቤት ላይ እንደ ንስር ይመጣል።  \n" +   
                "2 ፤ እነርሱም። አምላክ ሆይ፥ እኛ እስራኤል አወቅንህ ብለው ወደ እኔ ይጮኻሉ።  \n" +   
                "3 ፤ እስራኤል ደግነትን ጥሎአል፤ ጠላትም ያሳድዱታል።  \n" +   
                "4 ፤ ለራሳቸው ነገሥታትን አነገሡ፥ ከእኔም ዘንድ አይደለም፤ አለቆችንም አደረጉ፥ እኔም አላወቅሁም፤ ለጥፋታቸውም ከብራቸውና ከወርቃቸው፤ ጣዖታትን ለራሳቸው አደረጉ።  \n" +   
                "5 ፤ ሰማርያ ሆይ፥ እምቦሳህን፤ ጥሎአል፤ ቍጣዬ በላያቸው ነድዶአል፤ እስከ መቼ ድረስ ንጹሕ ሊሆኑ አይችሉም?  \n" +   
                "6 ፤ ይህ ደግሞ ከእስራኤል ዘንድ ነው፤ ሠራተኛ ሠራው፥ እርሱም አምላክ አይደለም፤ የሰማርያም እምቦሳ ይቈራረጣል።  \n" +   
                "7 ፤ ነፍስን ዘርተዋል፥ ዐውሎ ነፍስንም ያጭዳሉ፤ አገዳ የለውም፥ ከፍሬውም ዱቄት አይገኝም፤ ቢገኝም እንግዶች ይበሉታል።  \n" +   
                "8 ፤ እስራኤል ተውጦአል፥ በአሕዛብም መካከል ዛሬ እንደ ረከሰ ዕቃ ሆኖአል።  \n" +   
                "9 ፤ ለብቻውም እንደሚቀመጥ እንደ ምድረ በዳ አህያ ወደ አሦር ወጥተዋል፤ ኤፍሬምም ወዳጆቹን በእጅ መንሻ ገዛ።  \n" +   
                "10 ፤ ነገር ግን ለአሕዛብ እጅ መንሻ ቢሰጡ እኔ አሁን እሰበስባቸዋለሁ፤ ከንጉሥና ከአለቆችም ሸክም የተነሣ ይደክማሉ።  \n" +   
                "11 ፤ ኤፍሬም ኃጢአትን ለመሥራት መሠዊያ አብዝቶአልና መሠዊያ ለኃጢአት ይሆንለታል።  \n" +   
                "12 ፤ የሕጌን ብዛት ጽፌለታለሁ፤ እነርሱ ግን እንደ እንግዳ ነገር ቈጥረውታል።  \n" +   
                "13 ፤ መሥዋዕቴን ያቀርባሉ፥ ሥጋንም ያርዳሉ፥ ይበላሉም፤ እግዚአብሔር ግን አይቀበላቸውም፤ በደላቸውንም ያስባል፥ ኃጢአታቸውንም ይቀጣል፤ እነርሱም ወደ ግብጽ ይመለሳሉ።  \n" +   
                "14 ፤ እስራኤል ፈጣሪውን ረስቶአል፥ መስገጃዎችንም ሠርቶአል፤ ይሁዳም የተመሸጉትን ከተሞች አብዝቶአል፤ እኔ ግን በከተሞች ላይ እሳትን እሰድዳለሁ፥ አዳራሾችንም ትበላለች።"));
        return new Chapter(8, verses);
    }

    private Chapter chapterNine() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "እስራኤል ሆይ፥ ከአምላክህ ተለይተህ አመንዝረሃልና እንደ አሕዛብ ደስ አይበልህ፥ ሐሴትንም አታድርግ፤ በእህሉ አውድማ ሁሉ ላይ የግልሙትናን ዋጋ ወድደሃል።  \n" +   
                "2 ፤ አውድማውና መጥመቂያው አይመግባቸውም፥ ጉሽ ጠጅም ይጐድልባታል።  \n" +   
                "3 ፤ በእግዚአብሔር ምድር ላይ አይቀመጡም፤ ኤፍሬምም ወደ ግብጽ ይመለሳል፥ በአሦርም ርኩስን ነገር ይበላሉ።  \n" +   
                "4 ፤ ለእግዚአብሔርም የወይን ጠጅን ቁርባን አያፈስሱም፥ መሥዋዕታቸውም ደስ አያሰኘውም፤ የኀዘንም እንጀራ ይሆንላቸዋል፥ የሚበላውም ሁሉ ይረክሳል፤ እንጀራቸውም ለሰውነታቸው ይሆናል እንጂ ወደ እግዚአብሔር ቤት አይገባም።  \n" +   
                "5 ፤ በዓመት በዓል ቀንና በእግዚአብሔር በዓል ቀን ምን ታደርጋላችሁ?  \n" +   
                "6 ፤ እነሆ፥ ከጥፋት ሸሽተው ሄዱ፥ ግብጽም ትሰበስባቸዋለች፥ ሜምፎስም ትቀብራቸዋለች፤ ሳማም የብራቸውን ጌጥ ይወርሳል፥ እሾህም በድንኳኖቻቸው ውስጥ ይበቅላል።  \n" +   
                "7 ፤ የበቀል ወራት መጥቶአል፥ የፍዳም ወራት ደርሶአል፥ እስራኤልም ያውቃል፤ ከኃጢአትህና ከጠላትነትህ ብዛት የተነሣ ነቢዩ ሰንፎአል፥ መንፈስም ያለበት ሰው አብዶአል።  \n" +   
                "8 ፤ ኤፍሬም ከአምላኬ ጋር ተመልካች ነበረ፤ አሁን ግን ነቢዩ በመንገዱ ሁሉ ላይ የወፍ ወጥመድ ሆነ፥ በአምላኩም ቤት ጠላትነት አለ።  \n" +   
                "9 ፤ በጊብዓ ዘመን እንደ ነበረ እጅግ ረከሱ፤ እርሱም በደላቸውን ያስባል፥ ኃጢአታቸውንም ይበቀላል።  \n" +   
                "10 ፤ እስራኤልን በምድረ በዳ እንዳለ ወይን ሆኖ አገኘሁት፤ አባቶቻችሁንም ከመጀመሪያዋ ዓመት እንደ በለስ በkWraት ሆነው አየኋቸው፤ እነርሱ ግን ወደ ብዔልፌጎር መጡ፥ ለነውርም ተለዩ፥ እንደ ወደዱትም ርኩስ ሆኑ፥  \n" +   
                "11 ፤ የኤፍሬምም ክብር እንደ ወፍ በርሮ ይጠፋል፤ መውለድና መፅነስ ማርገዝም አይሆንላቸውም።  \n" +   
                "12 ፤ ልጆቻቸውንም ቢያሳድጉ ሰው እንዳይቀርላቸው ልጅ አልባ አደረጋቸዋለሁ፤ ከእነርሱም በራቅሁ ጊዜ ወዮላቸው!  \n" +   
                "13 ፤ እኔ እንዳየሁ የኤፍሬም ልጆች ለምርኮ ተሰጥተዋል፤ ኤፍሬምም ልጆቹን ወደ ገዳዩች ያወጣል።  \n" +   
                "14 ፤ አቤቱ፥ ስጣቸው፤ ምን ትሰጣቸዋለህ? የሚጨነግፍን ማኅፀን የደረቀውንም ጡት ስጣቸው።  \n" +   
                "15 ፤ ክፋታቸው ሁሉ በጌልገላ አለ፤ በዚያ ጠልቻቸዋለሁ፤ ስለ ሠሩት ክፋት ከቤቴ አሳድዳቸዋለሁ፤ ከእንግዲህ ወዲያ አልወድዳቸውም፤ አለቆቻቸው ሁሉ ዓመፀኞች ናቸው።  \n" +   
                "16 ፤ ኤፍሬም ተመታ፥ ሥሩም ደረቀ፥ ፍሬም አያፈራም፤ ደግሞም ቢወልዱ የማኅፀናቸውን ፍሬ እገድላለሁ።  \n" +   
                "17 ፤ አልሰሙትምና አምላኬ ይጥላቸዋል፤ በአሕዛብም መካከል ተቅበዝባዦች ይሆናሉ።"));

        return new Chapter(9, verses);
    }
    private Chapter chapterTen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "እስራኤል ፍሬው የበዛለት የለመለመ ወይን ነው፤ እንደ ፍሬው ብዛት መሠዊያውን አብዝቶአል፤ እንደ ምድሩም ማማር መጠን ሐውልቶችን እያሳመሩ ሠርተዋል።  \n" +   
                "2 ፤ ልባቸው ተከፈለ፤ አሁንም በደላቸውን ይሸከማሉ፤ እርሱ መሠዊያቸውን ያፈርሳል፥ ሐውልቶቻቸውን ያጠፋል።  \n" +   
                "3 ፤ አሁንም። ንጉሥ የለንም፥ እግዚአብሔርን አልፈራንምና፤ ንጉሥስ ምን ያደርግልናል? ይላሉ።  \n" +   
                "4 ፤ የማይረባውን ቃል ይናገራሉ፤ ቃል ኪዳን በገቡ ጊዜ በሐሰት ይምላሉ፤ ስለዚህ መርዛም ሣር በእርሻ ትልም ላይ እንደሚበቅል መቅሠፍት ይበቅልባቸዋል።  \n" +   
                "5 ፤ የሰማርያ ሰዎች ስለ ቤትአዌን እምቦሳ ይፈራሉ፤ ክብሩም ከእርሱ ዘንድ ወጥቶአልና ሕዝቡ ያለቅሱለታል፥ የጣዖቱ ካህናትም በኀዘን ይንተባተባሉ።  \n" +   
                "6 ፤ ለንጉሡ ለኢያሪም እጅ መንሻ ይሆን ዘንድ ወደ አሦር ይማረካል፤ ኤፍሬምን እፍረት ይይዘዋል፥ እስራኤልም በምክሩ ያፍራል።  \n" +   
                "7 ፤ ሰማርያ ከንጉሥዋ ጋር በውኃ ላይ እንዳለ አረፋ ጠፍታለች።  \n" +   
                "8 ፤ የእስራኤል ኃጢአት የሆኑት የአዌን የኮረብታው መስገጃዎች ይፈርሳሉ፤ እሾህና አሜከላ በመሠዊያዎቻቸው ላይ ይበቅላል፤ ተራሮችንም። ክደኑን፥ ኮረብቶችንም። ውደቁብን ይሉአቸዋል።  \n" +   
                "9 ፤ እስራኤል ሆይ፥ ከጊብዓ ዘመን ጀምረህ ኃጢአትን ሠርተሃል፤ በዚያ ጸንተዋል፤ በጊብዓ ላይ ሰልፍ አይደርስባቸውምን?  \n" +   
                "10 ፤ በፈቀድሁም ጊዜ እገሥጻቸዋለሁ፤ ስለ ሁለቱም ኃጢአታቸው በታሰሩ ጊዜ አሕዛብ ይሰበሰቡባቸዋል።  \n" +   
                "11 ፤ ኤፍሬም ማበራየት እንደ ለመደች ጊደር ነው፥ እኔ ግን በአንገቱ ውበት እጫንበታለሁ፤ በኤፍሬም ላይ እጠምድበታለሁ፥ ይሁዳም ያርሳል፥ ያዕቆብም አፈሩን ያለሰልሳል።  \n" +   
                "12 ፤ እግዚአብሔር መጥቶ ጽድቅን እስኪያዘንብላችሁ ድረስ እርሱን የምትሹበት ዘመን ነውና ለእናንተ በጽድቅ ዝሩ፥ እንደ ምሕረቱም መጠን እጨዱ፥ ጥጋታችሁንም እረሱ።  \n" +   
                "13 ፤ ክፋትን አርሳችኋል፥ ኃጢአትንም አጭዳችኋል፥ የሐሰትንም ፍሬ በልታችኋል፤ በኃያላንህ ብዛት፥ በመንገድህም ላይ ታምነሃልና።  \n" +   
                "14 ፤ በሕዝብህም መካከል ሽብር ይነሣል፤ እናትም ከልጆችዋ ጋር በተፈጠፈጠች ጊዜ ሰልማን ቤትአርብኤልን በሰልፍ ቀን እንዳፈረሰ፥ አምባዎችህ ሁሉ ይፈርሳሉ።  \n" +   
                "15 ፤ ከኃጢአታችሁም ክፋት የተነሣ ቤቴል እንዲሁ ያደርግባችኋል፤ በነጋ ጊዜ የእስራኤል ንጉሥ ፈጽሞ ይጠፋል።"));
      
        return new Chapter(10, verses);
    }
    private Chapter chapterEleven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "እስራኤል ሕፃን በነበረ ጊዜ ወደድሁት፥ ልጄንም ከግብጽ ጠራሁት።  \n" +   
                "2 ፤ አብዝቼ ብጠራቸው አጥብቀው ከፊቴ ራቁ፤ ለበኣሊምም ይሠዉ ነበር፥ ለተቀረጹ ምስሎችም ያጥኑ ነበር።  \n" +   
                "3 ፤ እኔም ኤፍሬምን ክንዱን ይዤ በእግሩ እንዲሄድ መራሁት፤ እኔም እፈውሳቸው እንደ ነበርሁ አላወቁም።  \n" +   
                "4 ፤ በሰው ገመድ በፍቅርም እስራት ሳብኋቸው፤ ለእነርሱም ቀምበርን ከጫንቃቸው ላይ እንደሚያነሣ ሆንሁ፥ ድርቆሽም ጣልሁላቸው።  \n" +   
                "5 ፤ ወደ እኔ ይመለሱ ዘንድ አልወደዱምና ወደ ግብጽ ምድር ይመለሳሉ፥ አሦርም ንጉሣቸው ይሆናል።  \n" +   
                "6 ፤ ከመከሩትም ምክር የተነሣ ሰይፍ በከተሞቻቸው ላይ ይወድቃል፥ ከበርቴዎችንም ያጠፋል።  \n" +   
                "7 ፤ ሕዝቤም ከእኔ ይመለሱ ዘንድ ወደዱ፤ ወደ ላይም ቢጠሩአቸው ማንም ከፍ ከፍ ያደርጋቸው ዘንድ አይችልም።  \n" +   
                "8 ፤ ኤፍሬም ሆይ፥ እንዴት እጥልሃለሁ? እስራኤል ሆይ፥ እንዴትስ አሳልፌ እሰጥሃለሁ? እንዴትስ እንደ አዳማ እጥልሃለሁ? እንዴትስ እንደ ሲባዮ አደርግሃለሁ? ልቤ በውስጤ ተናውጣለች፥ ምሕረቴም ተነሣሥታለች።  \n" +   
                "9 ፤ እኔ አምላክ ነኝ እንጂ ሰው አይደለሁምና፥ በመካከልህም ቅዱሱ ነኝና የቁጣዬን መቅሠፍት አላደርግም፥ ኤፍሬምንም አጠፋ ዘንድ አልመለስም፤ በመዓትም አልመጣም።  \n" +   
                "10 ፤ እግዚአብሔርን ይከተላሉ፥ እርሱም እንደ አንበሳ ያገሣል፤ ባገሣም ጊዜ ልጆች እየተንቀጠቀጡ ከምዕራብ ይመጣሉ።  \n" +   
                "11 ፤ እንደ ወፍም ከግብጽ፥ እንደ ርግብም ከአሦር ምድር እየተንቀጠቀጡ ይመጣሉ፤ በቤታቸውም አኖራቸዋለሁ፥ ይላል እግዚአብሔር።"));
        return new Chapter(11, verses);
    }
    private Chapter chapterTwelve() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ኤፍሬም በሐሰት፥ የእስራኤልም ቤት በተንኰል ከበበኝ፤ ይሁዳም ከታመነው ቅዱሱ ከእግዚአብሔር ጋር አይጸናም።  \n" +   
                "2 ፤ ኤፍሬም ነፋስን ይበላል፥ የምሥራቅንም ነፋስ ይከተላል፤ ሁልጊዜም ሐሰትንና ተንኰልን ያበዛል፤ ከአሦር ጋር ቃል ኪዳን ያደርጋሉ፥ ወደ ግብጽም ዘይት ይወስዳሉ።  \n" +   
                "3 ፤ እግዚአብሔርም ደግሞ ከይሁዳ ጋር ክርክር አለው፥ ያዕቆብንም እንደ መንገዱ ይቀጣል፤ እንደ ሥራውም ይመልስለታል።  \n" +   
                "4 ፤ በማኅፀን ውስጥ ወንድሙን በተረከዙ ያዘው፥ በጕልማስነቱም ጊዜ ከአምላክ ጋር ታገለ፤  \n" +   
                "5 ፤ ከመልአኩም ጋር ታግሎ አሸነፈ፤ አልቅሶም ለመነው። በቤቴልም አገኘው፥ በዚያም ከእኛ ጋር ተነጋገረ።  \n" +   
                "6 ፤ እርሱም የሠራዊት አምላክ እግዚአብሔር ነው፤ የመታሰቢያው ስም እግዚአብሔር ነው።  \n" +   
                "7 ፤ ስለዚህ ወደ አምላክህ ተመለስ፤ ምሕረትንና ፍርድን ጠብቅ፥ ዘወትርም በአምላክህ ታመን።  \n" +   
                "8 ፤ ከከነዓን ወገን ነው፤ በእጁ የተንኰል ሚዛን አለ፥ ሽንገላንም ይወድዳል።  \n" +   
                "9 ፤ ኤፍሬምም። ባለ ጠጋ ሆኜአለሁ፥ ሀብትንም አግኝቻለሁ፥ በድካሜም ሁሉ ኃጢአት የሚሆን በደል አይገኝብኝም አለ።  \n" +   
                "10 ፤ እኔም ከግብጽ ጀምሬ አምላክህ እግዚአብሔር ነኝ፤ እንደ ዓመት በዓል ቀን እንደ ገና በድንኳን እንድትኖር አደርግሃለሁ።  \n" +   
                "11 ፤ ለነቢያትም ተናግሬአለሁ፥ ራእይንም አብዝቻለሁ፤ በነቢያትም እጅ ምሳሌዎችን አውጥቻለሁ።  \n" +   
                "12 ፤ ኃጢአት በገለዓድ አለ፤ ፈጽመው ከንቱ ናቸው፤ ወይፈኖች በጌልገላ ይሠዋሉ፥ መሠዊያዎቻቸውም በእርሻ ትልም ላይ የድንጋይ ክምር ይሆናሉ።  \n" +   
                "13 ፤ ያዕቆብ ወደ ሶርያ አገር ሸሸ፥ እስራኤልም ስለ ሚስት አገለገለ፥ ስለ ሚስትም ጠባቂ ነበረ።  \n" +   
                "14 ፤ እግዚአብሔርም በነቢይ እጅ እስራኤልን ከግብጽ አወጣ፥ በነቢይም እጅ ጠበቀው።  \n" +   
                ""));
        return new Chapter(12, verses);
    }
    private Chapter chapterThirteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ኤፍሬም በተናገረ ጊዜ ፍርሃት ነበረ፥ በእስራኤልም ዘንድ ታበየ፤ ነገር ግን በኣልን በማምለክ በበደለ ጊዜ ሞተ።  \n" +   
            "2 ፤ አሁንም ኃጢአትን ይሠሩ ዘንድ ጨመሩ፤ በብራቸውም ለራሳቸው ቀልጦ የተሠራ ምስልን፥ እንደ ጥበባቸውም ጣዖታትን ሠርተዋል፤ ሁሉም የሠራተኛ ሥራ ናቸው። ስለ እነርሱም። የሚሠዉ ሰዎች እምቦሳውን ይሳሙ ይላሉ።  \n" +   
            "3 ፤ ስለዚህም እንደ ማለዳ ደመና፥ በጥዋትም እንደሚያልፍ ጠል፥ በዐውሎ ነፍስም ከአውድማ እንደሚበተን እብቅ፥ ከመስኮትም እንደሚወጣ ጢስ ይሆናሉ።  \n" +   
            "4 ፤ እኔ ግን ከግብጽ ምድር ጀምሬ አምላክህ እግዚአብሔር ነኝ፤ ከእኔም በቀር ሌላ አምላክ አታውቅም፥ ከእኔም በቀር ሌላ መድኃኒት የለም።  \n" +   
            "5 ፤ በምድረ በዳ፥ እጅግ በደረቀ ምድር አውቄህ ነበር።  \n" +   
            "6 ፤ ከተሰማሩ በኋላ ጠገቡ፥ በጠገቡም ጊዜ ልባቸው ታበየ፤ ስለዚህ ረሱኝ።  \n" +   
            "7 ፤ ስለዚህም እኔ እንደ አንበሳ ሆንሁባቸው፥ እንደ ነብርም በመንገድ አጠገብ አደባባቸዋለሁ፤  \n" +   
            "8 ፤ ልጅዋ እንደ ተነጠቀባት ድብ እገጥማቸዋለሁ፥ የልባቸውንም ስብ እቀድዳለሁ፤ በዚያም እንደ አንበሳ እበላቸዋለሁ፥ የምድረ በዳም አውሬ ይነጣጠቃቸዋል።  \n" +   
            "9 ፤ እስራኤል ሆይ፥ በእኔ በረዳትህ ላይ በመነሣትህ ጥፋትህ ነው።  \n" +   
            "10 ፤ በየከተማህ ሁሉ ያድንህ ዘንድ ንጉሥህ ወዴት አለ? ስለ እነርሱም። ንጉሥንና አለቆችን ስጠኝ ብለህ የተናገርኸው መሳፍንቶችህ ወዴት አሉ?  \n" +   
            "11 ፤ በቍጣዬ ንጉሥን ሰጠሁህ፥ በመዓቴም ሻርሁት።  \n" +   
            "12 ፤ የኤፍሬም በደል ታስሮአል፥ ኃጢአቱም ተከማችቶአል።  \n" +   
            "13 ፤ ምጥ እንደ ያዛት ሴት ጭንቅ ይመጣበታል፤ በሚወለድበት ጊዜ በማኅፀን አፍ ቀጥ ብሎ አይወጣምና አእምሮ የሌለው ልጅ ነው።  \n" +   
            "14 ፤ ከሲኦል እጅ እታደጋቸዋለሁ፥ ከሞትም እቤዣቸዋለሁ፤ ሞት ሆይ፥ ቸነፈርህ ወዴት አለ? ሲኦል ሆይ፥ ማጥፋትህ ወዴት አለ? ርኅራኄ ከዓይኔ ተሰወረች።  \n" +   
            "15 ፤ በወንድሞቹ መካከል ፍሬያማ ቢሆን የምሥራቅ ነፋስ ይመጣል፥ የእግዚአብሔር ነፋስ ከምድረ በዳ ይመጣል፤ ምንጩንም ያደርቃል፥ ፈሳሹንም ያጠፋል፥ የተከበሩ ዕቃዎች ሁሉ ያሉበትን መዝገብ ይበዘብዛል።  \n" +   
            "16 ፤ ሰማርያ በአምላክዋ ላይ ዐምፃለችና በደልዋን ትሸከማለች፤ በሰይፍ ይወድቃሉ፥ ሕፃኖቻቸውም ይፈጠፈጣሉ፥ እርጕዞቻቸውም ይቀደዳሉ።"));
        return new Chapter(13, verses);
        }
    private Chapter chapterFourteen() {
    List<Verse> verses = new ArrayList<>();
    verses.add(new Verse("1", "እስራኤል ሆይ፥ በኃጢአትህ ወድቀሃልና ወደ አምላክህ ወደ እግዚአብሔር ተመለስ።  \n" +   
            "2 ፤ ከእናንተ ጋር ቃልን ውሰዱ፥ ወደ እግዚአብሔርም ተመልሳችሁ። ኃጢአትን ሁሉ አስወግድ፥ በቸርነትም ተቀበለን፥ በወይፈንም ፋንታ የከንፈራችንን ፍሬ እንሰጣለን።  \n" +   
            "3 ፤ አሦር አያድነንም፤ በፈረስ ላይ አንቀመጥም፤ ድሀ አደጉም በአንተ ዘንድ ምሕረትን ያገኛልና ከእንግዲህ ወዲህ ለእጆቻችን ሥራ። አምላኮቻችን ናችሁ አንላቸውም በሉት።  \n" +   
            "4 ፤ ቍጣዬ ከእርሱ ዘንድ ተመልሶአልና ዓመፃቸውን እፈውሳለሁ፥ በገዛ ፈቃዴ እወድዳቸዋለሁ።  \n" +   
            "5 ፤ ለእስራኤልም እንደ ጠል እሆነዋለሁ፤ እንደ አበባም ያብባል፥ እንደ ሊባኖስም ሥሩን ይሰድዳል።  \n" +   
            "6 ፤ ቅርንጫፎቹም ይዘረጋሉ፥ ውበቱም እንደ ወይራ፥ ሽታውም እንደ ሊባኖስ ይሆናል።  \n" +   
            "7 ፤ ከጥላውም በታች የሚቀመጡ ይመለሳሉ፤ ከእህሉም የተነሣ ይጠግባሉ፤ እንደ ወይንም አረግ ያብባሉ፤ መታሰቢያውም እንደ ሊባኖስ ወይን ጠጅ ይሆናል።  \n" +   
            "8 ፤ ከእንግዲህ ወዲያ ጣዖት ለኤፍሬም ምንድር ነው? እኔ ሰምቼዋለሁ፥ ወደ እርሱም እመለከታለሁ፤ እኔ እንደ ለመለመ ጥድ ነኝ፤ ፍሬህ በእኔ ዘንድ ይገኛል።  \n" +   
            "9 ፤ ይህን ነገር የሚያስተውል ጠቢብ፥ የሚያውቃትም አስተዋይ ማን ነው? የእግዚአብሔር መንገድ ቅን ነው፥ ጻድቃንም ይሄዱበታል፤ ተላላፊዎች ግን ይወድቁበታል።"));
    return new Chapter(14, verses);
    }
    
}