package com.example.bibleapp.books.added;

import com.example.bibleapp.models.Book;
import com.example.bibleapp.models.Chapter;
import com.example.bibleapp.models.Verse;

import java.util.ArrayList;
import java.util.List;

public class Isaiah {
    private Book IsaiahBook;

    public Isaiah() {
        List<Chapter> chapters = new ArrayList<>();
        chapters.add(chapterOne());
        chapters.add(chapterTwo());
        chapters.add(chapterThree());
        chapters.add(chapterFour());
        chapters.add(chapterFive());
        chapters.add(chapterSix());
        chapters.add(chapterSeven());
        chapters.add(chapterEight());
        chapters.add(chapterNine());
        chapters.add(chapterTen());
        chapters.add(chapterEleven());
        chapters.add(chapterTwelve());
        chapters.add(chapterThirteen());
        chapters.add(chapterFourteen());
        chapters.add(chapterFifteen());
        chapters.add(chapterSixteen());
        chapters.add(chapterSeventeen());
        chapters.add(chapterEighteen());
        chapters.add(chapterNineteen());
        chapters.add(chapterTwenty());
        chapters.add(chapterTwentyOne());
        chapters.add(chapterTwentyTwo());
        chapters.add(chapterTwentyThree());
        chapters.add(chapterTwentyFour());
        chapters.add(chapterTwentyFive());
        chapters.add(chapterTwentySix());
        chapters.add(chapterTwentySeven());
        chapters.add(chapterTwentyEight());
        chapters.add(chapterTwentyNine());
        chapters.add(chapterThirty());
        chapters.add(chapterThirtyOne());
        chapters.add(chapterThirtyTwo());
        chapters.add(chapterThirtyThree());
        chapters.add(chapterThirtyFour());
        chapters.add(chapterThirtyFive());
        chapters.add(chapterThirtySix());
        chapters.add(chapterThirtySeven());
        chapters.add(chapterThirtyEight());
        chapters.add(chapterThirtyNine());



        IsaiahBook = new Book("ትንቢተ ኢሳይያስ።", chapters);
    }

    public Book getIsaiahBook() {
        return IsaiahBook;
    }

    private Chapter chapterOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በይሁዳ ነገሥታት በዖዝያንና በኢዮአታም በአካዝና በሕዝቅያስ ዘመን ስለ ይሁዳና ስለ ኢየሩሳሌም ያየው የአሞጽ ልጅ የኢሳይያስ ራእይ።\n" +
                "2 ፤ እግዚአብሔር ተናግሮአልና ሰማያት ስሙ፥ ምድርም አድምጪ፤ ልጆችን ወለድሁ አሳደግሁም፥ እነርሱም አመጹብኝ።\n" +
                "3 ፤ በሬ የገዢውን አህያም የጌታውን ጋጣ አወቀ፤ እስራኤል ግን አላወቀም፥ ሕዝቤም አላስተዋለም።\n" +
                "4 ፤ ኃጢአተኛ ወገንና በደል የተሞላበት ሕዝብ፥ የክፉዎች ዘር፥ ርኵሰትን የምታደርጉ ልጆች ሆይ፥ ወዮላችሁ! እግዚአብሔርን ትተዋል የእስራኤልንም ቅዱስ አቃልለዋል ወደ ኋላቸውም እየሄዱ ተለይተዋል።\n" +
                "5 ፤ ደግሞስ ዓመፃ እየጨመራችሁ ለምን ገና ትቀሰፋላችሁ? ራስ ሁሉ ለሕመም ልብም ሁሉ ለድካም ሆኗል።\n" +
                "6 ፤ ከእግር ጫማ አንስቶ እስከ ራስ ድረስ ጤና የለውም፤ ቍስልና እበጥ የሚመግልም ነው፤ አልፈረጠም፥ አልተጠገነም፥ በዘይትም አልለዘበም።\n" +
                "7 ፤ ምድራችሁ ባድማ ናት፤ ከተሞቻችሁ በእሳት ተቃጠሉ፤ እርሻችሁንም በፊታችሁ ሌሎች ይበሉታል፤ ባዕድ እንዳፈረሳት ምድር ባድማ ሆነች።\n" +
                "8 ፤ የጽዮንም ሴት ልጅ በወይን ቦታ እንዳለ ዳስ፥ በዱባ አትክልትም እንዳለ ጎጆ፥ እንደተከበበችም ከተማ ሆና ቀረች።\n" +
                "9 ፤ የሠራዊት ጌታ እግዚአብሔር ዘርን ባያስቀርልን ኖሮ፥ እንደ ሰዶም በሆንነ እንደ ገሞራም በመሰልነ ነበር።\n" +
                "10 ፤ እናንተ የሰዶም አለቆች ሆይ፥ የእግዚአብሔርን ቃል ስሙ፤ እናንተ የገሞራ ሕዝብ ሆይ፥ የአምላካችንን ሕግ አድምጡ።\n" +
                "11 ፤ የመሥዋዕታችሁ ብዛት ለእኔ ምን ይጠቅመኛል? ይላል እግዚአብሔር፤ የሚቃጠለውን የአውራ በግ መሥዋዕትንና የፍሪዳን ስብ ጠግቤያለሁ፤ የበሬና የበግ ጠቦት የአውራ ፍየልም ደም ደስ አያሰኘኝም።\n" +
                "12 ፤ በእኔ ፊት ልትታዩ ብትመጡ ይህን የመቅደሴን አደባባይ መርገጣችሁን ከእጃችሁ የሚሻ ማን ነው?\n" +
                "13 ፤ ምናምንቴውን ቍርባን ጨምራችሁ አታምጡ፤ ዕጣን በእኔ ዘንድ አጸያፊ ነው፤ መባቻችሁንና ሰንበታችሁን በጉባኤ መሰብሰባችሁን አልወድድም፤ በደልንም የተቀደሰውንም ጉባኤ አልታገሥም።\n" +
                "14 ፤ መባቻችሁንና በዓላቶቻችሁን ነፍሴ ጠልታለች፤ ሸክም ሆነውብኛል፥ ልታገሣቸውም ደክሜያለሁ።\n" +
                "15 ፤ እጃችሁንም ወደ እኔ ብትዘረጉ ዓይኔን ከእናንተ እሰውራለሁ፥ ልመናንም ብታበዙ አልሰማችሁም፤ እጆቻችሁ ደም ተሞልተዋል።\n" +
                "16 ፤ ታጠቡ ሰውነታችሁንም አንጹ፤ የሥራችሁን ክፋት ከዓይኔ ፊት አስወግዱ፤ ክፉ ማድረግን ተዉ፥\n" +
                "17 ፤ መልካም መሥራትን ተማሩ፥ ፍርድን ፈልጉ፥ የተገፋውን አድኑ፥ ለድሀ አደጉ ፍረዱለት ስለ መበለቲቱም ተምዋገቱ።\n" +
                "18 ፤ ኑና እንዋቀስ ይላል እግዚአብሔር፤ ኃጢአታችሁ እንደ አለላ ብትሆን እንደ አመዳይ ትነጻለች፤ እንደ ደምም ብትቀላ እንደ ባዘቶ ትጠራለች።\n" +
                "19 ፤ እሺ ብትሉ ለእኔም ብትታዘዙ፥ የምድርን በረከት ትበላላችሁ፤\n" +
                "20 ፤ እምቢ ብትሉ ግን ብታምፁም፥ ሰይፍ ይበላችኋል፤ የእግዚአብሔር አፍ ይህን ተናግሮአልና።\n" +
                "21 ፤ ፍርድ ሞልቶባት የነበረው የታመነችይቱ ከተማ እንዴት ጋለሞታ ሆነች! ጽድቅ አድሮባት ነበር፥ አሁን ግን ገዳዮች አሉባት።\n" +
                "22 ፤ ብርሽ ወደ ዝገት ተለወጠ፤ የወይን ጠጅሽ ከውሃ ጋር ተደባለቀ።\n" +
                "23 ፤ አለቆችሽ አመጸኞችና የሌቦች ባልንጀሮች ሆኑ፤ ሁሉ ጉቦ ይወድዳሉ፥ ዋጋም ለማግኘት ይሮጣሉ፤ ለድሀ አደጉ አይፈርዱም፥ የመበለቲቱም ሙግት ወደ እነርሱ አይደርስም።\n" +
                "24 ፤ ስለዚህ የእስራኤል ኃያል የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። በጠላቶቼ ላይ ቍጣዬን እፈጽማለሁ፥ የሚቋቋሙኝንም እበቀላለሁ።\n" +
                "25 ፤ እጄንም በአንቺ ላይ አመጣለሁ፥ ዝገትሽንም በጣም አነጻለሁ፥ ቆርቆሮሽንም ሁሉ አወጣለሁ፤\n" +
                "26 ፤ ፈራጆችሽንም እንደ ቀድሞ አማካሪዎችሽንም እንደ መጀመሪያው ጊዜ መልሼ አስነሣለሁ፤ ከዚያም በኋላ የጽድቅ ከተማ የታመነችም ከተማ ተብለሽ ትጠሪያለሽ።\n" +
                "27 ፤ ጽዮን በፍርድ ከእርሷም የሚመለሱ በጽድቅ ይድናሉ።\n" +
                "28 ፤ በደለኞችና ኃጢአተኞች ግን በአንድነት ይሰበራሉ፥ እግዚአብሔርንም የሚተዉ ይጠፋሉ።\n" +
                "29 ፤ በወደዳችኋት የአድባር ዛፍ ታፍራላችሁና፥ ስለ መረጣችኋትም አትክልት እፍረት ይይዛችኋልና፤\n" +
                "30 ፤ ቅጠልዋ እንደ ረገፈ ዛፍ፥ ውሃም እንደሌለባት አትክልት ትሆናላችሁና።\n" +
                "31 ፤ ኃይለኛውም እንደ ተልባ ጭረት፥ ሥራውም እንደ ጠለሸት ይሆናል፤ አብረውም ይቃጠላሉ እነርሱንም የሚያጠፋ የለም።\n"));
        // Add more verses as needed
        return new Chapter(1, verses);
    }

    private Chapter chapterTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ የአሞጽ ልጅ ኢሳይያስ ስለ ይሁዳና ስለ ኢየሩሳሌም ያየው ቃል።\n" +
                "2 ፤ በዘመኑም ፍጻሜ የእግዚአብሔር ቤት ተራራ በተራሮች ራስ ላይ ጸንቶ ይቆማል፥ ከኮረብቶችም በላይ ከፍ ከፍ ይላል፥ አሕዛብም ሁሉ ወደ እርሱ ይሰበሰባሉ።\n" +
                "3 ፤ ሕግ ከጽዮን የእግዚአብሔርም ቃል ከኢየሩሳሌም ይወጣልና ብዙዎች አሕዛብ ሄደው። ኑ፥ ወደ እግዚአብሔር ተራራ፥ ወደ ያዕቆብ አምላክ ቤት እንውጣ፤ እርሱም መንገዱን ያስተምረናል፥ በጎዳናውም እንሄዳለን ይላሉ።\n" +
                "4 ፤ በአሕዛብም መካከል ይፈርዳል፥ በብዙ አሕዛብም ላይ ይበይናል፤ ሰይፋቸውንም ማረሻ ጦራቸውንም ማጭድ ለማድረግ ይቀጠቅጣሉ፤ ሕዝብም በሕዝብ ላይ ሰይፍ አያነሣም፥ ሰልፍም ከእንግዲህ ወዲህ አይማሩም።\n" +
                "5 ፤ እናንተ የያዕቆብ ቤት ሆይ፥ ኑ፥ በእግዚአብሔር ብርሃን እንሂድ።\n" +
                "6 ፤ ሕዝብህን የያዕቆብን ቤት ትተሃልና፤ ይኸውም የምሥራቅን ሰዎች አመል ስለ ተሞሉ፥ እንደ ፍልስጥኤማውያንም ምዋርተኞች ስለ ሆኑ፥ ከባዕድ ልጆችም ጋር ስለ ተባበሩ ነው።\n" +
                "7 ፤ ምድራቸው በብርና በወርቅ ተሞልታለች፥ ለመዛግብቶቻቸውም ፍጻሜ የለውም፤ ምድራቸውም ደግሞ በፈረሶች ተሞልታለች፥ ለሠረገሎቻቸውም ፍጻሜ የለውም።\n" +
                "8 ፤ ምድራቸው ደግሞ በጣዖታት ተሞልታለች፤ ጣቶቻቸውም ላደረጉት ለእጃቸው ሥራ ይሰግዳሉ።\n" +
                "9 ፤ ታናሹም ሰው ዝቅ ብሎአል፥ ጨዋውም ተዋርዶአል፤ ኃጢአታቸውንም ይቅር አትበላቸው።\n" +
                "10 ፤ ከእግዚአብሔር ማስደንገጥና ከግርማው ክብር የተነሣ ወደ ድንጋይ ዋሻ ግባ፥ በመሬትም ውስጥ ተሸሸግ።\n" +
                "11 ፤ ከፍ ያለችውም የሰው ዓይን ትዋረዳለች፥ የሰዎችም ኵራት ትወድቃለች፥ በዚያም ቀን እግዚአብሔር ብቻውን ከፍ ከፍ ይላል።\n" +
                "12 ፤ የሠራዊት ጌታ የእግዚአብሔር ቀን በትዕቢተኛውና በኵራተኛው ሁሉ ላይ ከፍ ባለውም ላይ ይሆናል፥ እርሱም ይዋረዳል፤\n" +
                "13 ፤ ደግሞም በረጅሙ ከፍ ባለው በሊባኖስ ዝግባ ሁሉ ላይ፥ በባሳንም ዛፍ ሁሉ ላይ፥\n" +
                "14 ፤ በረጅሙም ተራራ ሁሉ ላይ፥ ከፍ ባለውም ኮረብታ ሁሉ ላይ፥\n" +
                "15 ፤ በረጅሙም ግንብ ሁሉ ላይ፥ በተመሸገውም ቅጥር ሁሉ ላይ፥\n" +
                "16 ፤ በተርሴስም መርከብ ሁሉ ላይ፥ በሚያማምሩ ጣዖታትም ሁሉ ላይ ይሆናል።\n" +
                "17 ፤ ሰውም ሁሉ ይዋረዳል፥ የሰውም ኵራት ይወድቃል፥ በዚያም ቀን እግዚአብሔር ብቻ ከፍ ከፍ ይላል።\n" +
                "18 ፤ ጣዖቶቻቸውም ሁሉ ፈጽመው ይጠፋሉ።\n" +
                "19 ፤ እግዚአብሔርም ምድርን ያናውጥ ዘንድ በተነሣ ጊዜ ሰዎች ከማስደንገጡና ከግርማው ክብሩ የተነሣ ወደ ድንጋይ ዋሻና ወደ ምድር ንቃቃት ውስጥ ይገባሉ።\n" +
                "20 ፤ በዚያን ቀን ሰው ይሰግድላቸው ዘንድ ያበጁአቸውን የብሩንና የወርቁን ጣዖቶቹን ለፍልፈልና ለሌሊት ወፍ ይጥላል።\n" +
                "21 ፤ እግዚአብሔርም ምድርን ያናውጥ ዘንድ በተነሣ ጊዜ ከማስደንገጡና ከግርማው ክብር የተነሣ ወደ ድንጋይ ዋሻና ወደ ተሰነጠቁ ዓለቶች ውስጥ ይገባሉ።\n" +
                "22 ፤ እስትንፋሱ በአፍንጫው ውስጥ ያለበትን ሰው ተዉት፤ እርሱ ስለ ምን ይቈጠራል?\n" ));
        // Add more verses as needed
        return new Chapter(2, verses);
    }

    private Chapter chapterThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ እነሆ፥ የሠራዊት ጌታ እግዚአብሔር ከኢየሩሳሌምና ከይሁዳ ድጋፍንና ብርታትን፥ የእንጀራን ድጋፍ ሁሉ የውኃውንም ድጋፍ ሁሉ፥\n" +
                "2 ፤ ኃያሉንም፥ ተዋጊውንም፥ ፈራጁንም፥ ነቢዩንም፥ ምዋርተኛውንም፥\n" +
                "3 ፤ ሽማግሌውንም፥ የአምሳ አለቃውንም፥ ከበርቴውንም፥ አማካሪውንም፥ ብልሁንም ሠራተኛ፥ አስማት አዋቂውንም ይነቅላል።\n" +
                "4 ፤ አለቆቻቸው እንዲሆኑ ብላቴኖችን አስነሣባቸዋለሁ፥ ሕፃናቶችም ይገዙአቸዋል።\n" +
                "5 ፤ ሕዝቡም፥ ሰው በሰው ላይ ሰውም በባልንጀራው ላይ፥ ይገፋፋል፤ ብላቴናውም በሽማግሌው ላይ የተጠቃውም በከበርቴው ላይ ይኰራል።\n" +
                "6 ፤ ሰውም በአባቱ ቤት ውስጥ ወንድሙን ይዞ። አንተ ልብስ አለህ አለቃም ሁንልን ይህችም ባድማ ከእጅህ በታች ትሁን ሲለው፥\n" +
                "7 ፤ በዚያ ቀን ድምፁን ከፍ አድርጎ። እኔ በቤቴ ውስጥ እንጀራ ወይም ልብስ የለኝምና ባለ መድኃኒት አልሆንም፤ በሕዝቡም ላይ አለቃ አታደርጉኝም ይላል።\n" +
                "8 ፤ የክብሩን ዓይን ያስቈጡ ዘንድ ምላሳቸውና ሥራቸው በእግዚአብሔር ላይ ነውና ኢየሩሳሌም ተፈታች ይሁዳም ወደቀ።\n" +
                "9 ፤ የፊታቸውም እፍረት ይመሰክርባቸዋል፤ እንደ ሰዶምም ኃጢአታቸውን ያወራሉ፥ አይሠውሩአትም። በራሳቸው ላይ ክፉ ነገርን ሠርተዋልና ለነፍሳቸው ወዮ!\n" +
                "10 ፤ የሥራቸውን ፍሬ ይበላሉና ጻድቁን። መልካም ይሆንልሃል በሉት።\n" +
                "11 ፤ እንደ እጁ ሥራ ፍዳው ይደረግበታልና ለበደለኛ ወዮ! ክፉም ደርሶበታል።\n" +
                "12 ፤ ሕዝቤንስ አስገባሪዎቻቸው ይገፉአቸዋል፥ አስጨናቂዎችም ይሠለጥኑባቸዋል። ሕዝቤ ሆይ፥ የመሩአችሁ ያስቱአችኋል የምትሄዱበትንም መንገድ ያጠፋሉ።\n" +
                "13 ፤ እግዚአብሔር ለፍርድ ተነሥቶአል በሕዝቡም ላይ ሊፈርድ ቆሞአል።\n" +
                "14 ፤ እግዚአብሔር ከሕዝቡ ሽማግሌዎችና ከአለቆቻቸው ጋር ይፋረዳል፤ የወይኑን ቦታ የጨረሳችሁ እናንተ ናችሁ፤ ከድሆች የበዘበዛችሁት በቤታችሁ አለ፤\n" +
                "15 ፤ ሕዝቤንም ለምን ታደቅቁአቸዋላችሁ? የድሆችንስ ፊት ለምን ትፈጫላችሁ? ይላል የሠራዊት ጌታ እግዚአብሔር።\n" +
                "16 ፤ ደግሞም እግዚአብሔር እንዲህ አለ። የጽዮን ቈነጃጅት ኰርተዋልና፥ አንገታቸውንም እያሰገጉ በዓይናቸውም እያጣቀሱ፥ ፈንጠርም እያሉ፥ በእግራቸውም እያቃጨሉ ይሄዳሉና\n" +
                "17 ፤ ስለዚህ ጌታ የጽዮንን ቈነጃጅት አናት በቡሀነት ይመታል፥ እግዚአብሔርም ኀፍረተ ሥጋቸውን ይገልጣል።\n" +
                "18 ፤ በዚያም ቀን ጌታ የእግር አልቦውን ክብር፥ መርበብንም፥ ጨረቃ የሚመስለውንም ጌጥ፥ የጆሮ እንጥልጥሉንም፥\n" +
                "19 ፤ አንባሩንም፥ መሸፈኛውንም፥ ቀጸላውንም፥\n" +
                "20 ፤ ሰንሰለቱንም፥ መቀነቱንም፥ የሽቱውንም ዕቃ፥\n" +
                "21 ፤ አሸንክታቡንም፥ የእጅና የአፍንጫ ቀለበቱንም፥\n" +
                "22 ፤ የዓመት በዓልንም ልብስ፥ መጐናጸፊያውንም፥ ልግምበገላውንም፥ ከረጢቱንም፥\n" +
                "23 ፤ መስተዋቱንም፥ ከጥሩ በፍታ የተሰራውንም ልብስ፥ ራስ ማሰሪያውንም፥ ዓይነ ርግቡንም ያስወግዳል።\n" +
                "24 ፤ እንዲህም ይሆናል፤ በሽቱ ፋንታ ግማት፥ በመታጠቂያውም ፋንታ ገመድ፥ ጠጕርንም በመንቀስ ፋንታ ቡሀነት፥ በመጐናጸፊያ ፋንታ ማቅ፥ በውበትም ፋንታ ጠባሳ ይሆናል።\n" +
                "25 ፤ ጕልማሶችሽ በሰይፍ፥ ኃያላንሽም በውጊያ ይወድቃሉ።\n" +
                "26 ፤ በሮችዋ ያዝናሉ ያለቅሱማል፤ እርስዋም ብቻዋን በምድር ላይ ትቀመጣለች።\n"));
        // Add more verses as needed
        return new Chapter(3, verses);
    }

    private Chapter chapterFour() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በዚያም ቀን ሰባት ሴቶች። የገዛ እንጀራችንን እንበላለን የገዛ ልብሳችንንም እንለብሳለን፤ ስምህ ብቻ በእኛ ላይ ይጠራ፥ መሰደባችንንም አርቅ ብለው አንዱን ወንድ ይይዙታል።\n" +
                "2 ፤ በዚያም ቀን የእግዚአብሔር ቍጥቋጥ ለጌጥና ለክብር ይሆናል፥ ከእስራኤልም ወገን ላመለጡ ሰዎች የምድሪቱን ፍሬ ለትምክሕትና ለውበት ይሆናል።\n" +
                "3 ፤\n" +
                "4 ፤ ጌታም የጽዮንን ቈነጃጅት እድፍ ባጠበ ጊዜ፥ የኢየሩሳሌምንም ደም በፍርድ መንፈስና በሚያቃጥል መንፈስ ከመካከልዋ ባነጻ ጊዜ፥ በጽዮን የቀረ በኢየሩሳሌምም የተረፈ፥ በኢየሩሳሌም ለሕይወት የተጻፈ ሁሉ፥ ቅዱስ ይባላል።\n" +
                "5 ፤ እግዚአብሔርም በጽዮን ተራራ ላይ ባለ ማደሪያ ሁሉ በጉባኤአቸውም ላይ በቀን ዳመናንና ጢስን በሌሊትም የሚቃጠለውን የእሳት ብርሃን ይፈጥራል፤ በክብርም ሁሉ ላይ መጋረጃ ይሆናል።\n" +
                "6 ፤ በቀን ከሙቀት ለጥላ፥ ከዐውሎ ነፋስና ከዝናብም ለመጠጊያና ለመሸሸጊያ ጎጆ ይሆናል።\n"));
        // Add more verses as needed
        return new Chapter(4, verses);
    }
    private Chapter chapterFive() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ አሁን ስለ ወዳጄና ስለ ወይን ቦታው ለወዳጄ ቅኔ እቀኛለሁ። ለወዳጄ በፍሬያማው ኮረብታ ላይ የወይን ቦታ ነበረው።\n" +
                "2 ፤ በዙሪያው ቈፈረ፥ ድንጋዮችንም ለቅሞ አወጣ፥ ምርጥ የሆነውንም አረግ ተከለበት፥ በመካከሉም ግንብ ሠራ፥ ደግሞም የመጥመቂያ ጕድጓድ ማሰበት፤ ወይንንም ያፈራ ዘንድ ተማመነ፥ ዳሩ ግን ሆምጣጣ ፍሬ አፈራ።\n" +
                "3 ፤ አሁንም እናንተ በኢየሩሳሌም የምትኖሩ የይሁዳ ሰዎች ሆይ፥ በእኔና በወይኑ ቦታዬ መካከል እስኪ ፍረዱ።\n" +
                "4 ፤ ለወይኔ ያላደረግሁለት፥ ከዚህ ሌላ አደርግለት ዘንድ የሚገባኝ ምንድር ነው? ወይንን ያፈራል ብዬ ስትማመን ስለ ምን ሆምጣጣ ፍሬ አፈራ?\n" +
                "5 ፤ አሁንም በወይኔ ላይ የማደርገውን እነግራችኋለሁ፤ አጥሩን እነቅላለሁ፥ ለማሰማርያም ይሆናል፤ ቅጥሩንም አፈርሳለሁ፥ ለመራገጫም ይሆናል።\n" +
                "6 ፤ ባድማ አደርገዋለሁ፤ አይቈረጥም፥ አይኰተኰትም፤ ኵርንችትና እሾህ ይበቅልበታል፤ ዝናብንም እንዳያዘንቡበት ዳመናዎችን አዝዛለሁ።\n" +
                "7 ፤ የሠራዊት ጌታ የእግዚአብሔር ወይን ቦታ እርሱ የእስራኤል ቤት ነው፥ የደስታውም አትክልት የይሁዳ ሰዎች ናቸው፤ ፍርድን ተስፋ ያደርግ ነበር፥ እነሆም ደም ማፍሰስ ሆነ፤ ጽድቅንም ይተማመን ነበር፥ እነሆም፥ ጩኸት ሆነ።\n" +
                "8 ፤ ስፍራ እስከማይቀር ድረስ እናንተም በምድር ላይ ብቻችሁን እስክትቀመጡ ድረስ፥ ቤትን ከቤት ጋር ለሚያያይዙ እርሻንም ከእርሻ ጋር ለሚያቀራርቡ ወዮላቸው!\n" +
                "9 ፤ የሠራዊት ጌታ እግዚአብሔር በጆሮዬ እንዲህ አለ። በእውነት ብዙ ታላቅና መልካም ቤት ባድማ ይሆናል፥ የሚቀመጥበትም አይገኝም።\n" +
                "10 ፤ ከወይኑ ቦታ አሥር ጥማድ በሬ ካረሰው አንድ የባዶስ መስፈሪያ ብቻ ይወጣል፤ አንድ የቆሮስ መስፈሪያ ዘር አንድ የኢፍ መስፈሪያ ብቻ ይሰጣል።\n" +
                "11 ፤ ስካርን ለመከተል በጥዋት ለሚማልዱ፥ የወይን ጠጅም እስኪያቃጥላቸው እስከ ሌሊት ድረስ ለሚዘገዩ ወዮላቸው!\n" +
                "12 ፤ መሰንቆና በገና ከበሮና እምቢልታም የወይን ጠጅም በግብዣቸው አለ፤ የእግዚአብሔርን ሥራ ግን አልተመለከቱም፥ እጁም ያደረገችውን አላስተዋሉም።\n" +
                "13 ፤ ስለዚህ ሕዝቤ ወደ ምርኮ ሄዱ፥ ጌታን አላወቁትምና፤ ከበርቴዎቻቸውም ተራቡ፥ ሕዝባቸውም ተጠሙ።\n" +
                "14 ፤ ሲኦልም ሆድዋን አስፍታለች፥ አፍዋንም ያለ ልክ ከፍታለች፤ ከበርቴዎቻቸውና አዛውንቶቻቸው ባለጠጎቻቸውም ደስተኞቻቸውም ወደ እርስዋ ይወርዳሉ።\n" +
                "15 ፤ ሰውም ይጐሰቍላል፥ ሰውም ይዋረዳል፥ የትዕቢተኞችም ዓይን ትዋረዳለች፤\n" +
                "16 ፤ የሠራዊት ጌታ እግዚአብሔር ግን በፍርድ ከፍ ከፍ ብሎአል፥ ቅዱሱም አምላክ በጽድቅ ተቀድሶአል።\n" +
                "17 ፤ የበግ ጠቦቶች በማሰማርያቸው ውስጥ ይሰማራሉ፥ እንግዶችም የሰቡትን ባድማ ይበላሉ።\n" +
                "18 ፤ በደልን በምናምንቴ ገመድ፥ ኃጢአትንም በሰረገላ ማሰሪያ ወደ ራሳቸው ለሚስቡ። እናይ ዘንድ ይቸኵል፥\n" +
                "19 ፤ ሥራውንም ያፋጥን፤ እናውቃትም ዘንድ የእስራኤል ቅዱስ ምክር ትቅረብ፥ ትምጣ ለሚሉ ወዮላቸው!\n" +
                "20 ፤ ክፉውን መልካም መልካሙን ክፉ ለሚሉ፥ ጨለማውን ብርሃን ብርሃኑንም ጨለማ ለሚያደርጉ፥ ጣፋጩን መራራ መራራውንም ጣፋጭ ለሚያደርጉ ወዮላቸው!\n" +
                "21 ፤ በዓይናቸው ጥበበኞች በነፍሳቸውም አስተዋዮች ለሆኑ ወዮላቸው!\n" +
                "22 ፤ የወይን ጠጅ ለመጠጣት ኃያላን የሚያሰክረውንም ለማደባለቅ ጨካኞች ለሆኑ፤\n" +
                "23 ፤ በደለኛውን ስለ ጉቦ ጻድቅ ለሚያደርጉ፥ የጻድቁንም ጽድቅ ለሚያስወግዱበት ወዮላቸው!\n" +
                "24 ፤ ስለዚህ የእሳት ወላፈን ቃርሚያን እንደሚበላ፥ እብቅም በነበልባል ውስጥ እንደሚጠፋ፥ እንዲሁ የእነርሱ ሥር የበሰበሰ ይሆናል ቡቃያቸውም እንደ ትቢያ ይበንናል፤ የሠራዊት ጌታ የእግዚአብሔርን ሕግ ጥለዋልና፥ የእስራኤልም ቅዱስ የተናገረውን ቃል አቃልለዋልና።\n" +
                "25 ፤ ስለዚህ የእግዚአብሔር ቍጣ በሕዝቡ ላይ ነድዶአል እጁንም በላያቸው ዘርግቶ መትቶአቸዋል፤ ተራሮችም ተንቀጠቀጡ፥ ሬሳቸውም በአደባባይ መካከል እንደ ጕድፍ ሆኖአል። በዚህም ሁሉ እንኳ ቍጣው አልተመለሰችም፥ ነገር ግን እጁ ገና ተዘርግታ ትኖራለች።\n" +
                "26 ለአሕዛብም በሩቅ ምልክትን ያቆማል፥ ከምድርም ዳርቻ በፉጨት ይጠራቸዋል፤ እነሆም፥ እየተጣደፉ ፈጥነው ይመጣሉ።\n" +
                "27 ደካማና ስንኵል የለባቸውም፥ የሚያንቀላፋና የሚተኛም የለም፤ የወገባቸውም መቀነት አይፈታም፥ የጫማቸውም ማዘቢያ አይበጠስም።\n" +
                "28 ፍላጾቻቸው ተስለዋል፥ ቀስቶቻቸውም ሁሉ ተለጥጠዋል፤ የፈረሶቻቸውም ኮቴ እንደ ቡላድ የሰረገሎቻቸውም መንኰራኵር እንደ ዐውሎ ነፋስ ይቈጠራል።\n" +
                "29 ጩኸታቸው እንደ አንበሳ ነው፥ እንደ አንበሳ ደቦሎችም ያገሣሉ፤ ንጥቂያንም ይዘው ያገሣሉ፥ ይወስዱትማል፥ የሚያድንም የለም።\n" +
                "30 በዚያም ቀን እንደ ባሕር መትመም ይተምሙባቸዋል፤ ወደ ምድርም ቢመለከቱ፥ እነሆ፥ ጨለማና መከራ አለ፤ ብርሃንም በደመናዎችዋ ውስጥ ጨልሞአል።\n"));

        return new Chapter(5, verses);
    }

    private Chapter chapterSix() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ንጉሡ ዖዝያን በሞተበት ዓመት እግዚአብሔርን በረጅምና ከፍ ባለ ዙፋን ላይ ተቀምጦ አየሁት፥ የልብሱም ዘርፍ መቅደሱን ሞልቶት ነበር።\n" +
                "2 ፤ ሱራፌልም ከእርሱ በላይ ቆመው ነበር፥ ለእያንዳንዱም ስድስት ክንፍ ነበረው፤ በሁለት ክንፍ ፊቱን ይሸፍን ነበር፥ በሁለቱም ክንፍ እግሮቹን ይሸፍን ነበር፥ በሁለቱም ክንፍ ይበር ነበር።\n" +
                "3 ፤ አንዱም ለአንዱ። ቅዱስ፥ ቅዱስ፥ ቅዱስ፥ የሠራዊት ጌታ እግዚአብሔር፤ ምድር ሁሉ ከክብሩ ተሞልታለች እያለ ይጮኽ ነበር።\n" +
                "4 ፤ የመድረኩም መሠረት ከጭዋኺው ድምፅ የተነሣ ተናወጠ፥ ቤቱንም ጢስ ሞላበት።\n" +
                "5 ፤ እኔም። ከንፈሮቼ የረከሱብኝ ሰው በመሆኔ፥ ከንፈሮቻቸውም በረከሱባቸው ሕዝብ መካከል በመቀመጤ ዓይኖቼ የሠራዊትን ጌታ ንጉሡን እግዚአብሔርን ስለ አዩ ጠፍቻለሁና ወዮልኝ! አልሁ።\n" +
                "6 ፤ ከሱራፌልም አንዱ እየበረረ ወደ እኔ መጣ፥ በእጁም ከመሠዊያው በጕጠት የወሰደው ፍም ነበረ።\n" +
                "7 ፤ አፌንም ዳሰሰበትና። እነሆ፥ ይህ ከንፈሮችህን ነክቶአል፤ በደልህም ከአንተ ተወገደ፥ ኃጢአትህም ተሰረየልህ አለኝ።\n" +
                "8 ፤ የጌታንም ድምፅ። ማንን እልካለሁ? ማንስ ይሄድልናል? ሲል ሰማሁ። እኔም። እነሆኝ፥ እኔን ላከኝ አልሁ።\n" +
                "9 ፤ እርሱም። ሂድ፥ ይህን ሕዝብ። መስማትን ትሰማላችሁ አታስተውሉምም፤ ማየትንም ታያላችሁ አትመለከቱምም በላቸው።\n" +
                "10 ፤ በዓይናቸው እንዳያዩ፥ በጆሮአቸውም እንዳይሰሙ፥ በልባቸውም እንዳያስተውሉ፥ ተመልሰውም እንዳይፈወሱ፥ የዚህን ሕዝብ ልብ አደንድን፥ ጆሮአቸውንም አደንቍር፥ ዓይናቸውንም ጨፍን አለኝ።\n" +
                "11 ፤ እኔም። ጌታ ሆይ፥ እስከ መቼ ድረስ ነው? አልሁ። እርሱም መልሶ እንዲህ አለ። ከተሞች የሚኖርባቸውን አጥተው እስኪፈርሱ ድረስ፥ ቤቶችም ሰው አልቦ እስኪሆኑ ምድርም ፈጽሞ ባድማ ሆና እስክትቀር ድረስ፥\n" +
                "12 ፤ እግዚአብሔርም ሰዎችን እስኪያርቅ፥ በምድርም መካከል ውድማው መሬት እስኪበዛ ድረስ ነው።\n" +
                "13 ፤ በእርስዋም ዘንድ አሥረኛ እጅ ቀርቶ እንደ ሆነ እርሱ ደግሞ ይቃጠላል፤ በተቈረጡ ጊዜ ጉቶቻቸው እንደ ቀሩ እንደ ግራርና እንደ ኮምበል ዛፍ ሆኖ፥ ጉቶው የተቀደሰ ዘር ይሆናል።\n" ));

        return new Chapter(6, verses);
    }

    private Chapter chapterSeven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እንዲህም ሆነ፤ በይሁዳ ንጉሥ በዖዝያን ልጅ በኢዮአታም ልጅ በአካዝ ዘመን የሶርያ ንጉሥ ረአሶን የእስራኤልም ንጉሥ የሮሜልዩ ልጅ ፋቁሔ ኢየሩሳሌምን ሊወጉ ወጡ፥ ሊያሸንፉአትም አልቻሉም።\n" +
                "2 ፤ ለዳዊትም ቤት። ሶርያ ከኤፍሬም ጋር ተባብረዋል የሚል ወሬ ተነገረ፤ የእርሱም ልብ የሕዝቡም ልብ የዱር ዛፍ በነፋስ እንድትናወጥ ተናወጠ።\n" +
                "3 ፤ እግዚአብሔርም ኢሳይያስን አለው። አንተና ልጅህ ያሱብ አካዝን ትገናኙት ዘንድ በልብስ አጣቢው እርሻ መንገድ ወዳለው ወደ ላይኛው የኵሬ መስኖ ጫፍ ውጡ፤\n" +
                "4 ፤ እንዲህም በለው። ተጠበቅ፥ ዝምም በል፤ ስለ እነዚህ ስለሚጤሱ ስለ ሁለት የእንጨት ጠለሸቶች፥ ስለ ሶርያና ስለ ረአሶን ስለ ሮሜልዩም ልጅ ቍጣ አትፍራ፥ ልብህም አይድከም።\n" +
                "5 ፤\n" +
                "6 ፤ ሶርያና ኤፍሬም የሮሜልዩም ልጅ። ወደ ይሁዳ እንውጣ እናስጨንቀውም፥ እንስበረውም፥ የጣብኤልንም ልጅ እናንግሥበት ብለው ክፋት ስለ መከሩብህ፤\n" +
                "7 ፤ ጌታ እግዚአብሔር እንዲህ ይላል። ይህ ምክር አይጸናምና አይሆንም።\n" +
                "8 ፤ የሶርያ ራስ ደማስቆ ነው፥ የደማስቆም ራስ ረአሶን ነው፤ በስድሳ አምስት ዓመት ውስጥ ኤፍሬም ይሰባበራልና ሕዝብ አይሆንም፤\n" +
                "9 ፤ የኤፍሬምም ራስ ሰማርያ ነው፥ የሰማርያም ራስ የሮሜልዩ ልጅ ነው። ባታምኑ አትጸኑም።\n" +
                "10 ፤ እግዚአብሔርም ደግሞ አካዝን እንዲህ ብሎ ተናገረው።\n" +
                "11 ፤ ከጥልቁ ወይም ከከፍታው ቢሆን ከአምላክህ ከእግዚአብሔር ምልክትን ለምን።\n" +
                "12 ፤ አካዝም። አልለምንም፥ እግዚአብሔርንም አልፈታተንም አለ።\n" +
                "13 ፤ እርሱም አለ። እናንተ የዳዊት ቤት ሆይ፥ ስሙ፤ በውኑ ሰውን ማድከማችሁ ቀላል ነውን? አምላኬን ደግሞ የምታደክሙ፤\n" +
                "14 ፤ ስለዚህ ጌታ ራሱ ምልክት ይሰጣችኋል፤ እነሆ፥ ድንግል ትፀንሳለች፥ ወንድ ልጅም ትወልዳለች፥ ስሙንም አማኑኤል ብላ ትጠራዋለች።\n" +
                "15 ፤ ክፉን ለመጥላት መልካሙንም ለመምረጥ ሲያውቅ ቅቤና ማር ይበላል።\n" +
                "16 ፤ ሕፃኑ ክፉን ለመጥላት መልካሙን ለመምረጥ ሳያውቅ የፈራሃቸው የሁለቱ ነገሥታት አገር ባድማ ትሆናለች።\n" +
                "17 ፤ እግዚአብሔርም ኤፍሬም ከይሁዳ ከተለየበት ቀን ጀምሮ ያልመጣውን ዘመን በአንተና በሕዝብህ በአባትህም ቤት ላይ ያመጣል፤ እርሱም የአሦር ንጉሥ መምጣት ነው።\n" +
                "18 ፤ በዚያም ቀን እንዲህ ይሆናል፤ እግዚአብሔር በግብጽ ወንዝ ዳርቻ ያለውን ዝምብ በአሦርም አገር ያለውን ንብ በፉጨት ይጠራል።\n" +
                "19 ፤ ይመጡማል፥ እነርሱም ሁሉ በበረሃ ሸለቆ በድንጋይም ዋሻ ውስጥ በእሾህ ቍጥቋጦ ሁሉ ላይ በማሰማርያውም ሁሉ ላይ ይሰፍራሉ።\n" +
                "20 ፤ በዚያም ቀን እግዚአብሔር ከወንዙ ማዶ በተከራየው ምላጭ በአሦር ንጉሥ የራሱንና የእግሩን ጠጕር ይላጨዋል፤ ምላጩም ጢሙን ደግሞ ይበላል።\n" +
                "21 ፤ በዚያም ቀን እንዲህ ይሆናል፤ ሰው አንዲት ጊደርን ሁለት በጎችንም ያሳድጋል፤\n" +
                "22 ፤ ከሚሰጡት ወተት ብዛት የተነሣ ቅቤ ይበላል፤ በአገሪቱም መካከል የቀረ ሁሉ ቅቤና ማር ይበላል።\n" +
                "23 ፤ በዚያም ቀን እንዲህ ይሆናል፤ ሺህ ብር የተገመተ ሺህ የወይን ግንድ በነበረበት ስፍራ ሁሉ ለኵርንችትና ለእሾህ ይሆናል።\n" +
                "24 ፤ ኵርንችትና እሾህ በምድር ሁሉ ላይ ነውና በፍላጻና በቀስት ወደዚያ ይገባሉ።\n" +
                "25 ፤ በመቈፈርያም ወደ ተቈፈሩ ኮረብቶች ሁሉ ከኵርንችትና እሾህ ፍርሃት የተነሣ ወደዚያ አትሄድም፤ ነገር ግን የበሬ ማሰማርያና የበግ መራገጫ ይሆናል።\n"));

        return new Chapter(7, verses);
    }

    private Chapter chapterEight() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እግዚአብሔርም። ታላቅ ሰሌዳ ወስደህ። ምርኮ ፈጠነ፥ ብዝበዛ ቸኰለ ብለህ በሰው ፊደል ጻፍበት።\n" +
                "2 ፤ የታመኑትን ሰዎች ካህኑን ኦርዮንና የበራክዩን ልጅ ዘካርያስን ምስክሮች አድርግልኝ አለኝ።\n" +
                "3 ፤ ወደ ነቢይቱም ቀረብሁ፤ እርስዋም ፀነሰች ወንድ ልጅንም ወለደች።\n" +
                "4 ፤ እግዚአብሔርም። ሕፃኑ አባቱንና እናቱን መጥራት ሳያውቅ የደማስቆን ሀብትና የሰማርያን ምርኮ በአሦር ንጉሥ ፊት ይወስዳልና ስሙን። ምርኮ ፈጠነ፥ ብዝበዛ ቸኰለ ብለህ ጥራው አለኝ።\n" +
                "5 ፤ እግዚአብሔርም ደግሞ ተናገረኝ እንዲህም አለኝ።\n" +
                "6 ፤ ይህ ሕዝብ በቀስታ የሚሄደውን የሰሊሆምን ውኃ ጠልቶአልና፥ ረአሶንንና የሮሜልዩንም ልጅ ወዶአልና ስለዚህ፥\n" +
                "7 ፤ እነሆ፥ እግዚአብሔር ብርቱና ብዙ የሆነውን የወንዝ ውኃ፥ የአሦርን ንጉሥና ክብሩን ሁሉ፥ ያመጣባቸዋል፤ መስኖውንም ሁሉ ሞልቶ ይወጣል፥ በዳሩም ሁሉ ላይ ይፈስሳል፤\n" +
                "8 ፤ እየጐረፈም ወደ ይሁዳ ይገባል፤ እያጥለቀለቀም ያልፋል፥ እስከ አንገትም ይደርሳል፤ አማኑኤል ሆይ፥ የክንፉ መዘርጋት የአገርህን ስፋት ትሞላለች።\n" +
                "9 ፤ አሕዛብ ሆይ፥ እወቁና ደንግጡ፤ እናንተም ምድራችሁ የራቀ ሁሉ፥ አድምጡ፤ ታጠቁም፥ ደንግጡ፤ ታጠቁ፤ ደንግጡ።\n" +
                "10 ፤ ተመካከሩ፥ ምክራችሁም ይፈታል፤ ቃሉን ተናገሩ፥ ቃሉም አይጸናም፤ እግዚአብሔር ከእኛ ጋር ነውና።\n" +
                "11 ፤ እግዚአብሔርም በጽኑ እጅ እንዲህ ተናገረኝ፥ በዚህም ሕዝብ መንገድ አንዳልሄድ አስጠነቀቀኝ፥ እንዲህም አለኝ።\n" +
                "12 ፤ ይህ ሕዝብ። ዱለት ነው በሚሉት ሁሉ። ዱለት ነው አትበሉ፤ መፈራታቸውንም አትፍሩ፥ አትደንግጡ።\n" +
                "13 ፤ ነገር ግን የሠራዊት ጌታ እግዚአብሔርን ቀድሱት፤ የሚያስፈራችሁና የሚያስደነግጣችሁም እርሱ ይሁን።\n" +
                "14 ፤ እርሱም ለመቅደስ ይሆናል፤ ነገር ግን ለሁለቱ ለእስራኤል ቤቶች ለዕንቅፋት ድንጋይና ለማሰናከያ ዓለት፥ በኢየሩሳሌምም ለሚኖሩ ለወጥመድና ለአሽክላ ይሆናል።\n" +
                "15 ፤ ብዙዎችም በእርሱ ይሰናከላሉ፥ ይወድቁማል፥ ይሰበሩማል፥ ይጠመዱማል፥ ይያዙማል።\n" +
                "16 ፤ ምስክሩን እሰር፤ በደቀ መዛሙርቶቼም መካከል ሕጉን አትም።\n" +
                "17 ፤ ከያዕቆብም ቤት ፊቱን የመለሰውን እግዚአብሔርን እጠብቃለሁ፥ እተማመንበትማለሁ።\n" +
                "18 ፤ እነሆ፥ እኔና እግዚአብሔር የሰጠኝ ልጆች ለእስራኤል በጽዮን ተራራ ከሚኖረው ከሠራዊት ጌታ ከእግዚአብሔር ዘንድ ምልክትና ተአምራት ነን።\n" +
                "19 ፤ እነርሱም። የሚጮኹትንና ድምፃቸውን ዝቅ አድርገው የሚናገሩትን መናፍስት ጠሪዎችንና ጠንቋዮችን ጠይቁ ባሉአችሁ ጊዜ፥ ሕዝቡ ከአምላኩ መጠየቅ አይገባውምን? ወይስ ለሕያዋን ሲሉ ሙታንን ይጠይቃሉን?\n" +
                "20 ፤ ወደ ሕግና ወደ ምስክር ሂዱ! እንዲህም ያለውን ቃል ባይናገሩ ንጋት አይበራላቸውም።\n" +
                "21 ፤ እነርሱም ተጨንቀውና ተርበው ያልፋሉ፤ በተራቡም ጊዜ ተቈጥተው ንጉሣቸውንና አምላካቸውን ይረግማሉ፥ ወደ ላይም ይመለከታሉ፤\n" +
                "22 ፤ ወደ ምድርም ይመለከታሉ፥ እነሆም፥ መከራና ጨለማ የሚያስጨንቅም ጭጋግ አለ፤ ወደ ድቅድቅም ጨለማ ይሰደዳሉ።\n"));

        return new Chapter(8, verses);
    }

    private Chapter chapterNine() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ ነገር ግን ተጨንቃ ለነበረች ጨለማ አይሆንም። በመጀመሪያው ዘመን የዛብሎንንና የንፍታሌምን ምድር አቃለለ፤ በኋለኛው ዘመን ግን በዮርዳኖስ ማዶ በባሕር መንገድ ያለውን የአሕዛብን ገሊላ ያከብራል።\n" +
                "2 ፤ በጨለማ የሄደ ሕዝብ ብርሃን አየ፤ በሞት ጥላ አገርም ለኖሩ ብርሃን ወጣላቸው።\n" +
                "3 ፤ ሕዝብን አብዝተሃል፥ ደስታንም ጨምረህላቸዋል፤ በመከር ደስ እንደሚላቸው፥ ሰዎችም ምርኮን ሲካፈሉ ደስ እንደሚላቸው በፊትህ ደስ ይላቸዋል።\n" +
                "4 ፤ በምድያም ጊዜ እንደ ሆነ የሸክሙን ቀንበር የጫንቃውንም በትር የአስጨናቂውንም ዘንግ ሰብረሃል።\n" +
                "5 ፤ የሚረግጡ የሰልፈኞች ጫማ ሁሉ፥ በደምም የተለወሰ ልብስ ለቃጠሎ ይሆናል፥ እንደ እሳት ማቃጠያም ሆኖ ይቃጠላል።\n" +
                "6 ፤ ሕፃን ተወልዶልናልና፥ ወንድ ልጅም ተሰጥቶናልና፤ አለቅነትም በጫንቃው ላይ ይሆናል፤ ስሙም ድንቅ መካር፥ ኃያል አምላክ፥ የዘላለም አባት፥ የሰላም አለቃ ተብሎ ይጠራል።\n" +
                "7 ፤ ከዛሬ ጀምሮ እስከ ዘላለም ድረስ በፍርድና በጽድቅ ያጸናውና ይደግፈው ዘንድ በዳዊት ዙፋንና በመንግሥቱ ላይ አለቅነቱ ይበዛል፥ ለሰላሙም ፍፃሜ የለውም። የእግዚአብሔር ቅንዓት ይህን ያደርጋል።\n" +
                "8 ፤ ጌታ በያዕቆብ ላይ ቃልን ሰደደ፥ በእስራኤልም ላይ ወደቀ።\n" +
                "9 ፤\n" +
                "10 ፤ በትዕቢትና በልብ ኵራት። ጡቡ ወድቆአል፥ ነገር ግን በተወቀረ ድንጋይ እንሠራለን፤ የሾላ ዛፎች ተቈርጠዋል፥ ነገር ግን ዝግባን እንተካባቸዋለን የሚሉ በኤፍሬምና በሰማርያ የሚኖሩ ሕዝብ ሁሉ ያውቃሉ።\n" +
                "11 ፤ ስለዚህ እግዚአብሔር በጽዮን ተራራ ላይ ተቋቋሚ ያስነሣበታል፥\n" +
                "12 ፤ ጠላቶቹን ሶርያውያንንም ከምሥራቅ፥ ፍልስጥኤማውያንንም ከምዕራብ ያንቀሳቅስበታል፤ እስራኤልንም በተከፈተ አፍ ይበሉታል። በዚህም ሁሉ እንኳ ቍጣው አልተመለሰችም፥ ነገር ግን እጁ ገና ተዘርግታ ትኖራለች።\n" +
                "13 ፤ ሕዝቡ ግን ወደ ቀሠፋቸው አልተመለሱም፥ የሠራዊትንም ጌታ እግዚአብሔርን አልፈለጉም።\n" +
                "14 ፤ ስለዚህ እግዚአብሔር ራስና ጅራትን፥ የሰሌኑን ቅርንጫፍና እንግጫውን በአንድ ቀን ከእስራኤል ይቆርጣል።\n" +
                "15 ፤ ሽማግሌውና ከበርቴው እርሱ ራስ ነው፤ በሐሰትም የሚያስተምር ነቢይ እርሱ ጅራት ነው።\n" +
                "16 ፤ ይህን ሕዝብ የሚመሩ ያስቱአቸዋል፤ ተመሪዎቹም ይጠፋሉ።\n" +
                "17 ፤ ሰው ሁሉ ዝንጉና ክፉ ሠሪ ነውና፥ አፍም ሁሉ ስንፍናን ይናገራልና ስለዚህ ጌታ በጕልማሶቻቸው ደስ አይለውም፥ ለድሀ አደጎቻቸውና ለመበለቶቻቸውም አይራራም። በዚህም ሁሉ እንኳ ቍጣው አልተመለሰችም፥ ነገር ግን እጁ ገና ተዘርግታ ትኖራለች።\n" +
                "18 ፤ ክፋት እንደ እሳት ይቃጠላል፤ ኵርንችቱንና እሾሁን ይበላል፤ ጭፍቅ የሆነውንም ዱር ያቃጥላል፥ ጢሱም ተትጐልጕሎ እንደ ዓምድ ይወጣል።\n" +
                "19 ፤ በሠራዊት ጌታ በእግዚአብሔር ቍጣ ምድር ተቃጥላለች፤ ሕዝቡም እሳት እንደሚበላው እንጨት ሆኖአል፤ ሰውም ለወንድሙ አይራራም።\n" +
                "20 ፤ ሰው በቀኙ በኩል ይነቅላል ይራብማል፤ በግራም በኩል ይበላል አይጠግብምም፤ እያንዳንዱም የክንዱን ሥጋ ይበላል፤\n" +
                "21 ፤ ምናሴ ኤፍሬምን ኤፍሬምም ምናሴን ይበላል፤ እነርሱ በአንድነት የይሁዳ ጠላቶች ይሆናሉ። በዚህም ሁሉ እንኳ ቍጣው አልተመለሰችም፥ ነገር ግን እጁ ገና ተዘርግታ ትኖራለች።\n"));

        return new Chapter(9, verses);
    }

    private Chapter chapterTen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ 2 ፤ መበለቶችም ቅሚያቸው እንዲሆኑ፥ ድሀ አደጎችንም ብዝበዛቸው እንዲያደርጉ፥ የድሀውን ፍርድ ያጣምሙ ዘንድ፥ የችግረኛውንም ሕዝቤን ፍርድ ያጐድሉ ዘንድ የግፍን ትእዛዛት ለሚያዝዙ፥ ክፉንም ጽሕፈት ለሚጽፉ ወዮላቸው!\n" +
                "3 ፤ በተጎበኛችሁበት ቀን፥ መከራም ከሩቅ በሚመጣበት ዘመን ምን ታደርጉ ይሆን? ለረድኤትስ ወደ ማን ትሸሻላችሁ? ክብራችሁንስ ወዴት ትተዉታላችሁ?\n" +
                "4 ፤ ከእስረኞች በታች ይጐነበሳሉ፥ ከተገደሉትም በታች ይወድቃሉ። በዚህም ሁሉ እንኳ ቍጣው አልተመለሰችም፥ ነገር ግን እጁ ገና ተዘርግታ ትኖራለች።\n" +
                "5 ፤ ለቍጣዬ በትር ለሆነ፥ የመዓቴም ጨንገር በእጁ ላለ ለአሦር ወዮለት!\n" +
                "6 ፤ እርሱንም በዝንጉ ሕዝብ ላይ እልካለሁ፥ ምርኮውንና ብዝበዛውንም ይወስድ ዘንድ እንደ አደባባይም ጭቃ የተረገጡ ያደርጋቸው ዘንድ በምቈጣቸው ሰዎች ላይ አዝዘዋለሁ።\n" +
                "7 ፤ እርሱ እንዲሁ አያስብም፥ በልቡም እንዲህ አይመስለውም፤ ነገር ግን ማጥፋት፥ ጥቂት ያይደሉትንም አሕዛብን መቍረጥ በልቡ አለ።\n" +
                "8 ፤ እንዲህ ይላል። መሳፍንቴ ሁሉ ነገሥታት አይደሉምን? ካልኖ እንደ ከርከሚሽ አይደለችምን?\n" +
                "9 ፤ ሐማትስ እንደ አርፋድ አይደለችምን? ሰማርያስ እንደ ደማስቆ አይደለችምን?\n" +
                "10 ፤ የተቀረጹ ምስሎቻቸው ከኢየሩሳሌምና ከሰማርያ ምስሎች የበለጡትን የጣዖቶችን መንግሥታት እጄ እንዳገኘች፥\n" +
                "11 ፤ በሰማርያና በጣዖቶችዋም እንዳደረግሁ፥ እንዲሁስ በኢየሩሳሌምና በጣዖቶችዋ አላደርግምን?\n" +
                "12 ፤ ስለዚህ እንዲህ ይሆናል፤ ጌታ ሥራውን ሁሉ በጽዮን ተራራና በኢየሩሳሌም ላይ በፈጸመ ጊዜ የአሦርን ንጉሥ የኩሩ ልብ ፍሬን የዓይኑንም ከፍታ ትምክሕት ይጐበኛል።\n" +
                "13 ፤ እርሱ እንዲህ ብሎአልና። አስተዋይ ነኝና በእጄ ኃይልና በጥበቤ አደረግሁት፤ የአሕዛብን ድንበሮች አራቅሁ፥ ሀብታቸውንም ዘረፍሁ፥ እንደ ጀግናም ሆኜ በምድር የተቀመጡትን አዋረድሁ፤\n" +
                "14 ፤ እጄም የአሕዛብን ኃይል እንደ ወፍ ቤት አገኘች፤ የተተወም እንቍላል እንደሚሰበሰብ እንዲሁ እኔ ምድርን ሁሉ ሰበሰብሁ፤ ክንፉን የሚያራግብ አፉንም የሚከፍት የሚጮኽም የለም።\n" +
                "15 ፤ በውኑ መጥረቢያ በሚቈርጥበት ሰው ላይ ይመካልን? ወይስ መጋዝ በሚስበው ላይ ይጓደዳልን? ይህስ፥ በትር የሚያነሣውን እንደ መነቅነቅ ዘንግም እንጨት ያይደለውን እንደ ማንሣት ያህል ነው።\n" +
                "16 ፤ ስለዚህም የሠራዊት ጌታ እግዚአብሔር በወፍራሞች ላይ ክሳትን ይልካል፤ ከክብሩም በታች ቃጠሎው እንደ እሳት መቃጠል ይነድዳል።\n" +
                "17 ፤ የእስራኤልም ብርሃን እንደ እሳት ቅዱስም እንደ ነበልባል ይሆናል፤ እሾሁንና ኵርንችቱን በአንድ ቀን ያቃጥላል ይበላውማል።\n" +
                "18 ፤ ከነፍስም እስከ ሥጋ ድረስ የዱሩንና የሚያፈራውን እርሻ ክብር ይበላል፤ ይህም የታመመ ሰው እንደሚሰለስል ይሆናል።\n" +
                "19 ፤ የቀሩትም የዱር ዛፎች በቍጥር ጥቂት ይሆናሉ፥ ታናሽ ብላቴናም ይጽፋቸው ዘንድ ይችላል። v\n" +
                "20 ፤ በዚያም ቀን እንዲህ ይሆናል፤ የእስራኤል ቅሬታ ከያዕቆብም ቤት የዳኑት ከእንግዲህ ወዲህ በመቱአቸው ላይ አይደገፉም፤ ነገር ግን በእስራኤል ቅዱስ በእግዚአብሔር ላይ በእውነት ይደገፋሉ።\n" +
                "21 ፤ የያዕቆብም ቅሬታ ወደ ኃያል አምላክ ይምለሳሉ።\n" +
                "22 ፤ እስራኤል ሆይ፥ የሕዝብህ ቍጥር እንደ ባሕር አሸዋ ቢሆን ቅሬታው ይመለሳል። ጽድቅ የተትረፈረፈበትም ጥፋት ተወስኖአል።\n" +
                "23 ፤ የሠራዊት ጌታ እግዚአብሔርም ያለቀ የተቈረጠ ነገርን በምድር ሁሉ መካከል ይፈጽማል።\n" +
                "24 ፤ ስለዚህ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። በጽዮን የምትኖር ሕዝቤ ሆይ፥ አሦር በበትር ቢመታህ፥ ግብጽም እንዳደረገ ዘንጉን ቢያነሣብህ አትፍራው።\n" +
                "25 ፤ ቍጣዬ እስኪፈጸም መዓቴም እስኪያጠፋቸው ድረስ ጥቂት ጊዜ ቀርቶአልና።\n" +
                "26 ፤ የሠራዊት ጌታ እግዚአብሔርም ምድያምን በሔሬብ ዓለት በኩል እንደ መታው ጅራፍ ያነሣበታል፤ በትሩም በባሕር ላይ ይሆናል፥ በግብጽም እንዳደረገ ያነሣዋል።\n" +
                "27 ፤ በዚያም ቀን ሸክሙ ከጫንቃህ ቀንበሩም ከአንገትህ ላይ ይወርዳል፤ ቀንበሩም ከውፍረት የተነሣ ይሰበራል።\n" +
                "28 ፤ ወደ አንጋይ መጥቶአል፤ በመጌዶን በኩል አልፎአል፤ በማክማስ ውስጥ ዕቃውን አኑሮአል፤\n" +
                "29 ፤ በመተላለፊያ አልፎአል፤ በጌባ ማደሪያው ነው፤ ራማ ደንግጣለች፤ የሳኦል ጊብዓ ኰብልላለች።\n" +
                "30 ፤ አንቺ የጋሊም ልጅ ሆይ፥ በታላቅ ድምፅሽ ጩኺ፤ ላይሳ ሆይ፥ አድምጪ፤ ዓናቶት ሆይ፥ መልሽላት።\n" +
                "31 ፤ መደቤና ሸሽታለች፤ በግቤርም የሚኖሩ ቤተ ሰቦቻቸውን አሽሽተዋል።\n" +
                "32 ፤ ዛሬ በኖብ ይቆማል፤ በጽዮን ሴት ልጅ ተራራ በኢየሩሳሌም ኮረብታ ላይ እጁን ያንቀሳቅሳል።\n" +
                "33 ፤ እነሆ፥ የሠራዊት ጌታ እግዚአብሔር ቅርንጫፎቹን በሚያስፈራ ኃይል ይቈርጣል፤ በቁመት የረዘሙትም ይቈረጣሉ፥ ከፍ ያሉትም ይዋረዳሉ።\n" +
                "34 ፤ ጭፍቅ የሆነውንም ዱር በብረት ይቈርጣል፥ ሊባኖስም በኃያሉ እጅ ይወድቃል።\n"));

        return new Chapter(10, verses);
    }
    private Chapter chapterEleven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ከእሴይ ግንድ በትር ይወጣል፥ ከሥሩም ቍጥቋጥ ያፈራል።\n" +
                "2 ፤ የእግዚአብሔር መንፈስ፥ የጥበብና የማስተዋል መንፈስ፥ የምክርና የኃይል መንፈስ፥ የእውቀትና እግዚአብሔርን የመፍራት መንፈስ ያርፍበታል።\n" +
                "3 ፤ እግዚአብሔርን በመፍራት ደስታውን ያያል። ዓይኑም እንደምታይ አይፈርድም፥ ጆሮውም እንደምትሰማ አይበይንም፤\n" +
                "4 ፤ ነገር ግን ለድሆች በጽድቅ ይፈርዳል፥ ለምድርም የዋሆች በቅንነት ይበይናል፤ በአፉም በትር ምድርን ይመታል፥ በከንፈሩም እስትንፋስ ክፉዎችን ይገድላል።\n" +
                "5 ፤ የወገቡ መታጠቂያ ጽድቅ፥ የጎኑም መቀነት ታማኝነት ይሆናል።\n" +
                "6 ፤ ተኵላ ከበግ ጠቦት ጋር ይቀመጣል፥ ነብርም ከፍየል ጠቦት ጋር ይተኛል፤ ጥጃና የአንበሳ ደቦል ፍሪዳም በአንድነት ያርፋሉ፤ ታናሽም ልጅ ይመራቸዋል።\n" +
                "7 ፤ ላምና ድብ አብረው ይሰማራሉ፥ ግልገሎቻቸውም በአንድነት ያርፋሉ፤ አንበሳም እንደ በሬ ገለባ ይበላል።\n" +
                "8 የሚጠባውም ሕፃን በእባብ ጕድጓድ ላይ ይጫወታል፥ ጡት የጣለውም ሕፃን በእፉኝት ቤት ላይ እጁን ይጭናል።\n" +
                "9 በተቀደሰው ተራራዬ ሁሉ ላይ አይጐዱም አያጠፉምም፤ ውኃ ባሕርን እንደሚከድን ምድር እግዚአብሔርን በማወቅ ትሞላለችና።\n" +
                "10 በዚያም ቀን እንዲህ ይሆናል፤ ለአሕዛብ ምልክት ሊሆን የቆመውን የእሴይን ሥር አሕዛብ ይፈልጉታል፤ ማረፊያውም የተከበረ ይሆናል።\n" +
                "11 በዚያም ቀን እንዲህ ይሆናል፤ የቀረውን የሕዝቡን ቅሬታ ከአሦርና ከግብጽ፥ ከጳትሮስና ከኢትዮጵያ፥ ከኤላምና ከሰናዖር ከሐማትም፥ ከባሕርም ደሴቶች ይመልስ ዘንድ ጌታ እንደ ገና እጁን ይገልጣል።\n" +
                "12 ለአሕዛብም ምልክትን ያቆማል፥ ከእስራኤልም የተጣሉትን ይሰበስባል፥ ከይሁዳም የተበተኑትን ከአራቱ የምድር ማዕዘኖች ያከማቻል።\n" +
                "13 የኤፍሬምም ምቀኝነት ይርቃል፥ ይሁዳንም የሚያስጨንቁ ይጠፋሉ፤ ኤፍሬምም በይሁዳ አይቀናም፥ ይሁዳም ኤፍሬምን አያስጨንቅም።\n" +
                "14 በምዕራብም በኩል በፍልስጥኤማውያን ጫንቃ ላይ እየበረሩ ይወርዳሉ፥ የምሥራቅንም ልጆች በአንድነት ይበዘብዛሉ፤ በኤዶምያስና በሞዓብም ላይ እጃቸውን ይዘረጋሉ፥ የአሞንም ልጆች ለእነርሱ ይታዘዛሉ።\n" +
                "15 እግዚአብሔርም የግብጽን ባሕር ያጠፋል፤ በትኩሱም ነፋስ እጁን በወንዙ ላይ ያነሣል፥ ሰባት ፈሳሾችንም አድርጎ ይመታዋል፥ ሰዎችም በጫማቸው እንዲሻገሩ ያደርጋቸዋል።\n" +
                "16 ከግብጽም በወጣ ጊዜ ለእስራኤል እንደ ነበረ፥ ለቀረው ለሕዝቡ ቅሬታ ከአሦር ጐዳና ይሆናል።\n"));
        // Add more verses as needed
        return new Chapter(11, verses);
    }

    private Chapter chapterTwelve() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በዚያም ቀን። አቤቱ፥ ተቈጥተኸኛልና፥ ቍጣህንም ከእኔ መልሰሃልና፥ አጽናንተኸኛልምና አመሰግንሃለሁ።\n" +
                "2 ፤ እነሆ፥ አምላክ መድኃኒቴ ነው፤ ጌታ እግዚአብሔር ኃይሌና ዝማሬዬ ነውና፥ መድኃኒቴም ሆኖአልና በእርሱ ታምኜ አልፈራም ትላለህ።\n" +
                "3 ፤ ውኃውንም ከመድኃኒት ምንጮች በደስታ ትቀዳላችሁ።\n" +
                "4 ፤ በዚያም ቀን እንዲህ ትላላችሁ። እግዚአብሔርን አመስግኑ፥ ስሙንም ጥሩ፤ በአሕዛብ መካከል ሥራውን አስታውቁ፤ ስሙ ከፍ ያለ እንደ ሆነ ተናገሩ።\n" +
                "5 ፤ ታላቅ ሥራ ሠርቶአልና ለእግዚአብሔር ተቀኙ፤ ይህንም በምድር ሁሉ ላይ አስታውቁ።\n" +
                "6 ፤ አንቺ በጽዮን የምትኖሪ ሆይ፥ የእስራኤል ቅዱስ በመካከልሽ ከፍ ከፍ ብሎአልና ደስ ይበልሽ እልልም በዪ።\n" ));
        // Add more verses as needed
        return new Chapter(12, verses);
    }

    private Chapter chapterThirteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("13", "1 ፤ የአሞጽ ልጅ ኢሳይያስ ያየው ስለ ባቢሎን የተንገረ ሸክም።\n" +
                "2 ፤ ምድረ በዳ በሆነ ተራራ ላይ ምልክትን አቁሙ፥ ድምፅንም ከፍ አድርጉባቸው፤ በአለቆችም ደጆች እንዲገቡ በእጅ ጥቀሱ።\n" +
                "3 ፤ ቍጣዬን ይፈጽሙ ዘንድ ቅዱሳኔን አዝዣለሁ፥ እኔ ኃያላኔንና በታላቅነቴ ደስ የሚላቸውን ጠርቻለሁ።\n" +
                "4 ፤ በተራሮች ላይ እንደ ታላቅ ሕዝብ ድምፅ የሆነ የብዙ ሰው ድምፅ አለ። የከተማቹት የአህዛብ መንግሥታት የውካታ ጫጫታ አለ። የሠራዊት ጌታ እግዚአብሔር ሠራዊትን ለሰልፍ አሰልፎአል።\n" +
                "5 ፤ እግዚአብሔርና የቍጣው የጦር ዕቃ ምድርን ሁሉ ያጠፉአት ዘንድ ከሩቅ አገር ከሰማይ ዳርቻ ይመጣሉ።\n" +
                "6 ፤ የእግዚአብሔር ቀን ቀርቦአልና፥ አልቅሱ፤ ሁሉን ከሚችል አምላክ ዘንድ እንደሚመጣ ጥፋት ይመጣል።\n" +
                "7 ፤ ስለዚህ እጅ ሁሉ ትዝላለች፥ የሰውም ሁሉ ልብ ይቀልጣል።\n" +
                "8 ፤ ይደነግጣሉ፤ ምጥና ሕማም ይይዛቸዋል፥ እንደምትወልድ ሴትም ያምጣሉ፤ አንዱም በሌላው ይደነቃል፥ ፊታቸውም የነበልባል ፊት ነው።\n" +
                "9 ፤ እነሆ፥ ምድሪቱን ባድማ ሊያደርግ፥ ኃጢአተኞችዋንም ከእርስዋ ዘንድ ሊያጠፋ ጨካኝ ሆኖ በመዓትና በጽኑ ቍጣ ተሞልቶ የእግዚአብሔር ቀን ይመጣል።\n" +
                "10 ፤ የሰማይም ከዋክብትና ሠራዊቱ ብርሃናቸውን አይሰጡም፥ ፀሐይም በወጣች ጊዜ ትጨልማለች፥ ጨረቃም በብርሃኑ አያበራም።\n" +
                "11 ፤ ዓለሙን ስለ ክፋታቸው ክፉዎቹንም ስለ በደላቸው እቀጣለሁ፤ የትዕቢተኞችንም ኵራት አዋርዳለሁ።\n" +
                "12 ፤ የቀሩትም ከጥሩ ወርቅ ይልቅ የከበሩ ይሆናሉ፥ ሰውም ከኦፊር ወርቅ ይልቅ የከበረ ይሆናል።\n" +
                "13 ፤ ስለዚህ በሠራዊት ጌታ በእግዚአብሔር መዓት በጽኑ ቍጣ ቀንም ሰማያትን አነቃንቃለሁ፥ ምድርም ከስፍራዋ ትናወጣለች።\n" +
                "14 ፤ እንደ ተባረረም ሚዳቋ፥ ማንም እንደማይሰበስበው እንደ በግ መንጋ፥ ሰው ሁሉ ወደ ወገኑ ይመለሳል፥ ሁሉም ወደ አገሩ ይሸሻል።\n" +
                "15 ፤ የተገኘ ሁሉ የተወጋ ይሆናል፥ የተያዘም ሁሉ በሰይፍ ይወድቃል።\n" +
                "16 ፤ ሕፃናቶቻቸውም በፊታቸው ይጨፈጨፋሉ፥ ቤቶቻቸውም ይበዘበዛሉ፥ ሚስቶቻቸውም ይነወራሉ።\n" +
                "17 ፤ እነሆ፥ ብር የማይሹትን፥ ወርቅም የማያምራቸውን ሜዶናውያንን በላያቸው አስነሣለሁ።\n" +
                "18 ፤ ፍላጾቻቸውም ጎበዞችን ይጨፈጭፋሉ፥ የማኅፀንንም ፍሬ አይምሩም፥ ዓይኖቻቸውም ለሕፃናት አይራሩም።\n" +
                "19 ፤ እግዚአብሔርም ሰዶምንና ገሞራን ባፈረሰ ጊዜ እንደ ነበረው፥ የመንግሥታት ክብር የከለዳውያንም ትዕቢት ጌጥ ባቢሎን እንዲሁ ትሆናለች።\n" +
                "20 ፤ ለዘላለም የሚቀመጥባት አይገኝም፥ ከትውልድ እስከ ትውልድ ድረስ ሰው አይኖርባትም፤ ዓረባውያንም ድንኳንን በዚያ አይተክሉም፥ እረኞችም መንጎቻቸውን በዚያ አያሳርፉም።\n" +
                "21 ፤ በዚያም የምድረ በዳ አራዊት ያርፋሉ፥ ጕጕቶችም በቤቶቻቸው ይሞላሉ፤ ሰጎኖችም በዚያ ይኖራሉ፥ በዚያም አጋንንት ይዘፍናሉ።\n" +
                "22 ፤ ተኵላዎችም በግንቦቻቸው፥ ቀበሮችም በሚያማምሩ አዳራሾቻቸው ይጮኻሉ፤ ጊዜዋም ለመምጣት ቀርቦአል ቀንዋም አይዘገይም።\n"));
        // Add more verses as needed
        return new Chapter(3, verses);
    }

    private Chapter chapterFourteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እግዚአብሔርም ያዕቆብን ይምረዋል፥ እስራኤልንም ደግሞ ይመርጠዋል፥ በአገራቸውም ያኖራቸዋል፤ መጻተኛም ከእርሱ ጋር ይተባበራል፥ ከያዕቆብም ቤት ጋር ይጣበቃል።\n" +
                "2 ፤ አሕዛብም ይዘው ወደ ስፍራቸው ያመጡአቸዋል፥ የእስራኤልም ቤት በእግዚአብሔር ምድር እንደ ሎሌዎችና እንደ ገረዶች አድርገው ይገዙአቸዋል፤ የማረኩአቸውን ይማርካሉ፥ አስጨናቂዎችንም ይገዛሉ።\n" +
                "3 ፤ በዚያም ቀን እንዲህ ይሆናል፤ እግዚአብሔር ከኀዘንህና ከመከራህ ከተገዛህለትም ከጽኑ ባርነት ያሳርፍሃል።\n" +
                "4 ፤ ይህንም ምሳሌ በባቢሎን ንጉሥ ላይ ታነሣለህ እንዲህም ትላለህ። አስጨናቂ እንዴት ዐረፈ! አስገባሪም እንዴት ጸጥ አለ!\n" +
                "5 ፤\n" +
                "6 ፤ አሕዛብንም በመዓትና በማያቋርጥ መምታት የመታውን፥ አሕዛብንም ባልተከለከለ መከራ በቍጣው የገዛውን የኀጥኣንን በትር የአለቆችንም ዘንግ እግዚአብሔር ሰብሮአል።\n" +
                "7 ፤ ምድርም ሁሉ ዐርፋ በጸጥታ ተቀምጣለች እልልም ብላለች።\n" +
                "8 ፤ ጥድና የሊባኖስ ዝግባ። አንተ ከተዋረድህ ጀምሮ ማንም ይቈርጠን ዘንድ አልወጣብንም ብለው በአንተ ደስ አላቸው።\n" +
                "9 ፤ ሲኦል በመምጣትህ ልትገናኝህ በታች ታወከች፤ የሞቱትንም፥ የምድርን ታላላቆች ሁሉ፥ ለአንተ አንቀሳቀሰች፥ የአሕዛብንም ነገሥታት ሁሉ ከዙፋኖቻቸው አስነሣች።\n" +
                "10 ፤ እነዚህ ሁሉ። አንተ ደግሞ እንደ እኛ ደክመሃልን? እኛንስ መስለሃልን? ጌጥህና የበገናህ ድምፅ ወደ ሲኦል ወረደ፤\n" +
                "11 ፤ በበታችህም ብል ተነጥፎአል፥ ትልም መደረቢያህ ሆኖአል ብለው ይመልሱልሃል።\n" +
                "12 ፤ አንተ የንጋት ልጅ አጥቢያ ኮከብ ሆይ፥ እንዴት ከሰማይ ወደቅህ! አሕዛብንም ያዋረድህ አንተ ሆይ፥ እንዴት እስከ ምድር ድረስ ተቈረጥህ!\n" +
                "13 ፤ አንተን በልብህ። ወደ ሰምይ ዐርጋለሁ፥ ዙፋኔንም ከእግዚአብሔር ከዋክብት በላይ ከፍ ከፍ አደርጋለሁ፥ በሰሜንም ዳርቻ በመሰብሰቢያ ተራራ ላይ እቀመጣለሁ፤\n" +
                "14 ፤ ከዳመናዎች ከፍታ በላይ ዐርጋለሁ፥ በልዑልም እመሰላለሁ አልህ።\n" +
                "15 ፤ ነገር ግን ወደ ሲኦል ወደ ጕድጓዱም ጥልቅ ትወርዳለህ።\n" +
                "16 ፤ የሚያዩህ ይመለከቱሃልና። በውኑ ምድርን ያንቀጠቀጠ፥ መንግሥታትንም ያናወጠ፥\n" +
                "17 ፤ ዓለሙን ሁሉ ባድማ ያደረገ፥ ከተሞችንም ያፈረሰ ምርከኞቹንም ወደ ቤታቸው ያልሰደደ ሰው ይህ ነውን? ብለው ያስተውሉሃል።\n" +
                "18 ፤ የአሕዛብ ነገሥታት ሁሉ በየቤታቸው በክብር አንቀላፍተዋል።\n" +
                "19 ፤ አንተ ግን እንደ ተጠላ ቅርንጫፍ ከመቃብርህ ተጥለሃል፤ በሰይፍም የተወጉት፥ ተገድለውም ወደ ጕድጓዱ ድንጋዮች የወረዱት ከድነውሃል፤ እንደ ተረገጠም ሬሳ ሆነሃል።\n" +
                "20 ፤ ምድርህን አጥፍተሃልና፥ ሕዝብህንም ገድለሃልና ከእነርሱ ጋር በመቃብር በአንድነት አትሆንም፤ የክፉዎች ዘር ለዘላለም የተጠራ አይሆንም።\n" +
                "21 ፤ እንዳይነሡም፥ ምድርንም እንዳይወርሱ፥ የዓለሙንም ፊት በከተሞች እንዳይሞሉ ስለ አባቶቻቸው በደል ለልጆቹ ሞትን አዘጋጁላቸው።\n" +
                "22 ፤ በእነርሱ ላይ እነሣለሁ ይላል የሠራዊት ጌታ እግዚአብሔር፤ ከባቢሎን ስምንና ቅሬታን፥ ዘርንና ትውልድንም እቈርጣለሁ ይላል እግዚአብሔር።\n" +
                "23 ፤ የጃርት መኖርያ የውኃም መቋሚያ አደርጋታለሁ፤ በጥፋትም መጥረጊያ እጠርጋታለሁ ይላል የሠራዊት ጌታ እግዚአብሔር።\n" +
                "24 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ብሎ ምሎአል። እንደ ተናገርሁ በእርግጥ ይሆናል፥ እንደ አሰብሁም እንዲሁ ይቆማል።\n" +
                "25 ፤ አሦርን በምድሬ ላይ እሰብረዋለሁ፥ በተራራዬም ላይ እረግጠዋለሁ፤ ቀንበሩም ከእነርሱ ላይ ይነሣል፥ ሸክሙም ከጫንቃቸው ላይ ይወገዳል።\n" +
                "26 ፤ በምድር ሁሉ ላይ እግዚአብሔር ያሰበው አሳብ ይህ ነው፥ በአሕዛብም ሁሉ ላይ የተዘረጋች እጅ ይህች ናት።\n" +
                "27 ፤ የሠራዊት ጌታ እግዚአብሔር ይህን አስቦአል፤ የሚያስጥለውስ ማን ነው? እጁም ተዘርግታለች፤ የሚመልሳትስ ማን ነው?\n" +
                "28 ፤ ንጉሡ አካዝ በሞተበት ዓመት ይህ ሸክም ሆነ።\n" +
                "29 ፤ ፍልስጥኤም ሆይ፥ ከእባቡ ሥር እፉኝት ይወጣልና፥ ፍሬውም የሚበርርና እሳት የሚመስል እባብ ይሆናልና የመታሽ በትር ስለ ተሰበረ ሁላችሁም ደስ አይበላችሁ።\n" +
                "30 ፤ የድሆችም የበኵር ልጆች ይሰማራሉ፥ ችግረኞችም ተዘልለው ይተኛሉ፤ ሥርህንም በራብ እገድላለሁ፥ ቅሬታህም ይገደላል።\n" +
                "31 ፤ አንተ በር ሆይ፥ ወዮ በል አንቺም ከተማ ሆይ፥ ጩኺ፤ ፍልስጥኤም ሆይ፥ ሁላችሁም ቀልጣችኋል፤ ጢስ ከሰሜን ይመጣል ከጭፍራውም ተለይቶ የሚቀር የለም።\n" +
                "32 ፤ ለሕዝቡም መልእክተኞች ምን ብሎ መመለስ ይገባል? እግዚአብሔር ጽዮንን እንደ መሠረተ፥ የሕዝቡም ችግረኞች በእርስዋ ውስጥ እንደሚጠጉ ነው።\n"));
        // Add more verses as needed
        return new Chapter(14, verses);
    }
    private Chapter chapterFifteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ስለ ሞዓብ የተነገረ ሸክም። የሞዓብ ዔር በሌሊት ፈርሶ ጠፋ፤ ቂር የሚባልም የሞዓብ ምሽግ በሌሊት ፈርሶ ጠፋ።\n" +
                "2 ፤ ወደ ባይት ወደ ዲቦንም ወደ ኮረብታ መስገጃዎችም ለልቅሶ ወጥተዋል፤ ሞዓብ በናባው በሜድባ ላይ ታለቅሳለች፤ ራሳቸው ሁሉ ተነጭቶአል፥ ጢማቸውም ሁሉ ተላጭቶአል።\n" +
                "3 ፤ በየመገዳቸውም በማቅ ታጥቀዋል፤ በየሰገነቶቻቸውና በየአደባባዮቻቸው እንባ እጅግ እያፈሰሱ ሁሉም አልቅሰዋል።\n" +
                "4 ፤ ሐሴቦንና ኤልያሊ ጮኹ፤ ድምፃቸው እስከ ያሀጽ ድረስ ይሰማል፤ ስለዚህ የሞዓብ ሰልፈኞች ጮኹ፤ ነፍስዋ በውስጥዋ ተንቀጠቀጠች።\n" +
                "5 ፤ ልቤ ስለ ሞዓብ ጮኸ፤ ከእርስዋም የሚሸሹ ወደ ዞዓር ወደ ዔግላት ሺሊሺያ ኰበለሉ፤ በሉሒት ዓቀበት ላይ እያለቀሱ ይወጣሉ፥ በሖሮናይምም መንገድ የዋይታ ጩኸት ያነሣሉ።\n" +
                "6 ፤ የኔምሬም ውኆች ይደርቃሉ፤ ሣሩም ደርቋል፥ ለጋውም ጠውልጓል፥ ልምላሜውም ሁሉ የለም።\n" +
                "7 ፤ ስለዚህ የሰበሰቡትን ሀብትና መዝገባቸውን ወደ አኻያ ዛፍ ወንዝ ማዶ ይወስዱታል።\n" +
                "8 ፤ ጩኸት የሞዓብን ዳርቻ ሁሉ ዞረ፤ ልቅሶዋም ወደ ኤግላይምና ወደ ብኤርኢሊም ደረሰ።\n" +
                "9 ፤ የዲሞንም ውኃ ደም ተሞልታለች፤ በዲሞንም ላይ ሥቃይን እጨምራለሁ፥ ከሞዓባውያንም በሚያመልጡ፥ ከምድርም በሚቀሩ ላይ አንበሳን አመጣለሁ።\n"));

        return new Chapter(15, verses);
    }

    private Chapter chapterSixteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በምድርም ላይ ለሠለጠነው አለቃ የበግ ጠቦቶችን በምድረ በዳ ካለችው ከሴላ ወደ ጽዮን ሴት ልጅ ተራራ ስደዱ።\n" +
                "2 ፤ እንደሚበርር ወፍ እንደ ተበተኑም ጫጩቶች እንዲሁ የሞዓብ ሴቶች ልጆች በአርኖን መሻገሪያዎች ይሆናሉ።\n" +
                "3 ፤ ምክርን ምከሪ፥ ፍርድን አድርጊ፥ በቀትር ጊዜ ጥላሽን እንደ ሌሊት አድርጊ፤ የተሰደዱትን ሸሽጊ፥ የሸሹትን አትግለጪ።\n" +
                "4 ፤ ከሞዓብ የተሰደዱት ከአንቺ ጋር ይቀመጡ፤ ከሚያጠፋቸው ፊት መጋረጃ ሁኛቸው። የሚያስጨንቁ አልቀዋል፥ ጥፋትም ቀርቶአል፤ ይጨቍኑ የነበሩ ከምድር ጠፍተዋል።\n" +
                "5 ፤ ዙፋንም በምሕረት ይቀናል፥ በዚያም ላይ በዳዊት ድንኳን ፍርድን የሚሻ ጽድቅንም የሚያፈጥን ፈራጅ በእውነት ይቀመጣል\n" +
                "6 ፤ ስለ ሞዓብ ትዕቢት እጅግ ስለ መታበዩ፥ ስለ ኵራቱና ስለ ትዕቢቱ ስለ ቍጣውም ሰምተናል፤ ትምሕክቱ ከንቱ ነው።\n" +
                "7 ፤ ስለዚህ ሞዓብ ስለ ሞዓብ ዋይ ይላል፤ ሁሉም ዋይ ይላል፤ ስለ ቂርሐራሴት መሠራት በጥልቅ ኀዘን ታለቅሳላችሁ።\n" +
                "8 ፤ የሐሴቦን እርሻዎችና የሴባማ ወይን ግንዶች አዝነዋል። የአሕዛብ አለቆች የሰባበሩአቸው ቅርንጫፎች እስከ ኢያዜር ደርሰው ወደ ምድረ በዳ ወጥተው ነበር፤ ቍጥቋጦቹም ተዘርግተው ባሕርን ተሻግረው ነበር።\n" +
                "9 ፤ ስለዚህ በኢያዜር ልቅሶ ስለ ሴባማ ወይን ግንድ አለቅሳለሁ፤ ሐሴቦንና ኤልያሊ ሆይ፥ በዛፍሽ ፍሬና በወይንሽ መከር የጦር ጩኸት ወድቆአልና በእንባዬ አረካሻለሁ።\n" +
                "10 ፤ ደስታና ሐሤትም ከፍሬያማው እርሻ ተወስዶአል፥ በወይኑም ቦታዎች ዝማሬና እልልታ የለም፤ በመጥመቂያም ወይን የሚረግጥ የለም፤ የረጋጮቹን እልልታ አጥፍቻለሁ።\n" +
                "11 ፤ ስለዚህ ልቤ ስለ ሞዓብ አንጀቴም ስለ ቂርሔሬስ እንደ መሰንቆ ትጮኻለች።\n" +
                "12 ፤ ሞዓብም መጥቶ በኮረብታ መስገጃ ላይ በደከመና ለጸሎት ወደ መቅደሱ በገባ ጊዜ አያሸንፍም\n" +
                "13 ፤ እግዚአብሔር በሞዓብ ላይ በድሮ ዘመን የተናገረው ነገር ይህ ነው።\n" +
                "14 ፤ አሁን ግን እግዚአብሔር። በሦስት ዓመት ውስጥ እንደ ምንደኛ ዓመት የሞዓብ ክብርና የሕዝቡ ሁሉ ብዛት ይዋረዳል፥ ቅሬታውም እጅግ ያነሰና የተጠቃ ይሆናል ይላል።\n" ));

        return new Chapter(16, verses);
    }

    private Chapter chapterSeventeen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ስለ ደማስቆ የተነገረ ሸክም። እነሆ፥ ደማስቆ ከተማ ከመሆን ተቋርጣለች፤ ባድማና የፍርስራሽ ክምር ትሆናለች።\n" +
                "2 ፤ ከተሞችዋ ለዘላለም የተፈቱ ይሆናሉ፤ ለመንጋ ማሰማሪያ ሆናሉ፤ መንጎች በዚያ ያርፋሉ የሚያስፈራቸውም የለም።\n" +
                "3 ፤ ምሽግም ከኤፍሬም፥ መንግሥትም ከደማስቆ ተወገደች፤ የሶርያም ቅሬታ እንደ እስራኤል ልጆች ክብር ይሆናል ይላል የሠራዊት ጌታ እግዚአብሔር።\n" +
                "4 ፤ በዚያም ቀን እንዲህ ይሆናል፤ የያዕቆብ ክብር ይደክማል የሥጋውም ውፍረት ይከሳል።\n" +
                "5 ፤ አጫጅ የቆመውን እህል በእጁ ሰብስቦ ዛላውን እንደሚያጭድ ይሆናል፤ በራፋይም ሸለቆ ቃርሚያ እንደሚለቅም እንዲሁ ይሆናል።\n" +
                "6 ፤ ወይራ በተመታ ጊዜ ሁለት ወይም ሦስት ፍሬ በራሱ ላይ እንደሚቀር፥ አራት ወይም አምስት በዛፊቱ ጫፍ እንደሚገኝ፥ በእርሱ ዘንድ ቃርሚያ ይቀራል ይላል የእስራኤል አምላክ እግዚአብሔር።\n" +
                "7 ፤ በዚያ ቀን ሰው ወደ ፈጣሪው ይመለከታል፥ ዓይኖቹም ወደ እስራኤል ቅዱስ ያያሉ።\n" +
                "8 ፤ እጁም የሠራችውን መሠዊያ አይመለከትም፤ ጣቶቹም ወደ አበጁአቸው፥ ወደ ማምለኪያ ዐፀዶች ወይም ወደ ፀሐይ ምስሎች፥ አያይም።\n" +
                "9 ፤ በዚያም ቀን በእስራኤል ልጆች ፊት የአሞራውያንና የኤውያውያን ከተሞች እንደ ተፈቱ፥ እንዲሁ ከተሞችህ ይፈታሉ፥ ባድማም ይሆናሉ።\n" +
                "10 ፤ የደኅንነትህን አምላክ ረስተሃል፥ የረድኤትህንም ጌታ አላሰብህም፤ ስለዚህ ያማረውን ተክል ተክለሃል፥ እንግዳንም ዘር ዘርተሃል።\n" +
                "11 ፤ በተከልህበት ቀን ታበቅለዋለህ፥ በነጋውም ዘርህን እንዲያብብ ታደርገዋለህ፤ ነገር ግን በኀዘንና በትካዜ ቀን መከሩ ይሸሻል።\n" +
                "12 ፤ እንደ ባሕር ሞገድ ድምፅ ለሚተምሙ ለወገኖች ብዛት፥ እንደ ኃይለኛም ውኃ ጩኸት ለሚጮኹ አሕዛብ ወዮላቸው!\n" +
                "13 ፤ አሕዛብ እንደ ብዙ ውኃ ጩኸት ይጮኻሉ፤ እርሱ ግን ይገሥጻቸዋል፥ እነርሱም እየሸሹ ይርቃሉ፥ በተራራም ላይ እንዳለ እብቅ በነፋስ ፊት፥ ዐውሎ ነፋስ እንደሚያዞረው ትቢያ ይበተናሉ።\n" +
                "14 ፤ በመሸ ጊዜ፥ እነሆ፥ ድንጋጤ አለ፤ ከማለዳም በፊት አይገኙም። የዘረፉን ሰዎች እድል ፈንታ፥ የበዘበዙን ዕጣ ይህ ነው።\n"));

        return new Chapter(17, verses);
    }

    private Chapter chapterEighteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በኢትዮጵያ ወንዞች ማዶ ላለች፥ ክንፍ ያላቸው መርከቦች ላሉባት፥\n" +
                "2 ፤ መልእክተኞችን በባሕር ላይ የደንገል መርከቦችንም በውኃ ላይ ለምትልክ ምድር ወዮላት! እናንተ ፈጣኖች መልእክተኞች ሆይ፥ ወደ ረጅምና ወደ ለስላሳ ሕዝብ፥ ከመጀመሪያው አስደንጋጭ ወደ ሆነ ወገን፥ ወደሚሰፍርና ወደሚረግጥ፥ ወንዞችም ምድራቸውን ወደሚከፍሉት ሕዝብ ሂዱ።\n" +
                "3 ፤ በዓለም የምትኖሩ ሁሉና በምድር የምትቀመጡ ሆይ፥ ምልክት በተራሮች ላይ በተነሣ ጊዜ እዩ፤ መለከትም በተነፋ ጊዜ ስሙ።\n" +
                "4 ፤ እግዚአብሔር። በፀሐይ ጮራ እንደ ደረቅ ትኩሳት፥ በአጨዳም ወራት እንደ ጠል ደመና ሆኜ በማደሪያዬ በጸጥታ ተቀምጬ እመለከታለሁ ብሎኛልና።\n" +
                "5 ፤ እርሱ ከመከር በፊት አበባ በረገፈ ጊዜ የወይንም ፍሬ ጨርቋ ሲይዝ የወይኑን ዘንግ በማጭድ ይቆርጣል፥ ጫፎቹንም ይመለምላል ያስወግድማል።\n" +
                "6 ፤ በተራራ ላይ ላሉ ነጣቂዎች ወፎች፥ ለምድርም አውሬዎች በአንድነት ይቀራሉ፤ ነጣቂዎችም ወፎች ይባጁባቸዋል፥ የምድርም አውሬዎች ሁሉ ይከርሙባቸዋል።\n" +
                "7 ፤ በዚያን ዘመን ለሠራዊት ጌታ ለእግዚአብሔር፥ ከረጅምና ከለስላሳ ሕዝብ፥ ከመጀመሪያው አስደንጋጭ ከሆነ ወገን፥ ከሚሰፍርና ከሚረግጥ፥ ወንዞችም ምድራቸውን ከሚከፍሉት ሕዝብ ዘንድ እጅ መንሻ የሠራዊት ጌታ የእግዚአብሔር ስም ወደሚገኝበት ስፍራ ወደ ጽዮን ተራራ ይቀርባል።\n"));

        return new Chapter(18, verses);
    }

    private Chapter chapterNineteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ ስለ ግብጽ የተነገረ ሸክም። እነሆ፥ እግዚአብሔር በፈጣን ደመና እይበረረ ወደ ግብጽ ይመጣል፤ የግብጽም ጣዖታት በፊቱ ይርዳሉ፥ የግብጽም ልብ በውስጥዋ ይቀልጣል።\n" +
                "2 ፤ ግብጻውያንን በግብጻውያን ላይ አስነሣለሁ፤ ወንድምም ወንድሙን፥ ሰውም ባልንጀራውን፥ ከተማም ከተማን፥ መንግሥትም መንግሥትን ይወጋል።\n" +
                "3 ፤ የግብጽም መንፈስ በውስጥዋ ባዶ ይሆናል፥ ምክራቸውንም አጠፋለሁ፤ እነርሱም ጣዖቶቻቸውን በድግምት የሚጠነቍሉትንም መናፍስት ጠሪዎቻቸውንም ጠንቋዮቻቸውንም ይጠይቃሉ።\n" +
                "4 ፤ ግብጻውያንንም በጨካኝ ጌታ እጅ አሳልፌ እሰጣለሁ፤ ጨካኝ ንጉሥም ይገዛቸዋል ይላል የሠራዊት ጌታ እግዚአብሔር።\n" +
                "5 ፤ ውኆችም ከባሕር ይደርቃሉ፥ ወንዙም ያንሳል ደረቅም ይሆናል።\n" +
                "6 ፤ ወንዞቹም ይገማሉ፥ የግብጽም መስኖች ያንሳሉ ይደርቃሉም፤ ደንገልና ቄጤማ ይጠወልጋሉ።\n" +
                "7 ፤ በዓባይ ወንዝ ዳር ያለው መስክ በዓባይም ወንዝ አጠገብ የተዘራ እርሻ ሁሉ ይደርቃል፥ ይበተንማል፥ አይገኝምም።\n" +
                "8 ፤ ዓሣ አጥማጆቹ ያዝናሉ፥ በዓባይም ወንዝ መቃጥን የሚጥሉት ሁሉ ያለቅሳሉ፥ በውኆችም ላይ መረብ የሚዘረጉት ይዝላሉ።\n" +
                "9 ፤ የተበጠረውንም የተልባ እግር የሚሠሩ፥ ነጩንም ልብስ የሚሠሩ ሸማኔዎች ያፍራሉ።\n" +
                "10 ፤ ደገፋዎችዋም ሁሉ ይሰባበራሉ፥ የደመወዘኞችም ነፍስ ትተክዛለች።\n" +
                "11 ፤ የጣኔዎስ አለቆች ፍጹም ሰነፎች ናቸው፤ ፈርዖንን የሚመክሩ ጥበበኞች ምክራቸው ድንቍርና ሆነች። ፈርዖንን። እኛ የጥበበኞች ልጆች የቀደሙም ነገሥታት ልጆች ነን እንዴት ትሉታላችሁ?\n" +
                "12 ፤ አሁንሳ ጥበበኞችህ የት አሉ? አሁን ይንገሩህ፤ የሠራዊት ጌታ እግዚአብሔር በግብጽ ላይ ያሰበውን ይወቁ።\n" +
                "13 ፤ የጣኔዎስ አለቆች ሰነፎች ሆነዋል፥ የሜምፎስም አለቆች ተሸንግለዋል፤ የነገዶችዋ የማዕዘን ድንጋዮች የሆኑ ግብጽን አሳቱ።\n" +
                "14 ፤ እግዚአብሔር የጠማምነትን መንፈስ በውስጥዋ ደባልቆአል፤ ሰካር በትፋቱ እንዲስት እንዲሁ ግብጽን በሥራዋ ሁሉ አሳቱ።\n" +
                "15 ፤ ራስ ወይም ጅራት የሰሌን ቅርንጫፍ ወይም እንግጫ ቢሆን ሊሠራ የሚችል ሥራ ለግብጽ አይሆንላትም።\n" +
                "16 ፤ በዚያ ቀን ግብጻውያን እንደ ሴቶች ይሆናሉ፥ የሠራዊት ጌታ እግዚአብሔርም በእነርሱ ላይ ከሚያንቀሳቅሳት ከእጁ መንቀሳቀስ የተነሣ ይሸበራሉ ይፈሩማል።\n" +
                "17 ፤ የይሁዳም ምድር ግብጽን የምታስደነግጥ ትሆናለች፤ የሠራዊት ጌታ እግዚአብሔር ከመከረባት ምክር የተነሣ ወሬዋን የሚሰማ ሁሉ ይፈራል።\n" +
                "18 ፤ በዚያ ቀን በግብጽ ምድር በከነዓን ቋንቋ የሚናገሩ፥ በሠራዊት ጌታ በእግዚአብሔርም የሚምሉ አምስት ከተሞች ይሆናሉ፤ ከነዚህም አንዲቱ የጥፋት ከተማ ተብላ ትጠራለች።\n" +
                "19 ፤ በዚያ ቀን በግብጽ ምድር መካከል ለእግዚአብሔር መሠዊያ፥ በዳርቻዋም ለእግዚአብሔር ዓምድ ይሆናል።\n" +
                "20 ፤ ይህም ለሠራዊት ጌታ ለእግዚአብሔር በግብጽ ምድር ምልክትና ምስክር ይሆናል፤ ከሚያስጨንቁአቸው የተነሣ ወደ እግዚአብሔር ይጮኻሉና፥ እርሱም መድኃኒትንና ኃያልን ሰድዶ ያድናቸዋልና።\n" +
                "21 ፤ በዚያም ቀን እግዚአብሔር በግብጽ የታወቀ ይሆናል፥ ግብጽAውያንም እግዚአብሔርን ያውቃሉ፤ በመሥዋዕትና በቍርባን ያመልካሉ፥ ለእግዚአብሔርም ስእለት ይሳላሉ ይፈጽሙትማል።\n" +
                "22 ፤ እግዚአብሔርም ግብጽን ይመታታል፤ ይመታታል ይፈውሳታልም፤ ወደ እግዚአብሔርም ይመለሳሉ እርሱም ይለመናቸዋል ይፈውሳቸውማል።\n" +
                "23 ፤ በዚያ ቀን ከግብጽ ወደ አሦር መንገድ ይሆናል፥ አሦራዊውም ወደ ግብጽ፥ ግብጻዊውም ወደ አሦር ይገባል፤ ግብጻውያንም ከአሦራውያን ጋር ይሰግዳሉ።\n" +
                "24 ፤\n" +
                "25 ፤ የሠራዊት ጌታ እግዚአብሔር። ሕዝቤ ግብጽ፥ የእጄም ሥራ አሦር፥ ርስቴም እስራኤል የተባረከ ይሁን ብሎ ይባርካቸዋልና በዚያ ቀን እስራኤል ለግብጽና ለአሦር ሦስተኛ ይሆናል፥ በምድርም መካከል በረከት ይሆናል።\n"));

        return new Chapter(19, verses);
    }

    private Chapter chapterTwenty() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ የአሦር ንጉሥ ሳርጎን ተርታንን በሰደደ ጊዜ እርሱም ወደ አዛጦን በመጣ ጊዜ አዛጦንም ወግቶ በያዛት ጊዜ፥\n" +
                "2 ፤ በዚያ ዓመት እግዚአብሔር የአሞጽን ልጅ ኢሳይያስን። ሂድ፥ ማቅህን ከወገብህ አውጣ ጫማህንም ከእግርህ አውልቅ ብሎ ተናገረው። እንዲህም አደረገ፥ ራቁቱንም ባዶ እግሩንም ሄደ።\n" +
                "3 ፤ እግዚአብሔርም አለ። ባሪያዬ ኢሳይያስ በግብጽና በኢትዮጵያ ላይ ሦስት ዓመት ለምልክትና ለተአምራት ሊሆን ራቁቱንና ባዶ እግሩን እንደ ሄደ፥\n" +
                "4 ፤ እንዲሁ የአሦር ንጉሥ የግብጽንና የኢትዮጵያን ምርኮ፥ ጐበዛዝቱንና ሽማግሌዎቹን፥ ራቁታቸውንና ባዶ እግራቸውን አድርጎ ገላቸውንም ገልጦ፥ ለግብጽ ጕስቍልና ይነዳቸዋል።\n" +
                "5 ፤ እነርሱም ከተስፋቸው ከኢትዮጵያ ከትምክሕታቸውም ከግብጽ የተነሣ ይፈራሉ ያፍሩማል፤\n" +
                "6 ፤ በዚያም ቀን በዚች ባሕር ዳርቻ የሚቀመጡ። እነሆ፥ ከአሦር ንጉሥ እንድን ዘንድ ለእርዳታ ወደ እነርሱ የሸሸንበት ተስፋችን ይህ ነበረ፤ እኛስ እንዴት እናመልጣለን? ይላሉ።\n"));

        return new Chapter(20, verses);
    }
    private Chapter chapterTwentyOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በባሕር አጠገብ ስላለው ስለ ምድረ በዳ የተነገረ ሸክም። ዐውሎ ነፋስ ከደቡብ እንደሚወጣ፥ እንዲሁ ከሚያስፈራ አገር ከምድረ በዳ ይወጣል።\n" +
                "2 ፤ ከባድ ራእይ ተነገረኝ፤ ወንጀለኛው ይወነጅላል አጥፊውም ያጠፋል። ኤላም ሆይ፥ ውጪ፤ ሜዶን ሆይ፥ ክበቢ፤ ትካዜውን ሁሉ አስቀርቻለሁ።\n" +
                "3 ፤ ስለዚህ ወገቤ ሕመም ተሞላ፤ እንደምትወልድ ሴት ምጥ ያዘኝ፤ ከሕመሜ የተነሣ አልሰማም፥ ከድንጋጤም የተነሣ አላይም።\n" +
                "4 ፤ ልቤ ተንበደበደ፥ ድንጋጤ አስፈራኝ፥ ተስፋ ያደረግሁትም ድንግዝግዝታ መንቀጥቀጥ ሆነብኝ።\n" +
                "5 ፤ ማዕዱን ያዘጋጃሉ፥ ምንጣፉንም ይዘረጋሉ፥ ይበሉማል፥ ይጠጡማል፤ እናንተ መሳፍንት ሆይ፥ ተነሡ፥ ጋሻውን አዘጋጁ።\n" +
                "6 ፤ ጌታ እንዲህ ብሎኛልና። ሂድ ጉበኛም አቁም፥ የሚያየውንም ይናገር።\n" +
                "7 ፤ በከብት የሚቀመጡትን፥ ሁለት ሁለት እየሆኑ የሚሄዱት ፈረሰኞች፥ በአህዮች የሚቀመጡትንና በግመሎች የሚቀመጡትን ባየ ጊዜ በጽኑ ትጋት አስተውሎ ተግቶም ያድምጥ።\n" +
                "8 ፤ ያየውም። ጌታ ሆይ፥ ቀኑን ሁሉ ዘወትር በማማ ላይ ቆሜአለሁ፥ ሌሊቱንም ሁሉ በመጠበቂያዬ ላይ ተተክያለሁ፥\n" +
                "9 ፤ እነሆም፥ በፈረሶች የሚቀመጡ፥ ሁለት ሁለት ሁነው የሚሄዱ ፈረሰኞች ይመጣሉ ብሎ ጮኸ፤ እርሱም መልሶ። ባቢሎን ወደቀች ወደቀች፥ የተቀረጹም የአማልክቶችዋ ምስሎች ሁሉ በምድር ላይ ተጥለው ደቀቁ አለ።\n" +
                "10 ፤ እናንተ በአውድማዬ ላይ የተወቃችሁ የአውድማዬ ልጆች ሆይ፥ ከእስራኤል አምላክ ከሠራዊት ጌታ እግዚአብሔር የሰማሁትን ነገርኋችሁ።\n" +
                "11 ፤ ስለ ኤዶምያስ የተነገረ ሸክም። አንዱ ከሴይር። ጕበኛ ሆይ፥ ሌሊቱ ምን ያህል ነው? ጕበኛ ሆይ፥ ሌሊቱ ምን ያህል ነው? ብሎ ጠራኝ።\n" +
                "12 ፤ ጕበኛውም። ይነጋል ድግሞም ይመሻል፤ ትጠይቁ ዘንድ ብትወድዱ ጠይቁ፤ ተመልሳችሁም ኑ አለ።\n" +
                "13 ፤ ስለ ዓረብ የተነገረ ሸክም። የድዳናውያን ነጋዴዎች ሆይ፥ በዓረብ ዱር ውስጥ ታድራላችሁ።\n" +
                "14 ፤ በቴማን የምትኖሩ ሆይ፥ ወደ ተጠሙት ሰዎች ውኃ አምጡ እንጀራ ይዛችሁ የሸሹትን ሰዎች ተቀበሉአቸው።\n" +
                "15 ፤ ከሰይፍ፥ ከተመዘዘው ሰይፍ፥ ከተለጠጠውም ቀስት ከጽኑም ሰልፍ ሸሽተዋልና።\n" +
                "16 ፤ ጌታ እንዲህ ብሎኛልና። እንደ ምንደኛ ዓመት በአንድ ዓመት ውስጥ የቄዳር ክብር ሁሉ ይጠፋል፤\n" +
                "17 ፤ ከቀስተኞች ቍጥር የቀሩት፥ የቄዳር ልጆች ኃያላን፥ ያንሳሉ፤ የእስራኤል አምላክ እግዚአብሔር ተናግሮአልና።\n"));
        // Add more verses as needed
        return new Chapter(21, verses);
    }

    private Chapter chapterTwentyTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ስለ ራእይ ሸለቆ የተነገረ ሸክም። እናንተ ሁላችሁ ወደ ሰገነት መውጣታቸሁ ምን ሆናችኋል?\n" +
                "2 ፤ ጩኸትና ፍጅት የተሞላብሽ ከተማ፥ ደስታ ያለሽ ከተማ ሆይ፥ በአንቺ ውስጥ የተገደሉት በሰይፍ የተገደሉ አይደሉም፥ በሰልፍም የሞቱ አይደሉም።\n" +
                "3 ፤ አለቆችሽ ሁሉ በአንድነት ሸሹ፥ ያለ ቀስትም ተማረኩ፤ ከሩቅ ሸሽተው ከአንቺ ዘንድ የተገኙት ሁሉ በአንድነት ታሰሩ።\n" +
                "4 ፤ ስለዚህ። ፊታችሁን ከእኔ ዘንድ አርቁ፤ መራራ ልቅሶ አለቅሳለሁ፤ ስለ ሕዝቤ ሴት ልጅ ጥፋት ታጽናኑኝ ዘንድ አትድከሙ አልሁ።\n" +
                "5 ፤ ከሠራዊት ጌታ ከእግዚአብሔር ዘንድ የድንጋጤና የመረገጥ የድብልቅልቅም ቀን፥ የቅጥርም መፍረስ ወደ ተራራም መጮኽ በራእይ ሸለቆ ውስጥ ሆኖአል።\n" +
                "6 ፤ ኤላምም ከሰረገለኞችና ከፈረሰኞች ጋር ሆኖ አፎቱን ተሸከመ፥ ቂርም ጋሻውን ገለጠ።\n" +
                "7 ፤ መልካሞቹንም ሸለቆችሽን ሰረገሎች ሞሉባቸው፥ ፈረሰኞችም መቆሚያቸውን በበር ላይ አደረጉ።\n" +
                "8 ፤ የይሁዳንም መጋረጃ ገለጠ፤ በዚያም ቀን በዱር ቤት የነበረውን የጦር ዕቃ ተመለከትህ፥\n" +
                "9 ፤ የዳዊትም ከተማ ፍራሾች እንደ በዙ አይታችኋል፥ የታችኛውንም ኵሬ ውኃ አከማችታችኋል፥\n" +
                "10 ፤ የኢየሩሳሌምን ቤቶች ቈጠራችሁ ቅጥሩንም ለማጥናት ቤቶችን አፈረሳችሁ።\n" +
                "11 ፤ በአሮጌው ኵሬ ላለው ውኃ በሁለቱ ቅጥር መካከል መከማቻ ሠራችሁ፤ ይህን ያደረገውን ግን አልተመለከታችሁም፥ ቀድሞ የሠራውንም አላያችሁም።\n" +
                "12 ፤ በዚያም ቀን የሠራዊት ጌታ እግዚአብሔር ወደ ልቅሶና ወደ ዋይታ ራስን ወደ መንጨትና ማቅንም ወደ መልበስ ጠራ።\n" +
                "13 ፤ እነሆም፥ ሐሜትና ደስታ በሬውንና በጉንም ማረድ ሥጋንም መብላት የወይን ጠጅንም መጠጣት ሆነዋል፤ እናንተ። ነገ እንሞታለንና እንብላ እንጠጣ ብላችኋል።\n" +
                "14 ፤ ይህም ነገር በሠራዊት ጌታ በእግዚአብሔር ጆሮ ተሰማ። እስክትሞቱ ድረስ ይህ በደል በእውነት አይሰረይላችሁም ይላል የሠራዊት ጌታ እግዚአብሔር።\n" +
                "15 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። በቤቱ ውስጥ ወደ ተሾመው ወደዚህ አዛዥ ወደ ሳምናስ ሂድ እንዲህም በለው።\n" +
                "16 ፤ መቃብር በዚህ ያስወቀርህ ከፍ ባለው ስፍራ መቃብር ያሰራህ በድንጋይም ውስጥ ለራስህ መኖርያ ያሳነጽህ በዚህ ምን አለህ? በዚህስ በአንተ ዘንድ ማን አለ?\n" +
                "17 ፤ እነሆ፥ እግዚአብሔር በኃይል ወርውሮ ይጥልሃል፥ አጠንክሮም ይጨብጥሃል።\n" +
                "18 ፤ ጠቅልሎም ያንከባልልሃል ወደ ሰፊይቱም ምድር እንደ ኳስ ይጥልሃል፤ አንተ የጌታህ ቤት እፍረት! በዚያ ትሞታለህ በዚያም የክብርህ ሰረገላዎች ይሆናሉ።\n" +
                "19 ፤ ከአዛዥነት ሥራህ አሳድድሃለሁ፥ ከሹመትህም ትሻራለህ።\n" +
                "20 ፤ በዚያም ቀን ባሪያዬን የኬልቅያስን ልጅ ኤልያቄምን እጠራለሁ፥\n" +
                "21 ፤ መጐናጸፊያህንም አለብሰዋለሁ፥ በመታጠቂያህም አስታጥቀዋለሁ፥ ሹመትህንም በእጁ አሳልፌ እሰጠዋለሁ፤ በኢየሩሳሌምም ለሚኖሩ ለይሁዳም ቤት አባት ይሆናል።\n" +
                "22 ፤ የዳዊትንም ቤት መክፈቻ በጫንቃው ላይ አኖራለሁ፤ እርሱም ይከፍታል የሚዘጋም የለም እርሱም ይዘጋል የሚከፍትም የለም።\n" +
                "23 ፤ በታመነም ስፍራ እንደ ችንካር እተክለዋለሁ፥ ለአባቱም ቤት የክብር ዙፋን ይሆናል።\n" +
                "24 ፤ የአባቱንም ቤት ክብር ሁሉ ልጆቹንም የልጅ ልጆቹንም፥ ከጽዋ ዕቃ ጀምሮ እስከ ማድጋ ዕቃ ድረስ፥ ታናናሹን ዕቃ ሁሉ ይሰቅሉበታል።\n" +
                "25 ፤ በዚያ ቀን፥ ይላል የሠራዊት ጌታ እግዚአብሔር፥ በታመነው ስፍራ የተከለው ችንካር ይወልቃል ተሰብሮም ይወድቃል፥ በእርሱም ላይ የተሰቀለው ሸክም ይጠፋል እግዚአብሔር ተናግሮአልና።\n" ));
        // Add more verses as needed
        return new Chapter(22, verses);
    }

    private Chapter chapterTwentyThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ ስለ ጢሮስ የተነገረ ሸክም። የተርሴስ መርከቦች ሆይ፥ አልቅሱ፤ ፈርሶአልና ቤት የለም፥ መግባትም የለም፤ ከኪቲም አገር ጀምሮ ተገልጦላቸዋል።\n" +
                "2 ፤ እናንተ በደሴት የምትኖሩ በባሕርም የምትሻገሩ የሲዶና ነጋዴዎች ንግድ የሞሉባችሁ ሆይ፥ ጸጥ በሉ።\n" +
                "3 ፤ የሺሖር ዘርና የዓባይ ወንዝ መከር በብዙ ውኆች ላይ ገቢዋ ነበረ፤ እርስዋም የአሕዛብ መናገጃ ነበረች።\n" +
                "4 ፤ ሲዶና ሆይ፥ ባሕር፥ የባሕር ምሽግ። አላማጥሁም፥ አልወለድሁም፤ ጐበዛዝትንም አላሳደግሁም፥ ደናግልንም አላሳደግሁም ብሎ ተናግሮአልና እፈሪ።\n" +
                "5 ፤ ወሬዋ ወደ ግብጽ በደረሰ ጊዜ በጢሮስ ወሬ ምጥ ይይዛቸዋል።\n" +
                "6 ፤ ወደ ተርሴስ ተሻገሩ፤ እናንተ በደሴት የምትኖሩ አልቅሱ።\n" +
                "7 ፤ በቀድሞ ዘመን ተመሥርታ የነበረችው፥ በዚያም እንደ እንግዳ ሆና ትኖር ዘንድ እግሮችዋ ወደ ሩቅ ያፈለሱአት የደስታችሁ ከተማ ይህች ናትን?\n" +
                "8 ፤ አክሊል ባስጫነች ከተማ በጢሮስ ላይ ይህን የወሰነ ማን ነው? ነጋዴዎችዋ አለቆች ናቸው፥ በእርስዋም የሚሸጡና የሚለውጡ የምድር ክቡራን ናቸው።\n" +
                "9 ፤ የክብርን ሁሉ ትዕቢት ይሽር ዘንድ የምድርንም ክቡራን ሁሉ ያስንቅ ዘንድ የሠራዊት ጌታ እግዚአብሔር ወስኖታል።\n" +
                "10 ፤ የተርሴስ ልጅ ሆይ፥ የሚከለክልሽ የለምና እንደ ዓባይ ወንዝ በአገርሽ ላይ ጐርፈሽ እለፊ።\n" +
                "11 ፤ በባሕር ላይ እጁን ዘረጋ መንግሥታትንም አናወጠ፤ ምሽጎችዋንም ያጠፉ ዘንድ እግዚአብሔር ስለ ከነዓን አገር አዘዘ።\n" +
                "12 ፤ እርሱም። አንቺ የተበደልሽ የሲዶና ድንግል ልጅ ሆይ፥ ከእንግዲህ ወዲህ ደስ አይበልሽ፤ ተነሥተሽ ወደ ኪቲም ተሻገሪ፥ በዚያም ደግሞ አታርፊም አለ።\n" +
                "13 ፤ እነሆ፥ የከለዳውያን አገር! ይህ ሕዝብ ሆኖ አይገኝም፤ አሦራውያን ለምድረ በዳ አራዊት ሰጥተውታል፤ ግንቦቻቸውን ሠሩ፥ አዳራሾችዋንም አፈረሱ፥ ባድማም አደረጓት።\n" +
                "14 ፤ እናንተ የተርሴስ መርከቦች ሆይ፥ ምሽጋችሁ ፈርሶአልና ዋይ በሉ።\n" +
                "15 ፤ በዚያም ቀን እንዲህ ይሆናል፤ ጢሮስ እንደ አንድ ንጉሥ ዘመን ሰባ ዓመት ያህል የተረሳች ትሆናለች፤ ከሰባ ዓመት በኋላ ግን ለጢሮስ በጋለሞታ ዘፈን እንደሚሆን እንዲሁ ይሆናል።\n" +
                "16 ፤ አንቺ የተረሳሽ ጋለሞታ ሆይ፥ መሰንቆ ያዢ በከተማ ላይም ዙሪ፤ መታሰቢያም ይሆንልሽ ዘንድ ዜማን አሳምሪ ዘፈንሽንም አብዢ።\n" +
                "17 ፤ ከሰባ ዓመትም በኋላ እግዚአብሔር ጢሮስን ይጐበኛታል፥ ወደ ዋጋዋም ትምለሳለች፥ ደግሞም በምድር ፊት ላይ ከሆኑ ከዓለም መንግሥታት ሁሉ ጋር ትገለሙታለች።\n" +
                "18 ፤ ንግድዋና ዋጋዋ ለእግዚአብሔር የተቀደሰ ይሆናል፤ ንግድዋም በልተው ይጠግቡ ዘንድ ማለፊያም ልብስ ይለብሱ ዘንድ በእግዚአብሔር ፊት ለሚኖሩ ይሆናል እንጂ በዕቃ ቤትና በግምጃ ቤት ውስጥ አይከተትም።\n"));
        // Add more verses as needed
        return new Chapter(23, verses);
    }

    private Chapter chapterTwentyFour() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እነሆ፥ እግዚአብሔር ምድርን ባዶ ያደርጋታል፥ ባድማም ያደርጋታል፥ ይገለብጣትማል፥ በእርስዋም የተቀመጡትን ይበትናል።\n" +
                "2 ፤ እንደ ሕዝቡም እንዲሁ ካህኑ፥ እንደ ባሪያውም እንዲሁ ጌታው፥ እንደ ባሪያይቱም እንዲሁ እመቤትዋ፥ እንደሚገዛም እንዲሁ የሚሸጠው፥ እንደ አበዳሪውም እንዲሁ ተበዳሪው፥ እንደ ዕዳ አስከፋዩም እንዲሁ ዕዳ ከፋዩ ይሆናል።\n" +
                "3 ፤ ምድር መፈታትን ትፈታለች፥ ፈጽማም ትበላሻላች፤ እግዚአብሔር ይህን ቃል ተናግሮአልና።\n" +
                "4 ፤ ምድርም አለቀሰች ረገፈችም፤ ዓለም ደከመች ረገፈችም፤ የምድርም ሕዝብ ታላላቆች ደከሙ።\n" +
                "5 ፤ ምድርም ከሚቀመጡባት በታች ረክሳለች፥ ሕጉን ተላልፈዋልና፥ ሥርዓቱንም ለውጠዋልና፥ የዘላለሙንም ቃል ኪዳን አፍርሰዋልና።\n" +
                "6 ፤ ስለዚህ መርገም ምድርን ትበላለች በእርስዋም የተቀመጡ ይቀጣሉ፤ ስለዚህ የምድር ሰዎች ይቃጠላሉ ጥቂት ሰዎችም ይቀራሉ።\n" +
                "7 ፤ የወይን ጠጅ አለቀሰች፥ የወይን ንግድ ደከመች፥ ልባቸው ደስ ያለው ሁሉ ተከዙ።\n" +
                "8 ፤ የከበሮው ሐሤት ቀርቶአል፥ የደስተኞች ድምፅ ዝም ብሎአል፥ የመሰንቆ ደስታ ቀርቶአል።\n" +
                "9 ፤ እየዘፈኑም የወይን ጠጅን አይጠጡትም፥ የሚያሰክርም መጠጥ ለሚጠጡት መራራ ይሆናል።\n" +
                "10 ፤ ባድማ የሆነችው ከተማ ፈረሰች፤ ቤት ሁሉ ማንም እንዳይገባበት ተዘጋ።\n" +
                "11 ፤ ስለ ወይኑም ጠጅ በአደባባይ ጩኸት ይሆናል፤ ደስታ ሁሉ ጨልሞአል፥ የምድርም ሐሤት ፈርሶአል።\n" +
                "12 ፤ ከተማይቱም ባድማ ሆናለች፥ በርዋም በጥፋት ተመትቶአል።\n" +
                "13 ፤ የወይራን ዛፍ እንደ መምታት፥ ከወይንም መከር በኋላ ቃርሚያውን እንደ መልቀም፥ እንዲሁ በምድር መካከል በአሕዛብም መካከል ይሆናል።\n" +
                "14 ፤ እነዚህ ድምፃቸውን ያነሣሉ፥ እልልም ይላሉ፥ ስለ እግዚአብሔር ክብርም ከባሕር ይጣራሉ።\n" +
                "15 ፤ ስለዚህ እግዚአብሔርን በምሥራቅ፥ የእስራኤልንም አምላክ የእግዚአብሔርንም ስም በባሕር ደሴቶች አክብሩ።\n" +
                "16 ፤ ለጻድቁ ክብር ይሁን የሚለውን ዝማሬ ከምድር ዳርቻ ሰምተናል። እኔ ግን። ከሳሁ፥ ከሳሁ፥ ወዮልኝ! ወንጀለኞች ወንጅለዋል፤ ወንጀለኞች እጅግ ወንጅለዋል አልሁ።\n" +
                "17 ፤ በምድር ላይ የምትኖር ሆይ፥ ፍርሃትና ገደል ወጥመድም በአንተ ላይ አሉ።\n" +
                "18 ፤ የሰማይ መስኮቶች ተከፍተዋልና፥ የምድርም መሠረት ተናውጣለችና ከፍርሃት ድምፅ የሸሸ በገደል ይወድቃል፥ ከገደልም የወጣ በወጥመድ ይያዛል።\n" +
                "19 ፤ ምድር ተሰባበረች፥ ምድር ፈጽማ ደቀቀች፥ ምድር ተነዋወጠች።\n" +
                "20 ፤ ምድር እንደ ሰካር ሰው ትንገዳገዳለች፥ እንደ ዳስም ትወዛወዛለች፤ መተላለፍዋ ይከብድባታል፥ ትወድቅማለች ደግማም አትነሣም።\n" +
                "21 ፤ በዚያም ቀን እንደዚህ ይሆናል፤ እግዚአብሔር በከፍታ ያለውን ሠራዊት በከፍታ ላይ፥ በምድርም ያሉትን ነገሥታት በምድር ላይ ይቀጣቸዋል።\n" +
                "22 ፤ ግዞተኞች በጕድጓድ እንደሚከማቹ በአንድነት ይከማቻሉ፥ በግዞት ቤትም ውስጥ ተዘግተው ይኖራሉ፥ ከብዙ ቀንም በኋላ ይጐበኛሉ።\n" +
                "23 ፤ የሠራዊት ጌታ እግዚአብሔርም በጽዮን ተራራና በኢየሩሳሌም ላይ ይነግሣልና፥ በሽማግሌዎቹም ፊት ክብር ይሆናልና ጨረቃ ይታወካል ፀሐይም ያፍራል።\n"));
        // Add more verses as needed
        return new Chapter(24, verses);
    }
    private Chapter chapterTwentyFive() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ አቤቱ፥ አንተ አምላኬ ነህ፤ ድንቅን ነገር የዱሮ ምክርን በታማኝነትና በእውነት አድርገሃልና ከፍ ከፍ አደርግሃለሁ ስምህንም አመሰግናለሁ።\n" +
                "2 ፤ ከተማይቱን የድንጋይ ክምር፥ የተመሸገችውን ከተማ ውድማ እንድትሆን፥ የኀጥአንንም አዳራሽ ከተማ እንዳትሆን አድርገሃል፤ ከቶ አትሠራም።\n" +
                "3 ፤ ስለዚህ ኃያላኑ ወገኖች ያከብሩሃል፥ የጨካኞች አሕዛብ ከተማም ትፈራሃለች።\n" +
                "4 ፤ የጨካኞችም ቍጣ እስትንፋስ ቅጥርን እንደሚመታ ዐውሎ ነፋስ በሆነ ጊዜ፥ ለድሀው መጠጊያ፥ ለችግረኛው በጭንቁ ጊዜ መጠጊያ፥ ከውሽንፍር መሸሸጊያ ከሙቀትም ጥላ ሆነሃል።\n" +
                "5 ፤ እንደ ሙቀት በደረቅ ስፍራ የኀጥአንን ጩኸት ዝም ታሰኛለህ፤ ሙቀትም በደመና ጥላ እንዲበርድ እንዲሁ የጨካኞች ዝማሬ ይዋረዳል።\n" +
                "6 ፤ የሠራዊት ጌታ እግዚአብሔርም ለሕዝብ ሁሉ በዚህ ተራራ ላይ ታላቅ የሰባ ግብዣ፥ ያረጀ የወይን ጠጅ፥ ቅልጥም የሞላባቸው የሰቡ ነገሮች፥ የጥሩና ያረጀ የወይን ጠጅ ግብዣ ያደርጋል።\n" +
                "7 ፤ በዚህም ተራራ ላይ በወገኖች ሁሉ ላይ የተጣለውን መጋረጃ፥ በአሕዛብም ሁሉ ላይ የተዘረጋውን መሸፈኛ ያጠፋል።\n" +
                "8 ፤ ሞትን ለዘላለም ይውጣል፥ ጌታ እግዚአብሔርም ከፊት ሁሉ እንባን ያብሳል፥ የሕዝቡን ስድብ ከምድር ሁሉ ላይ ያስወግዳል፤ እግዚአብሔር ተናግሮአልና።\n" +
                "9 ፤ በዚያም ቀን። እነሆ፥ አምላካችን ይህ ነው፤ ተስፋ አድርገነዋል፥ ያድነንማል፤ እግዚአብሔር ይህ ነው፤ ጠብቀነዋል፤ በማዳኑ ደስ ይለናል ሐሤትም እናደርጋለን ይባላል።\n" +
                "10 ፤ የእግዚአብሔርም እጅ በዚህ ተራራ ላይ ታርፋለች፥ ጭድም በጭቃ ውስጥ እንደሚረገጥ እንዲሁ ሞዓብ በስፍራው ይረገጣል።\n" +
                "11 ፤ ዋናተኛም ሲዋኝ እጁን እንደሚዘረጋ፥ እንዲሁ በመካከሉ እጁን ይዘረጋል፤ ነገር ግን እግዚአብሔር ትዕቢቱን ከእጁ ተንኰል ጋር ያዋርዳል።\n" +
                "12 ፤ የተመሸገውንም ከፍ ከፍ ያለውንም ቅጥርህን ዝቅ ያደርገዋል፥ ያዋርደውማል፥ ወደ መሬትም እስከ አፈር ድረስ ይጥለዋል።\n"));

        return new Chapter(25, verses);
    }

    private Chapter chapterTwentySix() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በዚያም ቀን ይህ ቅኔ በይሁዳ ምድር ይዘመራል። የጸናች ከተማ አለችን፤ ለቅጥርና ለምሽግ መድኃኒትን ያኖርባታል።\n" +
                "2 ፤ እውነትን የሚጠብቅ ጻድቅ ሕዝብ ይገባ ዘንድ በሮችን ክፈቱ።\n" +
                "3 ፤ በአንተ ታምናለችና በአንተ ለምትደገፍ ነፍስ ፈጽመህ በሰላም ትጠብቃታለህ።\n" +
                "4 ፤ ጌታ እግዚአብሔር የዘላለም አምባ ነውና ለዘላለም በእግዚአብሔር ታመኑ።\n" +
                "5 ፤ በከፍታ የሚኖሩትን ሰዎች ዝቅ ያደርጋል፤ ከፍ ያለችውን ከተማ ያዋርዳል፥ እስከ መሬትም ድረስ ያዋርዳታል፥ እስከ አፈርም ድረስ ይጥላታል።\n" +
                "6 ፤ እግር፥ የድሀ እግርም የችግረኛም አረጋገጥ፥ ትረግጣታለች።\n" +
                "7 ፤ የጻድቃን መንገድ ቅን ናት፤ አንተ ቅን የሆንህ የጻድቃንን መንገድ ታቃናለህ።\n" +
                "8 ፤ አቤቱ፥ በፍርድህ መንገድ ተስፋ አድርገንሃል፥ ስምህም መታሰቢያህም የነፍሳችን ምኞት ነው።\n" +
                "9 ፤ ፍርድህን በምድር ባደረግህ ጊዜ በዓለም የሚኖሩት ጽድቅን ይማራሉና ነፍሴ በሌሊት ትናፍቅሃለች፥ መንፈሴም በውስጤ ወደ አንተ ትገሠግሣለች።\n" +
                "10 ፤ ለኃጢአተኛ ሞገስ ቢደረግለት ጽድቅን አይማርም፤ በቅኖች ምድር ክፉን ነገር ያደርጋል፥ የእግዚአብሔርንም ግርማ አያይም።\n" +
                "11 ፤ አቤቱ፥ እጅህ ከፍ ከፍ አለች አላዩምም፤ ነገር ግን በሕዝብህ ላይ ያለህን ቅንዓት አይተው ያፍራሉ፤ እሳትም ጠላቶችህን ትበላለች።\n" +
                "12 ፤ አቤቱ፥ ሥራችንን ሁሉ ሠርተህልናልና ሰላምን ትሰጠናለህ።\n" +
                "13 ፤ አቤቱ አምላካችን ሆይ፥ ከአንተ በቀር ሌሎች ጌቶች ገዝተውናል፤ ነገር ግን በአንተ ብቻ ስምህን እናስባለን።\n" +
                "14 ፤ እነርሱ ሞተዋል፥ በሕይወት አይኖሩም፤ ጠፍተዋል፥ አይነሡም፤ ስለዚህ አንተ ጐብኝተሃቸዋል አጥፍተሃቸውማል፥ መታሰቢያቸውንም ሁሉ ምንምን አድርገሃል።\n" +
                "15 ፤ ሕዝብን አበዛህ፥ አቤቱ፥ ሕዝብን አበዛህ፤ አንተም ተከበርህ፥ የአገሪቱንም ዳርቻ ሁሉ አሰፋህ።\n" +
                "16 ፤ አቤቱ፥ በመከራ ጊዜ ፈለጉህ፥ በገሰጽሃቸውም ጊዜ ልመናቸውን ወደ አንተ አፈሰሱ።\n" +
                "17 ፤ የፀነሰች ሴት ለመውለድ ስትቀርብ እንደምትጨነቅና በምጥ እንደምትጮኽ፥ አቤቱ፥ እንዲሁ በፊትህ ሆነናል።\n" +
                "18 ፤ እኛ ፀንሰናል ምጥም ይዞናል፥ ነፋስንም እንደምንወልድ ሆነናል፤ በምድርም ደኅንነት አላደረግነም፤ በዓለምም የሚኖሩ ይወድቃሉ።\n" +
                "19 ፤ ሙታንህ ሕያዋን ይሆናሉ፥ ሬሳዎችም ይነሣሉ። በምድር የምትኖሩ ሆይ፥ ጠልህ የብርሃን ጠል ነውና፥ ምድርም ሙታንን ታወጣለችና ንቁ ዘምሩም።\n" +
                "20 ፤ ሕዝቤ ሆይ፥ ና ወደ ቤትህም ግባ፥ ደጅህን በኋላህ ዝጋ ቍጣ እስኪያልፍ ድረስ ጥቂት ጊዜ ተሸሸግ።\n" +
                "21 ፤ በምድር በሚኖሩት ላይ በበደላቸው ምክንያት ቍጣውን ያመጣባቸው ዘንድ፥ እነሆ፥ እግዚአብሔር ከስፍራው ይወጣል፤ ምድርም ደምዋን ትገልጣለች፥ ሙታኖችዋንም ከእንግዲህ ወዲህ አትከድንም።\n" ));

        return new Chapter(26, verses);
    }

    private Chapter chapterTwentySeven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በዚያም ቀን እግዚአብሔር ፈጣኑን እባብ ሌዋታንን ጠማማውንም እባብ ሌዋታንን በጠንካራ በታላቅም በብርቱም ሰይፍ ይቀጣል፥ በባሕርም ውስጥ ያለውን ዘንዶ ይገድላል።\n" +
                "2 ፤ በዚያም ቀን ለተወደደው የወይን ቦታ ተቀኙለት።\n" +
                "3 ፤ እኔ እግዚአብሔር ጠባቂው ነኝ፤ ሁልጊዜ አጠጣዋለሁ፤ ማንም እንዳይጐዳው በሌሊትና በቀን እጠብቀዋለሁ።\n" +
                "4 ፤ አልቈጣም፤ እሾህና ኵርንችት በእኔ ላይ ምነው በሰልፍ በነበሩ! በእነርሱ ላይ ተራምጄ በአንድነት ባቃጠልኋቸው ነበር።\n" +
                "5 ፤ ወይም ጕልበቴን ይያዝ፥ ከእኔ ጋር ሰላም ያድርግ፤ ከእኔ ጋር ሰላም ያድርግ።\n" +
                "6 ፤ በሚመጣው ዘመን ያዕቆብ ሥር ይሰድዳል፥ እስራኤልም ያብባል ይጨበጭብማል፤ በፍሬያቸውም የዓለሙን ፊት ይሞላሉ።\n" +
                "7 ፤ በውኑ የመቱትን እንደ መታ እንዲሁ እርሱን መታውን? ወይስ እነርሱ እንደ ተገደሉበት መገደል እርሱ ተገድሎአልን?\n" +
                "8 ፤ ነዳቸው ሰደዳቸው ቀሠፋቸው፤ የምሥራቅ ነፋስ እንደሚነፍስበት ቀን በጠንካራ ዐውሎ አስወገዳቸው።\n" +
                "9 ፤ ስለዚህም የማምለኪያ ዐፀዶችና የፀሐይ ምስሎች ዳግመኛ እንዳይነሡ የመሠዊያውን ድንጋይ ሁሉ እንደ ደቀቀ እንደ ኖራ ድንጋይ ባደረገ ጊዜ፥ እንዲሁ የያዕቆብ በደል ይሰረያል፥ ይህም ኀጢአትን የማስወገድ ፍሬ ሁሉ ነው።\n" +
                "10 ፤ የተመሸገችው ከተማ ብቻዋን ሆነች፤ እንደ ምድረ በዳ ሆና የተፈታችና የተተወች መኖሪያ ናት፤ በዚያም ጥጃ ይሰማራል በዚያም ይተኛል ቅርንጫፍዋንም ይበላል።\n" +
                "11 ፤ ጫፎችዋ በደረቁ ጊዜ ይሰበራሉ፥ ሴቶችም መጥተው ያቃጥሉአቸዋል፤ የማያስተውል ሕዝብ ነውና ስለዚህ ፈጣሪው አይራራለትም ሠሪውም ምሕረት አያደርግለትም።\n" +
                "12 ፤ በዚያም ቀን እንዲህ ይሆናል፤ እግዚአብሔር ከወንዝ ፈሳሽ ጀምሮ እስከ ግብጽ ወንዝ ድረስ እህሉን ይወቃል፥ እናንተም የእስራኤል ልጆች ሆይ፥ አንድ በአንድ ትሰበሰባላችሁ።\n" +
                "13 ፤ በዚያም ቀን እንዲህ ይሆናል፤ ታላቅ መለከት ይነፋል፥ በአሦርም የጠፉ፥ በግብጽ ምድርም የተሰደዱ ይመጣሉ፥ በተቀደሰውም ተራራ በኢየሩሳሌም ለእግዚአብሔር ይሰግዳሉ።\n"));

        return new Chapter(27, verses);
    }

    private Chapter chapterTwentyEight() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ለኤፍሬም ሰካሮች ትዕቢት አክሊል፥ በወይን ጠጅ ለተሸነፉ በወፍራም ሸለቆአቸው ራስ ላይ ላለችም ለረገፈች ለክብሩ ጌጥ አበባ ወዮ!\n" +
                "2 ፤ እነሆ፥ በጌታ ዘንድ ኃያል ብርቱ የሆነ አለ። እንደ በረዶ ወጨፎ፥ እንደሚያጠፋም ዐውሎ ነፋስ፥ እንደሚያጥለቀልቅም እንደ ታላቅ ውኃ ፈሳሽ በጠነከረ እጅ ወደ ምድር ይጥላል።\n" +
                "3 ፤ የኤፍሬም ሰካሮች ትዕቢት አክሊል በእግር ይረገጣል፤\n" +
                "4 ፤ በወፍራሙ ሸለቆ ራስ ላይ ያለች የረገፈች የክብሩ ጌጥ አበባ ከመከር በፊት አስቀድማ እንደምትበስል በለስ ትሆናለች፤ ሰው ባያት ጊዜ በእጁ እንዳለች ይበላታል።\n" +
                "5 ፤ በዚያ ቀን የሠራዊት ጌታ እግዚአብሔር ለቀሩት ሕዝቡ የክብር ዘውድና የጌጥ አክሊል ይሆናል፤\n" +
                "6 ፤ በፍርድ ወንበር ላይ ለሚቀመጥም የፍርድ መንፈስ፥ ሰልፉን ወደ በር ለሚመልሱም ኃይል ይሆናል።\n" +
                "7 ፤ እነዚህም ደግሞ ከወይን ጠጅ የተነሣ ይስታሉ፥ ከሚያሰክርም መጠጥ የተነሣ ይፋንናሉ፤ ካህኑና ነቢዩ ከሚያሰክር መጠጥ የተነሣ ይስታሉ፥ በወይን ጠጅም ይዋጣሉ፥ ከሚያሰክርም መጠጥ የተነሣ ይፋንናሉ፤ በራእይ ይስታሉ፥ በፍርድም ይሰናከላሉ።\n" +
                "8 ፤ ማዕዱ ሁሉ ትፋትንና ርኵሰትን ተሞልቶአታል፤ ንጹሕ ስፍራ እንኳ የለም።\n" +
                "9 ፤ እውቀትን ለማን ያስተምረዋል? ወይስ ወሬ ማስተዋልን ለማን ይሰጣል? ወተትን ለተዉ ወይስ ጡትን ለጣሉ ነውን?\n" +
                "10 ፤ ትእዛዝ በትእዛዝ፥ ትእዛዝ በትእዛዝ፥ ሥርዓት በሥርዓት፥ ሥርዓት በሥርዓት፥ ጥቂት በዚህ ጥቂት በዚያ ነው።\n" +
                "11 ፤ በባዕድ አፍ በልዩም ልሳን ለዚህ ሕዝብ ይናገራል፤ እርሱም። ዕረፍት ይህች ናት፥\n" +
                "12 ፤ የደከመውን አሳርፉ፤ ይህችም ማረፊያ ናት አላቸው፤ እነርሱ ግን መስማትን እንቢ አሉ።\n" +
                "13 ፤ ስለዚህ ሄደው ወደ ኋላ እንዲወድቁ እንዲሰበሩም ተጠምደውም እንዲያዙ የእግዚአብሔር ቃል ትእዛዝ በትእዛዝ፥ ትእዛዝ በትእዛዝ፥ ሥርዓት በሥርዓት፥ ሥርዓት በሥርዓት፥ ጥቂት በዚህ ጥቂት በዚያ ይሆንላቸዋል።\n" +
                "14 ፤ ስለዚህ በኢየሩሳሌም ያለውን ሕዝብ የምትገዙ ፌዘኞች ሆይ፥ የእግዚአብሔርን ቃል ስሙ።\n" +
                "15 ፤ እናንተም። ከሞት ጋር ቃል ኪዳን አድርገናል፥ ከሲኦልም ጋር ተማምለናል፤ ሐሰትን መሸሸጊያችን አድርገናልና፥ በሐሰትም ተሰውረናልና የሚትረፈረፍ መቅሠፍት ባለፈ ጊዜ አይደርስብንም ስላላችሁ፥\n" +
                "16 ፤ ስለዚህ ጌታ እግዚአብሔር እንዲህ ይላል። እነሆ፥ በጽዮን ድንጋይን ለመሠረት አስቀምጣለሁ፤ የተፈተነውን፥ የከበረውን፥ መሠረቱ የጸናውን የማዕዘን ድንጋይ፤ የሚያምን አያፍርም።\n" +
                "17 ፤ ለገመድ ፍርድን ለቱንቢም ጽድቅን አደርጋለሁ፤ በረዶውም የሐሰትን መሸሸጊያ ይጠርጋል፥ ውኆችም መሰወሪያውን ያሰጥማሉ።\n" +
                "18 ፤ ከሞትም ጋር ያደረጋችሁት ቃል ኪዳን ይፈርሳል፥ ከሲኦልም ጋር የተማማላችሁት መሐላ አይጸናም፤ የሚትረፈረፍ መቅሠፍት ባለፈ ጊዜ ትረገጡበታላችሁ።\n" +
                "19 ፤ ባለፈም ጊዜ ይወስዳችኋል፤ ማለዳ ማለዳ ቀንና ሌሊት ያልፋል፤ ወሬውንም ማስተዋል ድንጋጤ ይሆናል።\n" +
                "20 ፤ ሰው በእርሱ ላይ ተዘርግቶ ቢተኛ አልጋው አጭር ነው፤ ሰውም ሰውነቱን መሸፈን ቢወድድ መጐናጸፊያ ጠባብ ነው።\n" +
                "21 ፤ እግዚአብሔርም ሥራውን ማለት እንግዳ ሥራውን ይሠራ ዘንድ፥ አድራጎቱንም ማለት ያልታወቀውን አድራጎቱን ያደርግ ዘንድ በፐራሲም ተራራ እንደ ነበረ ይነሣል፥ በገባዖንም ሸለቆ እንደ ነበረ ይቈጣል።\n" +
                "22 ፤ አሁንም በምድር ሁሉ ላይ የሚጸናውን የጥፋት ትእዛዝ ከሠራዊት ጌታ ከእግዚአብሔር ዘንድ ሰምቻለሁና እስራት እንዳይጸንባችሁ አታፊዙ።\n" +
                "23 ፤ አድምጡ ድምፄንም ስሙ፤ ልብ አድርጉ ንግግሬንም ስሙ።\n" +
                "24 ፤ በውኑ ገበሬ ሊዘራ ሁልጊዜ ያርሳልን? ወይስ ሁልጊዜ እርሻውን ይገለግላልን?\n" +
                "25 ፤ ጓሉንስ ይከሰክሳልን? እርሻውን ባስተካከለ ጊዜ ጥቁሩን አዝሙድ፥ ከሙኑንም፥ ስንዴውንም በተርታ፥ ገብሱንም በስፍራው፥ አጃንም በደረጃው የሚዘራ አይደለምን?\n" +
                "26 ፤ ይህንም ብልሃት አምላኩ ያስታውቀዋል ያስተምረውማል።\n" +
                "27 ፤ ጥቁሩ አዝሙድ በተሳለች መሄጃ አያኬድም፥ የሰረገላም መንኰራኵር በከሙን ላይ አይዞርም፤ ነገር ግን ጥቁሩ አዝሙድ በሽመል ከሙኑም በበትር ይወቃል።\n" +
                "28 ፤ የእንጀራ እህል ይደቅቃልን? ለዘላለም አያኬደውም፤ የሰረገላውን መንኰራኵርና ፈረሶቹን ምንም ቢያስኬድበት አያደቅቀውም።\n" +
                "29 ፤ ይህም ደግሞ ድንቅ ምክር ከሚመክር በግብሩም ማለፊያ ከሆነው ከሠራዊት ጌታ ከእግዚአብሔር ወጥቶአል።\n"));

        return new Chapter(28, verses);
    }

    private Chapter chapterTwentyNine() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ ዳዊት ለሰፈረባት ከተማ ለአርኤል ወዮላት! ዓመት በዓመት ላይ ጨምሩ፥ በዓላትም ይመለሱ።\n" +
                "2 ፤ አርኤልንም አስጨንቃለሁ፥ ልቅሶና ዋይታም ይሆንባታል፤ እንደ አርኤልም ትሆንልኛለች።\n" +
                "3 ፤ በዙሪያሽም እሰፍራለሁ፥ በቅጥርም ከብቤ አስጨንቅሻለሁ፥ አምባም በላይሽ አቆማለሁ።\n" +
                "4 ፤ ትዋረጂማለሽ፥ በመሬትም ላይ ሆነሽ ትናገሪያለሽ፥ ቃልሽም ዝቅ ብሎ ከአፈር ይወጣል፤ ድምፅሽም ከመሬት እንደሚወጣ እንደ መናፍስት ጠሪ ድምፅ ይሆናል፥ ቃልሽም ከአፈር ወጥቶ ይጮኻል።\n" +
                "5 ፤ ነገር ግን የጠላቶችሽ ብዛት እንደ ደቀቀ ትቢያ፥ የጨካኞችም ብዛት እንደሚያልፍ ገለባ ይሆናል።\n" +
                "6 ፤ ድንገትም ፈጥኖ የሠራዊት ጌታ እግዚአብሔር በነጐድጓድ፥ በምድርም መናወጥ፥ በታላቅም ድምፅ፥ በዐውሎ ነፋስም፥ በወጨፎም፥ በምትበላም በእሳት ነበልባል ይጐበኛታል።\n" +
                "7 ፤ በአርኤልም ላይ የሚዋጉ፥ እርስዋንና ምሽግዋንም የሚወጉ የሚያስጨንቋትም፥ የአሕዛብ ሁሉ ብዛት እንደ ሕልምና እንደ ሌሊት ራእይ ይሆናል።\n" +
                "8 ፤ ተርቦም እንደሚያልም ሰው ይሆናል፤ በሕልሙም፥ እነሆ፥ ይበላል፥ ነገር ግን ይነቃል ሰውነቱም ባዶ ነው፤ ተጠምቶም እንደሚያልም ሰው ይሆናል፤ በሕልሙም፥ እነሆ፥ ይጠጣል፥ ነገር ግን ይነቃል፥ እነሆም፥ ይዝላል ሰውነቱም አምሮት አለው፤ እንዲሁ የጽዮንን ተራራ የሚወጉ የአሕዛብ ሁሉ ብዛት ይሆናል።\n" +
                "9 ፤ ተደነቁ ደንግጡም፤ ተጨፈኑም ዕውሮችም ሁኑ፤ በወይን ጠጅ አይሁን እንጂ ሰከሩ፤ በሚያሰክር መጠጥ አይሁን እንጂ ተንገደገዱ።\n" +
                "10 ፤ እግዚአብሔር የእንቅልፍ መንፈስ አፍስሶባችኋል ዓይኖቻችሁን ነቢያትንም ጨፍኖባችኋል ራሶቻችሁን ባለ ራእዮችን ሸፍኖባችኋል።\n" +
                "11 ፤ ራእዩም ሁሉ እንደ ታተመ መጽሐፍ ቃል ሆኖባችኋል፤ ማንበብንም ለሚያውቅ። ይህን አንብብ ብለው በሰጡት ጊዜ እርሱ። ታትሞአልና አልችልም ይላቸዋል፤\n" +
                "12 ፤ ደግሞም መጽሐፉን ማንበብን ለማያውቅ። ይህን አንብብ ብለው በሰጡት ጊዜ እርሱ። ማንበብ አላውቅም ይላቸዋል።\n" +
                "13 ፤ ጌታም። ይህ ሕዝብ በአፉ ወደ እኔ ይቀርባልና፥ በከንፈርቹም ያከብረኛልና፥ ልቡ ግን ከእኔ የራቀ ነውና፥ በሰዎች ሥርዓትና ትምህርት ብቻ ይፈራኛልና\n" +
                "14 ፤ ስለዚህ፥ እነሆ፥ ድንቅ ነገርን በዚህ ሕዝብ መካከል፥ ድንቅ ነገርን ተአምራትንም፥ እንደ ገና አደርጋለሁ፤ የጥበበኞችም ጥበብ ትጠፋለች፥ የአስተዋዮችም ማስተዋል ትሰወራለች።\n" +
                "15 ፤ ምክራቸውን ጥልቅ አድርገው ከእግዚአብሔር ለሚሰውሩ፥ ሥራቸውንም በጨለማ ውስጥ አድርገው። ማን ያየናል? ወይስ ማን ያውቀናል? ለሚሉ ወዮላቸው!\n" +
                "16 ፤ ይህ የእናንተ ጠማምነት ነው፤ እንደ ሸክላ ሠሪ ጭቃ የምትቈጠሩ አይደላችሁምን? በውኑ ሥራ ሠሪውን። አልሠራኸኝም ይለዋልን? ወይስ የተደረገው አድራጊውን። አታስተውልም ይለዋልን?\n" +
                "17 ፤ ሊባኖስ እንደ ፍሬያማ እርሻ ሊለወጥ ፍሬያማውም እርሻ እንደ ዱር ሊቈጠር ጥቂት ዘመን የቀረ አይደለምን?\n" +
                "18 ፤ በዚያም ቀን ደንቆሮች የመጽሐፍን ቃል ይሰማሉ፥ የዕውሮችም ዓይኖች ከጭጋግና ከጨለማ ተለይተው ያያሉ።\n" +
                "19 ፤ የዋሃን ደስታቸውን በእግዚአብሔር ያበዛሉ፥ በሰዎች መካከል ያሉ ችግረኞችም ሐሤትን በእስራኤል ቅዱስ ያደርጋሉ።\n" +
                "20 ፤ ጨካኙ ሰው አልቆአልና፥ ፌዘኛውም ጠፍቶአልና፥ ለኃጢአትም የደፈጡ ሁሉ ይቈረጣሉና፤\n" +
                "21 ፤ እነዚህም ሰውን በነገር በደለኛ የሚያደርጉ፥ በበርም ለሚገሥጸው አሽክላ የሚያኖሩ፥ ጻድቁንም በከንቱ ነገር የሚያስቱ ናቸው።\n" +
                "22 ፤ ስለዚህ አብርሃምን የተቤዠ እግዚአብሔር ስለ ያዕቆብ ቤት እንዲህ ይላል። ያዕቆብ አሁን አያፍርም፥ ፊቱም አሁን አይለወጥም።\n" +
                "23 ፤ ነገር ግን የእጄን ሥራ ልጆቹን በመካከሉ ባያቸው ጊዜ ስሜን ይቀድሳሉ፤ የያዕቆብንም ቅዱስ ይቀድሳሉ፥ የእስራኤልንም አምላክ ይፈራሉ።\n" +
                "24 ፤ በመንፈስም የሳቱ ማስተዋልን ያውቃሉ፥ የሚያጕረመርሙም ትምህርትን ይቀበላሉ።\n"));

        return new Chapter(29, verses);
    }

    private Chapter chapterThirty() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ለዓመፀኞች ልጆች ወዮላቸው! ይላል እግዚአብሔር፤ ከእኔ ዘንድ ያልሆነን ምክር ይመክራሉ፥ ኃጢአትንም በኃጢአት ላይ ይጨምሩ ዘንድ ከመንፈሴ ዘንድ ያልሆነውን ቃል ኪዳን ያደርጋሉ።\n" +
                "2 ፤ ከአፌም ነገርን ሳይጠይቁ በፈርዖን ኃይል ይጸኑ ዘንድ በግብጽም ጥላ ይታመኑ ዘንድ ወደ ግብጽ እንዲወርዱ ይሄዳሉ።\n" +
                "3 ፤ ስለዚህ የፈርዖን ኃይል እፍረት በግብጽም ጥላ መታመን ስድብ ይሆንባችኋል።\n" +
                "4 ፤ አለቆች ምንም በጣኔዎስ ቢሆኑ፥ መልክተኞችም ምንም ወደ ሓኔስ ቢደርሱ፥\n" +
                "5 ፤ ሁላቸው ይጠቅሙአቸው ዘንድ ስለማይችሉ፥ እፍረትና ስድብ እንጂ ረድኤትና ረብ ስለማይሆኑ ሕዝብ ያፍራሉ።\n" +
                "6 ፤ በደቡብ ስላሉ እንስሶች የተነገረ ሸክም። ተባትና እንስት አንበሳ እፉኝትም ነዘር እባብም በሚወጡባት በመከራና በጭንቀት ምድር በኩል ብልጥግናቸውን በአህዮች ጫንቃ ላይ መዛግብቶቻቸውንም በግመሎች ሻኛ ላይ እየጫኑ ወደማይጠቅሙአቸው ሕዝብ ይሄዳሉ።\n" +
                "7 ፤ የግብጽ እርዳታ ከንቱና ምናምን ነው፤ ስለዚህ ስሙን። በቤት የሚቀመጥ ረዓብ ብዬ ጠርቼዋለሁ።\n" +
                "8 ፤ አሁንም ሂድ፥ ለሚመጣውም ዘመን ለዘላለም እንዲሆን በሰሌዳ ላይ በመጽሐፍም ውስጥ ጻፍላቸው።\n" +
                "9 ፤ ዓመፀኛ ወገንና የእግዚአብሔርን ሕግ ለመስማት የማይወድዱ የሐሰት ልጆች ናቸውና፤\n" +
                "10 ፤ ባለ ራእዮችን። አትመልከቱ ይላሉ፥ ነቢያትንም። ጣፋጩንና አታላዩን ነገር እንጂ ቅኑን ነገር አትንገሩን ከመንገድ ፈቀቅ በሉ፥\n" +
                "11 ፤ ከጐዳናውም ዘወር በሉ፥ የእስራኤልንም ቅዱስ ከእኛ ዘንድ አስወግዱ ይሉአቸዋል።\n" +
                "12 ፤ ስለዚህ የእስራኤል ቅዱስ እንዲህ ይላል። ይህችን ቃል አቃልላችኋልና፥ በግፍና በጠማምነት ታምናችኋልና፥ በእርሱም ተደግፋችኋልና\n" +
                "13 ፤ ስለዚህ ይህ በደል አዘብዝቦ ለመፍረስ እንደ ቀረበ፥ አፈራረሱም ፈጥኖ ድንገት እንደሚመጣ እንደ ረጅም ቅጥር ይሆንባችኋል።\n" +
                "14 ፤ የሸክለኛ ማድጋ እንደሚሰበር ይሰብረዋል፥ ሳይራራም ያደቅቀዋል፤ ከስባሪውም እሳት ከማንደጃ የሚወስዱበት ወይም ውኃ ከጕድጓድ የሚቀዱበት ገል አይገኝም።\n" +
                "15 ፤ የእስራኤል ቅዱስ፥ ጌታ እግዚአብሔር እንዲህ ይላልና። በመመለስና በማረፍ ትድናላችሁ፤ በጸጥታና በመታመን ኃይል ይሆንላችኋል፤ እናንተም እንቢ አላችሁ፥\n" +
                "16 ፤ ነገር ግን። በፈረስ ላይ ትቀምጠን እንሸሻለን እንጂ እንዲህ አይሆንም አላችሁ፥ ስለዚህም ትሸሻላችሁ፤ ደግሞም። በፈጣን ፈረስ ላይ እንቀመጣለን አላችሁ፥ ስለዚህም የሚያሳድዱአችሁ ፈጣኖች ይሆናሉ።\n" +
                "17 ፤ ከአንድ ሰው ዛቻ የተነሣ ሺህ ሰዎች ይሸሻሉ፤ እናንተም በተራራ ራስ ላይ እንዳለ ምሰሶ፥ በኮረብታም ላይ እንዳለ ምልክት ሆናችሁ እስክትቀሩ ድረስ፥ ከአምስት ሰዎች ዛቻ የተነሣ ትሸሻላችሁ።\n" +
                "18 ፤ እግዚአብሔርም የፍርድ አምላክ ነውና ስለዚህ እግዚአብሔር ይራራላችሁ ዘንድ ይታገሣል፥ ይምራችሁም ዘንድ ከፍ ከፍ ይላል፤ እርሱን በመተማመን የሚጠባበቁ ሁሉ ብፁዓን ናቸው።\n" +
                "19 ፤ በኢየሩሳሌም ውስጥ በጽዮን የምትኖሩ ሕዝብ ሆይ፥ ከእንግዲህ ወዲህ አታለቅስም፤ በጩኸትም ድምፅ ይራራልሃል፥ በሰማህም ጊዜ ይመልስልሃል።\n" +
                "20 ፤ ጌታም የጭንቀትን እንጀራና የመከራን ውኃ ቢሰጥህም አስተማሪህ እንግዲህ ከአንተ አይሰወርም፤ ዓይኖችህ ግን አስተማሪህን ያያሉ፥\n" +
                "21 ፤ ወደ ቀኝም ወደ ግራም ፈቀቅ ብትል ጆሮችህ በኋላህ። መንገዱ ይህች ናት በእርስዋም ሂድ የሚለውን ቃል ይሰማሉ።\n" +
                "22 ፤ በብርም የተለበጡትን የተቀረጹትን ምስሎችህን በወርቅም የተለበጡትን ቀልጠው የተሠሩትን ምስሎችህን ታረክሳለህ፤ እንደ ርኩስም ነገር ትጥላቸዋለህ። ወግዱ ትላቸውማለህ።\n" +
                "23 ፤ በምድርም ለተዘራው ዘርህ ዝናብ ይሰጣል፥ ከምድርም ፍሬ የሚወጣ እንጀራ ወፍራምና ብዙ ይሆናል። በዚያም ቀን ከብቶችህ በሰፊ መስክ ይሰማራሉ፤\n" +
                "24 ፤ መሬትንም የሚያርሱ በሬዎችና አህዮች በመንሽና በወንፊት የነጻውን ጨው ጨው የሚለውን ገፈራ ይበላሉ።\n" +
                "25 ፤ በታላቅም እልቂት ቀን ግንቦች በወደቁ ጊዜ በረጅሙ ተራራ ሁሉ ከፍ ባለውም ኮረብታ ሁሉ ላይ ወንዞችና የውኃ ፈሳሾች ይሆናሉ።\n" +
                "26 ፤ እግዚአብሔርም የሕዝቡን ስብራት በጠገነ ዕለት፥ መቅሰፍቱ የቈሰለውንም በፈወሰ ዕለት፥ የጨረቃ ብርሃን እንደ ፀሐይ ብርሃን፥ የፀሐይም ብርሃን እንደ ሰባት ቀን ብርሃን ሰባት እጥፍ ይሆናል።\n" +
                "27 ፤ እነሆ፥ የእግዚአብሔር ስም ከሚነድድ ቍጣ ከሚትጐለጐልም ጢስ ጋር ከሩቅ ይመጣል፤ ከንፈሮቹም ቍጣን የሞሉ ናቸው፥ ምላሱም እንደምትበላ እሳት ናት፤\n" +
                "28 ፤ እስትንፋሱም አሕዛብን በአጥፊ ወንፊት ሊነፋቸው እንደሚያጥለቀልቅ እስከ አንገትም እንደሚደርስ ወንዝ ነው፥ በሕዝብም መንጋጋ የሚያስት ልጓም ይሆናል።\n" +
                "29 ፤ ዝማሬ በተቀደሰች የዐውደ ዓመት ሌሊት እንደሚሆን ዝማሬ ይሆንላችኋል፤ ወደ እግዚአብሔርም ተራራ ወደ እስራኤል አምባ ይመጣ ዘንድ እንቢልታ ይዞ እንደሚሄድ ሰው የልብ ደስታ ይሆንላችኋል።\n" +
                "30 ፤ እግዚአብሔርም ክቡር ድምፁን ያሰማል፥ የክንዱንም መውረድ በሚነድድ ቍጣውና በምትበላ እሳት ነበልባል በዐውሎ ነፋስም በወጨፎም በበረዶ ጠጠርም ይገልጣል።\n" +
                "31 ፤ አሦርም በበትር ከመታው ከእግዚአብሔር ድምፅ የተነሣ ይደነግጣል።\n" +
                "32 ፤ እግዚአብሔር በላዩ በሚያወርድበት የታዘዘበቱ የበትር ድብደባ ሁሉ በከበሮና በመሰንቆ ይሆናል፤ በጦርነትም ክንዱን አንሥቶ ይዋጋቸዋል።\n" +
                "33 ፤ ከቀድሞም ጀምሮ የማቃጠያ ስፍራ ተዘጋጅታለች፥ ለንጉሥም ተበጅታለች፤ ጥልቅና ሰፊም አድርጎአታል፤ እሳትና ብዙ ማገዶ ተከምሮአል፤ የእግዚአብሔርም እስትንፋስ እንደ ዲን ፈሳሽ ያቃጥለዋል።\n"));

        return new Chapter(30, verses);
    }
    private Chapter chapterThirtyOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ስለ እርዳታ ወደ ግብጽ ለሚወርዱ በፈረሶችም ለሚደገፉ፥ ስለ ብዛታቸውም በሰረገሎች፥ እጅግ ብርቱዎችም ስለ ሆኑ በፈረሰኞች ለሚታመኑ፥ ወደ እስራኤልም ቅዱስ ለማይመለከቱ እግዚአብሔርንም ለማይፈልጉ ወዮላቸው!\n" +
                "2 ፤ እርሱ ግን ደግሞ ጠቢብ ነው፥ ክፉንም ነገር ያመጣል፥ ቃሉንም አይመልስም፥ በክፉም አድራጊዎች ቤት ላይ በደልንም በሚሠሩ ረዳት ላይ ይነሣል።\n" +
                "3 ፤ ግብጻውያን ሰዎች እንጂ አምላክ አይደሉም፥ ፈረሶቻቸውም ሥጋ እንጂ መንፈስ አይደሉም፤ እግዚአብሔርም እጁን በዘረጋ ጊዜ፥ ረጂው ይሰናከላል ተረጂውም ይወድቃል፥ ሁሉም በአንድ ላይ ይጠፋሉ።\n" +
                "4 ፤ እግዚአብሔርም እንዲህ ይለኛልና። አንበሳ ወይም የአንበሳ ደቦል በንጥቂያው ላይ ሲያገሳ፥ ብዙ እረኞች ቢከማቹበት ከቃላቸው እንደማይፈራ ከድምፃቸውም እንደማይዋረድ፥ እንዲሁ የሠራዊት ጌታ እግዚአብሔር በጽዮን ተራራና በኮረብታዋ ላይ ይዋጋ ዘንድ ይወርዳል።\n" +
                "5 ፤ እንደሚበርር ወፍ እንዲሁ የሠራዊት ጌታ እግዚአብሔር ኢየሩሳሌምን ይጋርዳታል፤ ይከልላታል፥ ይታደጋታል፥ አልፎም ያድናታል።\n" +
                "6 ፤ እናንተ የእስራኤል ልጆች ሆይ፥ አጥብቃችሁ ወደ ዐመፃችሁበት ተመለሱ።\n" +
                "7 ፤ በዚያም ቀን እያንዳንዳቸው እጆቻቸው ለኃጢአት የሠሩላቸውን የብሩንና የወርቁን ጣዖቶቻቸውን ይጥላሉ።\n" +
                "8 ፤ አሦርም የሰው ባልሆነ ሰይፍ ይወድቃል፥ የሰውም ያልሆነ ሰይፍ ይበላዋል፤ ከሰይፍም ይሸሻሉ ጐበዛዝቱም ገባሮች ይሆናሉ።\n" +
                "9 ፤ አምባው ከፍርሃት የተነሣ ያልፋል መሳፍንቱም ከዓላማው የተነሣ ይደነግጣሉ፥ ይላል እሳቱ በጽዮን እቶኑም በኢየሩሳሌም የሆነ እግዚአብሔር።\n"));
        // Add more verses as needed
        return new Chapter(31, verses);
    }

    private Chapter chapterThirtyTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እነሆ፥ ንጉሥ በጽድቅ ይነግሣል፥ መሳፍንትም በፍርድ ይገዛሉ።\n" +
                "2 ፤ ሰውም ከነፋስ እንደ መሸሸጊያ ከዐውሎ ነፋስም እንደ መጠጊያ፥ በጥም ቦታም እንደ ወንዝ ፈሳሽ፥ በበረሃም አገር እንደ ትልቅ ድንጋይ ጥላ ይሆናል።\n" +
                "3 ፤ የሚያዩትም ሰዎች ዓይኖች አይጨፈኑም፥ የሚሰሙትም ጆሮች ያደምጣሉ።\n" +
                "4 ፤ ጥንቃቄ የሌላቸው ሰዎች ልብ እውቀትን ታስተውላለች፥ የተብታቦችም ምላስ ደኅና አድርጋ ትናገራለች።\n" +
                "5 ፤ ከእንግዲህ ወዲህ ሰነፍ ከበርቴ ተብሎ አይጠራም፥ ንፉግም ለጋስ አይባልም።\n" +
                "6 ፤ ሰነፍ ግን ስንፍናን ይናገራል፥ ልቡም ዝንጉነትን ይፈጽም ዘንድ በእግዚአብሔርም ላይ ስሕተትን ይናገር ዘንድ የተራበችውንም ሰውነት ባዶ ያደርግ ዘንድ ከተጠማም ሰው መጠጥን ይቈርጥ ዘንድ በደልን ይሠራል።\n" +
                "7 ፤ የንፉግም ዕቃ ክፉ ናት፤ ችግረኛ ቅን ነገርን በተናገረ ጊዜ እንኳ እርሱ በሐሰት ቃል ድሀውን ያጠፋ ዘንድ ክፉን አሳብ ያስባል።\n" +
                "8 ፤ ከበርቴ ሰው ግን ለመከበር ያስባል፥ በመከበርም ጸንቶ ይኖራል።\n" +
                "9 ፤ እናንተ ዓለመኞች ሴቶች ሆይ፥ ተነሡ ድምፄንም ስሙ፤ እናንተ ተማምናችሁ የምትቀመጡ ሴቶች ልጆች ሆይ፥ ንግግሬን አድምጡ።\n" +
                "10 ፤ እናንተ ተማምናችሁ የምትቀመጡ ሴቶች ሆይ፥ ወይንን መቍረጥ ይጠፋልና፥ ፍሬም ማከማቸት አይመጣምና ከዓመትና ከጥቂት ቀን በኋላ ትንቀጠቀጣላችሁ።\n" +
                "11 ፤ እናንተ ዓለመኞች ሴቶች ሆይ፥ ተጠንቀቁ፤ ተማምናችሁም የምትቀመጡ ሆይ፥ ተንቀጥቀጡ፤ ልብሳችሁን አውልቁ፥ ዕራቁታችሁን ሁኑ፥ ወገባችሁንም በማቅ ታጠቁ።\n" +
                "12 ፤ ስለ ተወደደችውም እርሻ ስለሚያፈራውም ወይን ደረታችሁን ድቁ።\n" +
                "13 ፤ በሕዝቤ ምድር ላይ፥ በደስታ ከተማ ባሉት በደስታ ቤቶች ሁሉ ላይ እሾህና ኵርንችት ይወጣባቸዋል፤\n" +
                "14 ፤ አዳራሹ ወና ትሆናለችና፥ የብዙ ሰውም ከተማ ትለቀቃለችና፥ አምባውና ግንቡም ለዘላለም ዋሻ፥ የምድረ በዳም አህያ ደስታ፥ የመንጎችም ማሰማርያ ይሆናልና።\n" +
                "15 ፤ ይህም፥ መንፈስ ከላይ እስኪፈስስልን፥ ምድረ በዳውም ፍሬያማ እርሻ እስኪሆን፥ ፍሬያማውም እርሻ ዱር ተብሎ እስኪቈጠር ድረስ ይሆናል።\n" +
                "16 ፤ ከዚያ በኋላ ፍርድ በምድረ በዳ ይኖራል፥ ጽድቅም በፍሬያማው እርሻ ያድራል።\n" +
                "17 ፤ የጽድቅም ሥራ ሰላም፥ የጽድቅም ፍሬ ለዘላለም ጸጥታና መታመን ይሆናል።\n" +
                "18 ፤ ሕዝቤም በሰላም ማደሪያ በታመነም ቤት በጸጥተኛ ማረፊያ ይቀመጣል።\n" +
                "19 ፤ በረዶ ግን በዱር ላይ ይወርዳል፥ ከተማም ፈጽማ ትዋረዳለች።\n" +
                "20 ፤ እናንተ የበሬና የአህያ እግር እየነዳችሁ በውኃ ሁሉ አጠገብ የምትዘሩ ብፁዓን ናችሁ።\n" ));
        // Add more verses as needed
        return new Chapter(32, verses);
    }

    private Chapter chapterThirtyThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ አንተ ሳትጠፋ የምታጠፋ፥ በአንተም ላይ ወንጀል ሳይደረግ ወንጀል የምታደርግ ወዮልህ! ማጥፋትን በተውህ ጊዜ ትጠፋለህ፤ መወንጀልንም በተውህ ጊዜ ይወነጅሉሃል።\n" +
                "2 ፤ አቤቱ፥ ማረን፤ አንተን ተማምነናል፤ ጥዋት ጥዋት ክንድ በመከራም ጊዜ ማዳን ሁነን።\n" +
                "3 ፤ ከፍጅት ድምፅ ወገኖች ሸሹ፥ በመነሣትህም አሕዛብ ተበተኑ።\n" +
                "4 ፤ አንበጣ እንደሚሰበስብ ምርኮአችሁ ትሰበሰባለች፥ ኩብኩባም እንደሚዘልል ሰዎች ይዘልሉበታል።\n" +
                "5 ፤ እግዚአብሔር በአርያም ተቀምጦአልና ከፍ ከፍ አለ፤ ጽዮንን በፍርድና በጽድቅ ሞላት።\n" +
                "6 ፤ የዘመንህም ጸጥታ፥ የመድኃኒት ብዛት፥ ጥበብና እውቀት ይሆናል፤ እግዚአብሔርን መፍራት መዝገቡ ነው።\n" +
                "7 ፤ እነሆ፥ ኃይለኞቻቸው በሜዳ ይጮኻሉ፤ የሰላም መልእክተኞች መራራ ልቅሶ ያለቅሳሉ።\n" +
                "8 ፤ መንገዶች ባድማ ሆኑ፥ ተላላፊም ቀረ፤ እርሱም ቃል ኪዳንን አፈረሰ ከተሞችንም ናቀ ሰውንም አልተመለከተም።\n" +
                "9 ፤ ምድሪቱ አለቀሰች ከሳችም፤ ሊባኖስ አፈረ ጠወለገም፤ ሳሮን እንደ ምድረ በዳ ሆነ፤ ባሳንና ቀርሜሎስ ቅጠላቸውን አረገፉ።\n" +
                "10 ፤ አሁን እነሣለሁ ይላል እግዚአብሔር፤ አሁን እከበራለሁ፤ አሁን ከፍ ከፍ እላለሁ።\n" +
                "11 ፤ ገለባን ትፀንሳላችሁ፥ እብቅንም ትወልዳላችሁ፤ እስትንፋሳችሁ የምትበላችሁ እሳት ናት።\n" +
                "12 ፤ አሕዛብም እንደ ተቃጠለ ኖራ፥ ተቈርጦም በእሳት እንደ ተቃጠለ እሾህ ይሆናሉ።\n" +
                "13 ፤ እናንተ በሩቅ ያላችሁ የሠራሁትን ስሙ፥ እናንተም በቅርብ ያላችሁ ኃይሌን እወቁ።\n" +
                "14 ፤ በጽዮን ያሉ ኃጢአተኞች ፈሩ፤ መንቀጥቀጥ ዝንጉዎቹን ያዘ፤ ከምትበላ እሳት ጋር መኖርን የሚችል ከእኛ ማን አለ? ለዘላለምም ከምትነድድ እሳት ጋር መኖርን የሚችል ከእኛ ማን አለ?\n" +
                "15 ፤ በጽድቅ የሚሄድ ቅን ነገርንም የሚናገር፥ በሽንገላ የሚገኝ ትርፍን የሚንቅ፥ መማለጃን ከመጨበጥ እጁን የሚያራግፍ፥ ደም ማፍሰስን ከመስማት ጆሮቹን የሚያደነቍር፥ ክፋትንም ከማየት ዓይኖቹን የሚጨፍን ነው።\n" +
                "16 ፤ እርሱ ከፍ ባለ ስፍራ ይቀመጣል፤ ጠንካራ አምባ መጠጊያው ይሆናል፤ እንጀራም ይሰጠዋል፥ ውኃውም የታመነች ትሆናለች።\n" +
                "17 ፤ ዓይኖችህ ንጉሥን በውበቱ ያዩታል፤ እነርሱም በሩቅ ያለች ምድርን ያዩአታል።\n" +
                "18 ፤ ልብህም። ጸሐፊ ወዴት አለ? መዛኝስ ወዴት አለ? ግንቦቹንስ የቈጠረ ወዴት አለ? ብሎ የሚያስፈራ ነገር ያስባል።\n" +
                "19 ፤ ጨካኝን ሕዝብ፥ ቋንቋው ለማስተዋል ጥልቅ የሆነውንና አንደበቱ ለማስተዋል ጸያፍ የሆነውን ሕዝብ፥ አታይም።\n" +
                "20 ፤ የበዓላችንን ከተማ ጽዮንን ተመልከት፤ ዓይኖችህ የሰላም ማደሪያ፥ ካስማውም ለዘላለም የማይነቀል አውታሩም ሁሉ የማይበጠስ፥ የማይወገድ ድንኳን የሆነውን ኢየሩሳሌምን ያያሉ።\n" +
                "21 ፤ እግዚአብሔር በዚያ የሰፉ ወንዞችና የመስኖች ስፍራ ሆኖ ከእኛ ጋር በግርማ ይሆናል፤ የሚቀዘፉ መርከቦች አይገቡባትም፥ ታላላቆችም መርከቦች አያልፉባትም።\n" +
                "22 ፤ እግዚአብሔር ፈራጃችን ነው፥ እግዚአብሔር ሕግን ሰጪያችን ነው፥ እግዚአብሔር ንጉሣችን ነው፤ እርሱ ያድነናል።\n" +
                "23 ፤ ገመዶችህ ላልተዋል፥ ደቀላቸውንም አላጸኑም፥ ሸራውንም መዘርጋት አልቻሉም። በዚያም ጊዜ የብዙ ምርኮ ብዝበዛ ተከፈለ፤ አንካሶች እንኳ ብዝበዛውን በዘበዙ።\n" +
                "24 ፤ በዚያም የሚቀመጥ። ታምሜአለሁ አይልም፥ በእርስዋም ለሚቀመጡ ሰዎች በደላቸው ይቅር ይባልላቸዋል።\n"));
        // Add more verses as needed
        return new Chapter(33, verses);
    }

    private Chapter chapterThirtyFour() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እናንተ አሕዛብ ሆይ፥ ቅረቡ፥ ስሙ፤ እናንተ ወገኖች ሆይ፥ አድምጡ፤ ምድርና ሙላዋ፥ ዓለምና ከእርስዋ የሚወጣ ሁሉ ይስሙ።\n" +
                "2 ፤ የእግዚአብሔር ቍጣ በአሕዛብ ሁሉ ላይ መዓቱም በሠራዊታቸው ሁሉ ላይ ነው፤ ፈጽሞ አጠፋቸው፥ ለመታረድም አሳልፎ ሰጣቸው።\n" +
                "3 ፤ ከእነርሱም የተገደሉት ይጣላሉ፥ የሬሳቸውም ግማት ይሸታል፥ ተራሮችም ከደማቸው የተነሣ ይርሳሉ።\n" +
                "4 ፤ የሰማይም ሠራዊት ሁሉ ይበሰብሳሉ፥ ሰማያትም እንደ መጽሐፍ ጥቅልል ይጠቀለላሉ፥ ከወይንና ከበለስም ቅጠል እንደሚረግፍ ሠራዊታቸው ሁሉ ይረግፋል።\n" +
                "5 ፤ ሰይፌ በሰማይ ሆና እስክትረካ ድረስ ጠጥታለች፤ እነሆ፥ በኤዶምያስና በረገምሁት ሕዝብ ላይ ለፍርድ ትወርዳለች።\n" +
                "6 ፤ እግዚአብሔር መሥዋዕት በባሶራ፥ ታላቅም እርድ በኤዶምያስ ምድር አለውና የእግዚአብሔር ሰይፍ በደም ተሞልታለች፥ በስብም፥ በበግ ጠቦትና በፍየል ደምም፥ በአውራም በግ ኵላሊት ስብ ወፍራለች።\n" +
                "7 ፤ ጎሽ ከእነርሱ ጋር፥ ወይፈኖችም ከኮርማዎች ጋር ይወድቃሉ፤ ምድራቸውም በደም ትረካለች፥ አፈራቸውም በስብ ትወፍራለች።\n" +
                "8 ፤ የእግዚአብሔር የበቀሉ ቀን፥ ስለ ጽዮንም ክርክር የብድራት ዓመት ነው።\n" +
                "9 ፤ የኤዶምያስም ፈሳሾች ዝፍት ሆነው ይለወጣሉ፥ አፈርዋም ዲን ይሆናል፥ መሬትዋም የሚቀጠል ዝፍት ትሆናለች።\n" +
                "10 ፤ በሌሊትና በቀንም አትጠፋም፥ ጢስዋም ለዘላለም ይወጣል፤ ከትውልድ እስከ ትውልድም ድረስ ባድማ ሆና ትኖራለች፤ ለዘላለም ዓለም ማንም አያልፍባትም።\n" +
                "11 ፤ ጭልፊትና ጃርት ግን ይወርሱአታል፤ ጕጕትና ቍራም ይኖሩባታል፤ በላይዋም የመፍረስ ገመድና የባዶነት ቱንቢ ይዘረጋባታል።\n" +
                "12 ፤ መሳፍንቶችዋን ወደ መንግሥት ይጠራሉ፥ ነገር ግን ማንም አይገኝባትም፤ አለቆችዋም ሁሉ ምናምኖች ይሆናሉ።\n" +
                "13 ፤ በአዳራሾችዋም እሾህ በቅጥሮችዋም ሳማን አሜከላ ይበቅሉባታል፤ የቀበሮም ማደሪያና የሰጐን ስፍራ ትሆናለች።\n" +
                "14 ፤ የምድረ በዳም አራዊት ከተኵሎች ጋር ይገናኛሉ፥ አጋንንትም እርስ በርሳቸው ይጠራራሉ፤ ጅንም በዚያ ትኖራለች ለእርስዋም ማረፊያ ታገኛለች።\n" +
                "15 ፤ በዚያም ዋሊያ ቤትዋን ትሠራለች እንቍላልም ትጥላለች ትቀፈቅፈውማለች ልጆችዋንም በጥላዋ ትሰበስባለች፤ በዚያም ደግሞ አሞራዎች እያንዳንዳቸው ከባልንጀሮቻቸው ጋር ይሰበሰባሉ።\n" +
                "16 ፤ በእግዚአብሔር መጽሐፍ ፈልጉ አንብቡም፤ አፌ አዝዞአልና፥ መንፈሱም ሰብስቦአቸዋልና ከእነዚህ አንዲት አትጠፋም፥ ባልንጀራውንም የሚያጣ የለም።\n" +
                "17 ፤ እርሱም ዕጣ ጣለባቸው፥ እጁም በገመድ ከፈለችላቸው፤ ለዘላለም ይገዙአታል፥ ከትውልድም እስከ ትውልድ ድረስ ይቀመጡባታል።\n"));
        // Add more verses as needed
        return new Chapter(34, verses);
    }
    private Chapter chapterThirtyFive() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ምድረ በዳውና ደረቁ ምድር ደስ ይላቸዋል፥ በረሀውም ሐሤት ያደርጋል እንደ ጽጌ ረዳም ያብባል።\n" +
                "2 ፤ እጅግ ያብባል በደስታና በዝማሬ ሐሤትን ያደርጋል፤ የሊባኖስ ክብር፥ የቀርሜሎስና የሳሮን ግርማ ይሰጠዋል፤ የእግዚአብሔርንም ክብር የአምላካችንንም ግርማ ያያሉ።\n" +
                "3 ፤ የደከሙትን እጆች አበርቱ፥ የላሉትንም ጕልበቶች አጽኑ።\n" +
                "4 ፤ ፈሪ ልብ ላላቸው። እነሆ፥ አምላካችሁ በበቀል በእግዚአብሔርም ብድራት ይመጣልና፥ መጥቶም ያድናችኋልና በርቱ፥ አትፍሩ በሉአቸው።\n" +
                "5 ፤ በዚያን ጊዜም የዕውሮች ዓይን ይገለጣል፤ የደንቆሮችም ጆሮ ይከፈታል።\n" +
                "6 ፤ በዚያን ጊዜ አንካሳ እንደ ሚዳቋ ይዘልላል፥ የድዳም ምላስ ይዘምራል፤ በምድረ በዳ ውኃ፥ በበረሀም ፈሳሽ ይፈልቃልና።\n" +
                "7 ፤ ደረቂቱ ምድር ኵሬ፥ የጥማት መሬት የውኃ ምንጭ ትሆናለች፤ ቀበሮ የተኛበት መኖሪያ ልምላሜና ሸምበቆ ደንገልም ይሆንበታል።\n" +
                "8 ፤ በዚያም ጐዳናና መንገድ ይሆናል እርሱም የተቀደሰ መንገድ ይባላል፤ ንጹሐንም ያልሆኑ አያልፉበትም፥ ለንጹሐን ግን ይሆናል፤ ተላላፊዎችና ሰነፎች እንኳ አይስቱበትም።\n" +
                "9 ፤ አንበሳም አይኖርበትም፥ ነጣቂ አውሬም አይወጣበትም፥ ከዚያም አይገኙም፤ የዳኑት ግን በዚያ ይሄዳሉ፤\n" +
                "10 ፤ እግዚአብሔርም የተቤዣቸው ይመለሳሉ እየዘመሩም ወደ ጽዮን ይመጣሉ፤ የዘላለም ደስታ በራሳቸው ላይ ይሆናል፤ ሐሤትንና ደስታን ያገኛሉ፥ ኀዘንና ትካዜም ይሸሻሉ።\n"));

        return new Chapter(35, verses);
    }

    private Chapter chapterThirtySix() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እንዲህም ሆነ፤ በንጉሡ በሕዝቅያስ በአሥራ አራተኛው ዓመት የአሦር ንጉሥ ሰናክሬም ወደ ይሁዳ ወደ ተመሸጉት ከተሞች ሁሉ ወጥቶ ወሰዳቸው።\n" +
                "2 ፤ የአሦርም ንጉሥ ራፋስቂስን ከብዙ ሠራዊት ጋር ከለኪሶ ወደ ንጉሡ ወደ ሕዝቅያስ ወደ ኢየሩሳሌም ላከ፥ እርሱም በአጣቢው እርሻ መንገድ ባለችው በላይኛይቱ ኵሬ መስኖ አጠገብ ቆመ።\n" +
                "3 ፤ የቤቱም አዛዥ የኬልቅያስ ልጅ ኤልያቄም ጸሐፊውም ሳምናስ ታሪክ ጸሐፊም የአሳፍ ልጅ ዮአስ ወደ እርሱ ወጡ።\n" +
                "4 ፤ ራፋስቂስም አላቸው። ለሕዝቅያስ እንዲህ ብላችሁ ንገሩት። ታላቁ የአሦር ንጉሥ እንዲህ ይላል። ይህ የምትታመንበት መተማመኛ ምንድር ነው?\n" +
                "5 ፤ እኔ። ለሰልፍ የሆነው ምክርህና ኃያልህ ከንቱ ነገር ነው አልሁ፤ አሁንም በእኔ ላይ ያመፅኸው በማን ተማምነህ ነው?\n" +
                "6 ፤ እነሆ፥ በዚህ በተቀጠቀጠ በሸምበቆ በትር በግብጽ ትታመናለህ፤ ሰው ቢመረኰዘው ተሰብሮ በእጁ ይገባል ያቈስለውማል የግብጽ ንጉሥ ፈርዖን ለሚታመኑበት ሁሉ አንዲሁ ነው።\n" +
                "7 ፤ አንተም። በአምላካችን በእግዚአብሔር እንታመናለን ብትለኝ፥ ሕዝቅያስ ይሁዳንና ኢየሩሳሌምን። በዚህ መሠዊያ ፊት ስገዱ ብሎ የኮረብታ መስገጃዎቹንና መሠዊያዎቹን ይስፈረሰ ይህ አይደለምን?\n" +
                "8 ፤ አሁን እንግዲህ ከጌታዬ ከአሦር ንጉሥ ጋር ተወራረድ፥ የሚቀመጡባቸውንም ሰዎች ማግኘት ቢቻልህ እኔ ሁለት ሺህ ፈረሶች እሰጥሃለሁ።\n" +
                "9 ፤ ስለ ሰረገሎችና ስለ ፈረሶኞች በግብጽ ስትታመን፥ ከጌታዬ ባሪያዎች የሚያንሰውን የአንዱን አለቃ ፊት ትቃወም ዘንድ እንዴት ይቻልሃል?\n" +
                "10 ፤ አሁንም በውኑ ያለ እግዚአብሔር ትእዛዝ ይህን አገር አጠፋ ዘንድ ወጥቻለሁን? እግዚአብሔር። ወደዚህ አገር ወጥተህ አጥፋው አለኝ።\n" +
                "11 ፤ ኤልያቄምና ሳምናስ ዮአስም ራፋስቂስን። እኛ እንሰማለንና እባክህ፥ በሶርያ ቋንቋ ለባሪያዎችህ ተናገር፤ በቅጥርም ላይ ባለው ሕዝብ ጆሮ በአይሁድ ቋንቋ አትናገረን አሉት።\n" +
                "12 ፤ ራፋስቂስ ግን። ጌታዬ ይህን ቃል እናገር ዘንድ ወደ አንተና ወደ ጌታህ ልኮኛልን? ከእናንተ ጋር ኵሳቸውን ይበሉ ዘንድ ሽንታቸውንም ይጠጡ ዘንድ በቅጥር ላይ ወደ ተቀመጡት ሰዎች አይደለምን? አላቸው።\n" +
                "13 ፤ ራፋስቂስም ቆሞ በታላቅ ድምፅ በአይሁድ ቋንቋ እንዲህ ብሎ ጮኸ። የታላቁን የአሦርን ንጉሥ ቃል ስሙ።\n" +
                "14 ፤ ንጉሡ እንዲህ ይላል። ያድናችሁ ዘንድ አይችልምና ሕዝቅያስ አያታልላችሁ፤\n" +
                "15 ፤ ሕዝቅያስም። እግዚአብሔር በእርግጥ ያድነናል ይህችም ከተማ በአሦር ንጉሥ እጅ አትሰጥም ብሎ በእግዚአብሔር እንድትታመኑ አያድርጋችሁ።\n" +
                "16 ፤ ሕዝቅያስንም አትስሙ፤ የአሦር ንጉሥ እንዲህ ይላል። ከእኔ ጋር ታረቁ ወደ እኔም ውጡ፤ እያንዳንዳችሁም ከወይናችሁና ከበለሳችሁ ብሉ፥ ከጕድጓዳችሁም ውኃ ጠጡ፤\n" +
                "17 ፤ ይህም መጥቼ ምድራችሁን ወደምትመስለው ምድር፥ እህልና የወይን ጠጅ፥ እንጀራና ወይን ወዳለበት ምድር እስካፈልሳችሁ ድረስ ነው።\n" +
                "18 ፤ ሕዝቅያስም። እግዚአብሔር ያድነናል ብሎ እንዳያታልላችሁ ተጠንቀቁ። በውኑ የአሕዛብ አማልክት አገሮቻቸውን ከአሦር ንጉሥ እጅ አድነዋቸዋልን?\n" +
                "19 ፤ የሐማትና የአርፋድ አማልክት ወዴት አሉ? የሴፈርዋይም አማልክት ወዴት አሉ? ሰማርያን ከእጄ አድነዋታልን?\n" +
                "20 ፤ እግዚአብሔር ኢየሩሳሌምን ከእጄ ያድን ዘንድ ከእነዚህ አገሮች አማልክት ሁሉ አገሩን ከእጄ ያዳነ ማን ነው?\n" +
                "21 ፤ እነርሱም ዝም አሉ፥ አንዳችም አልመለሱለትም፤ ንጉሡ አንዳይመልሱለት አዝዞ ነበርና።\n" +
                "22 ፤ የቤቱ አዛዥ የኬልቅያስ ልጅ ኤልያቄም ጸሐፊውም ሳምናስ ታሪክ ጸሐፊም የአሳፍ ልጅ ዮአስ ልብሳቸውን ቀድደው ወደ ሕዝቅያስ መጡ፥ የራፋስቂስንም ቃል ነገሩት።\n" ));

        return new Chapter(36, verses);
    }

    private Chapter chapterThirtySeven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እንዲህም ሆነ፤ ንጉሡ ሕዝቅያስ ይህን በሰማ ጊዜ ልብሱን ቀደደ፥ ማቅም ለበሰ፥ ወደ እግዚአብሔርም ቤት ገባ።\n" +
                "2 ፤ የቤቱንም አዛዥ ኤልያቄምን ጸሐፊውንም ሳምናስን የካህናቱንም ሽማግሌዎች ማቅ ለብሰው ወደ ነቢዩ ወደ አሞጽ ልጅ ወደ ኢሳይያስ ይሄዱ ዘንድ ላካቸው።\n" +
                "3 ፤ እነርሱም። ሕዝቅያስ እንዲህ ይላል። ይህ ቀን የመከራና የተግሣጽ የዘለፋም ቀን ነው፤ ልጆች የሚወለዱበት ጊዜ ደርሶአል ለመውለድም ኃይል የለም።\n" +
                "4 ፤ ምናልባት በሕያው አምላክ ላይ ይገዳደር ዘንድ ጌታው የአሦር ንጉሥ የላከውን የራፋስቂስን ቃል አምላክህ እግዚአብሔር ይሰማ እንደ ሆነ፥ አምላክህ እግዚአብሔር ስለ ሰማው ቃል ይገሥጸው እንደ ሆነ፥ ስለዚህ ለቀረው ቅሬታ ጸልይ አሉት።\n" +
                "5 ፤ እንዲሁ የንጉሡ የሕዝቅያስ ባሪያዎች ወደ ኢሳይያስ መጡ።\n" +
                "6 ፤ ኢሳይያስም። ለጌታችሁ። እግዚአብሔር እንዲህ ይላል። የአሦር ንጉሥ ባሪያዎች ስለ ሰደቡኝ፥ ስለ ሰማኸው ቃል አትፍራ።\n" +
                "7 ፤ እነሆ፥ በላዩ መንፈስን እሰድዳለሁ፥ ወሬንም ይሰማል፥ ወደ ምድሩም ይመለሳል፤ በምድሩም በሰይፍ እንዲወድቅ አደርጋለሁ በሉት አላቸው።\n" +
                "8 ፤ የአሦርም ንጉሥ ከለኪሶ እንደ ራቀ ሰምቶ ነበርና ራፋስቂስ ተመልሶ በልብና ሲዋጋ አገኘው።\n" +
                "9 ፤ እርሱም። የኢትዮጵያ ንጉሥ ቲርሐቅ ሊዋጋህ መጥቶአል የሚል ወሬ ሰማ። በሰማም ጊዜ ወደ ሕዝቅያስ መልእክተኞችን ላከ፥\n" +
                "10 ፤ እንዲህ ሲል። ለይሁዳ ንጉሠ ለሕዝቅያስ እንዲህ ብላችሁ ንገሩት። ኢየሩሳሌም በአሦር ንጉሥ እጅ አትሰጥም ብሎ የምትታመንበት አምላክህ አያታልልህ።\n" +
                "11 ፤ እነሆ፥ የአሦር ነገሥታት በምድር ሁሉ ላይ ያደረጉትን፥ እንዴትስ እንዳጠፉአቸው ሰምተሃል፤ አንተስ ትድናለህን?\n" +
                "12 ፤ አባቶቼ ያጠፉአቸውን ጎዛንን፥ ካራንን፥ ራፊስን፥ በተላሳር የነበሩትንም የዔድንን ልጆች የአሕዛብ አማልክት አዳኑአቸውን?\n" +
                "13 ፤ የሐማት ንጉሥ፥ የአርፋድ ንጉሥ፥ የሴፈርዋይም ከተማ ንጉሥ፥ የሄናና የዒዋ ንጉሥ ወዴት አሉ?\n" +
                "14 ፤ ሕዝቅያስም ደብዳቤውን ከመልእክተኞች እጅ ተቀብሎ አነበበው፤ ሕዝቅያስም ወደ እግዚአብሔር ቤት ወጥቶ በእግዚአብሔር ፊት ዘረጋው።\n" +
                "15 ፤ ሕዝቅያስም ወደ እግዚአብሔር እንዲህ ብሎ ጸለየ።\n" +
                "16 ፤ አቤቱ፥ በኪሩቤል ላይ የምትቀመጥ የእስራኤል አምላክ የሠራዊት ጌታ ሆይ፥ አንተ ብቻህን የምድር መንግሥታት ሁሉ አምላክ ነህ፤ ሰማይንና ምድርን ፈጥረሃል።\n" +
                "17 ፤ አቤቱ፥ ጆሮህን አዘንብልና ስማ፤ አቤቱ፥ ዓይንህን ክፈትና እይ፤ በሕያው አምላክ ላይ ይገዳደር ዘንድ የላከውን የሰናክሬም ቃል ስማ።\n" +
                "18 ፤ አቤቱ፥ በእውነት የአሦር ነገሥታት ዓለሙን ሁሉ አገሮቻቸውንም አፍርሰዋል፥\n" +
                "19 ፤ አማልክቶቻቸውንም በእሳት ላይ ጥለዋል፤ የእንጨትና የድንጋይ የሰው እጅ ሥራ ነበሩ እንጂ አማልክት አልነበሩምና ስለዚህ አጥፍተዋቸዋል።\n" +
                "20 ፤ እንግዲህም አምላካችን አቤቱ፥ የምድር መንግሥታት ሁሉ አንተ ብቻ እግዚአብሔር እንደ ሆንህ ያውቁ ዘንድ ከእጁ አድነን።\n" +
                "21 ፤ የአሞጽ ልጅ ኢሳይያስ እንዲህ ብሎ ወደ ሕዝቅያስ ላከ። የእስራኤል አምላክ እግዚአብሔር እንዲህ ይላል። ስለ አሦር ንጉሥ ስለ ሰናክሬም ወደ እኔ ለምነሃልና\n" +
                "22 ፤ እግዚአብሔር ስለ እርሱ የተናገረው ቃል ይህ ነው። ድንግሊቱ የጽዮን ልጅ ቀላል አድርጋሃለች፥ በንቀትም ስቃብሃለች፤ የኢየሩሳሌም ልጅ ራስዋን ነቅንቃብሃለች።\n" +
                "23 ፤ የተገዳደርኸው የሰደብኸውስ ማን ነው? ቃልህንስ ከፍ ከፍ ያደረግህበት ዓይንህንስ ወደ ላይ ያነሣህበት ማን ነው? በእስራኤል ቅዱስ ላይ ነው።\n" +
                "24 ፤ አንተም። በሰረገላዬ ብዛት ወደ ተራሮች ከፍታ፥ ወደ ሊባኖስ ጥግ ላይ ወጥቻለሁ፤ ረጃጅሞቹንም ዝግባዎች የተመረጡትንም ጥዶች እቈርጣለሁ፥ ወደ ከፍታውም ዳርቻ ወደ ቀርሜሎስ ዱር እገባለሁ።\n" +
                "25 ፤ ቈፈርሁም ውኃም ጠጣሁ የግብጽንም ወንዞች ሁሉ በእግሬ ጫማ አደርቃለሁ ብለህ በባሪያዎችህ እጅ በጌታ ላይ ተገዳደርህ።\n" +
                "26 ፤ እኔ ጥንቱን እንደ ሠራሁት፥ ቀድሞውንም እንዳደረግሁት አልሰማህምን? አሁንም የተመሸጉትን ከተሞች የፍርስራሽ ክምር እስኪሆኑ ድረስ እንድታፈርስ አደረግሁህ።\n" +
                "27 ፤ ስለዚህ የሚኖሩባቸው ሰዎች እጃቸው ዝሎአል፥ ደንግጠውም ታውከዋል፤ እንደ ምድረ በዳ ሣር፥ እንደ ለመለመም ቡቃያ፥ በሰገነትም ላይ እንዳለ ሣር፥ ሳይሸት ዋግ እንደ መታው እህል ሆነዋል።\n" +
                "28 ፤ እኔ ግን መቀመጫህንና መውጫህን መግቢያህንም በእኔም ላይ የተቈጣኸውን ቍጣ አውቄአለሁ።\n" +
                "29 ፤ ቍጣህና ትዕቢትህ ወደጆሮዬ ደርሶአልና ስለዚህ ስናጋዬን በአፍንጫህ ልጓሜንም በከንፈርህ አደርጋለሁ፥ በመጣህበትም መንገድ እመልስሃለሁ።\n" +
                "30 ፤ ይህም ምልክት ይሆንሃል፤ በዚህ ዓመት የገቦውን፥ በሁለተኛውም ዓመት ከገቦው የበቀለውን ትበላላችሁ፤ በሦስተኛውም ዓመት ትዘራላችሁ ታጭዱማላችሁ፥ ወይንም ትተክላላችሁ ፍሬውንም ትበላላችሁ።\n" +
                "31 ፤ ያመለጠው የይሁዳ ቤት ቅሬታ ሥሩን ወደ ታች ይሰድዳል፥ ወደ ላይም ያፈራል።\n" +
                "32 ፤ ከኢየሩሳሌም ቅሬታ ከጽዮንም ተራራ ያመለጡት ይወጣሉና፤ የሠራዊት ጌታ የእግዚአብሔር ቅንዓት ይህን ያደርጋል።\n" +
                "33 ፤ ስለዚህም እግዚአብሔር ስለ አሦር ንጉሥ እንዲህ ይላል። ወደዚች ከተማ አይመጣም፥ ፍላጻንም አይወረውርባትም፥ በጋሻም አይመጣባትም፥ የአፈርንም ድልድል አይደለድልባትም።\n" +
                "34 ፤ በመጣበት መንገድ በዚያው ይመለሳል፥ ወደዚችም ከተማ አይመጣም ይላል እግዚአብሔር።\n" +
                "35 ፤ ስለ እኔም ስለ ባሪያዬም ስለ ዳዊት ይህችን ከተማ አድናት ዘንድ እጋርዳታለሁ።\n" +
                "36 ፤ የእግዚአብሔርም መልአክ ወጣ፥ ከአሦራውያንም ሰፈር መቶ ሰማንያ አምስት ሺህ ገደለ፤ ማለዳም በተነሡ ጊዜ፥ እነሆ፥ ሁሉ በድኖች ነበሩ።\n" +
                "37 ፤ የአሦርም ንጉሥ ሰናክሬም ተነሥቶ ሄደ፥ ተመልሶም በነነዌ ተቀመጠ።\n" +
                "38 ፤ በአምላኩም በናሳራክ ቤት ሲሰግድ ልጆቹ አድራሜሌክና ሳራሳር በሰይፍ ገደሉት፤ ወደ አራራትም አገር ኰበለሉ። ልጁም አስራዶን በእርሱ ፋንታ ነገሠ።\n"));

        return new Chapter(37, verses);
    }

    private Chapter chapterThirtyEight() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በዚያም ወራት ሕዝቅያስ ለሞት እስኪደርስ ታመመ። ነቢዩም የአሞጽ ልጅ ኢሳይያስ ወደ እርሱ መጥቶ። እግዚአብሔር እንዲህ ይላል። ትሞታለህ እንጂ በሕይወት አትኖርምና ቤትህን አስተካክል አለው።\n" +
                "2 ፤ ሕዝቅያስም ፊቱን ወደ ግድግዳው መልሶ እንዲህ ሲል ወደ እግዚአብሔር ጸለየ።\n" +
                "3 ፤ አቤቱ፥ በፊትህ በእውነትና በፍጹም ልብ እንደ ሄድሁ ደስ የሚያሰኝህንም እንዳደረግሁ ታስብ ዘንድ እለምንሃለሁ። ሕዝቅያስም እጅግ አድርጎ አለቀሰ።\n" +
                "4 ፤ የእግዚአብሔርም ቃል ወደ ኢሳይያስ እንዲህ ሲል መጣ።\n" +
                "5 ፤ ሂድ፥ ሕዝቅያስን እንዲህ በለው። የአባትህ የዳዊት አምላክ እግዚአብሔር እንዲህ ይላል። ጸሎትህን ሰምቻለሁ፥ እንባህንም አይቻለሁ፤ እነሆ፥ በዕድሜህ ላይ አሥራ አምስት ዓመት አጨምራለሁ።\n" +
                "6 ፤ አንተንና ይህችንም ከተማ ከአሦር ንጉሥ እጅ እታደጋለሁ፥ ይህችንም ከተማ እጋርዳታለሁ።\n" +
                "7 ፤ እግዚአብሔርም የተገረውን ነገር እንዲፈጽመው ከእግዚአብሔር ዘንድ ምልክቱ ይህ ይሆንልሃል።\n" +
                "8 ፤ እነሆ፥ በአካዝ የጥላ ስፍረ ሰዓት ላይ ከፀሐይ ጋር የወረደውን በደረጃዎች ያለውን ጥላ አሥር ደረጃ ወደ ኋላ እንዲመለስ አደርጋለሁ። ፀሐይም በጥላ ስፍረ ሰዓት ላይ የወረደበት አሥር ደረጃ ወደ ኋላ ተመለሰ።\n" +
                "9 ፤ የይሁዳ ንጉሥ ሕዝቅያስ ታምሞ ከደዌው በተፈወሰ ጊዜ የጻፈው ጽሕፈት ይህ ነው።\n" +
                "10 ፤ እኔ። በሕይወት ዘመኔ መካከል ወደ ሲኦል በሮች እገባለሁ፤ የቀረው ዘመኔ ጐደለብኝ አልሁ።\n" +
                "11 ፤ ደግሞም። በሕያዋን ምድር እግዚአብሔርን አላይም፤ በዓለምም ከሚኖሩ ጋር ሰውን እንግዲህ አልመለከትም አልሁ።\n" +
                "12 ፤ ማደሪያዬ ተነቀለች፥ እንደ እረኛ ድንኳንም ከእኔ ዘንድ ተወገደች፤ ሕይወቴንም እንደ ሸማኔ ጠቀለልሁ፥ እርሱም ከመጠቅለያው ይቈርጠኛል፤ ከማለዳም ጀምሮ እስከ ማታ ድረስ ታጠፋኛለህ።\n" +
                "13 ፤ እስኪነጋ ድረስ ቈይቼ ነበር፤ እርሱ እንደ አንበሳ አጥንቴን ሁሉ ሰበረ፤ ከማለዳ ጀምሮ እስከ ማታ ድረስ ታጠፋኛለህ።\n" +
                "14 ፤ እንደ ጨረባና እንደ ሽመላ ተንጫጫሁ፥ እንደ ርግብም አጕረመረምሁ፤ ዓይኖቼ ወደ ላይ ከማየት ደከሙ። ጌታ ሆይ፥ ተጨንቄአለሁና መከታ ሁነኝ።\n" +
                "15 ፤ ምን እላለሁ? እርሱ ተናግሮኛል፥ እርሱ ራሱም ይህን አድርጎአል፤ በዘመኔ ሁሉ ስለ ነፍሴ ምሬት ቀስ ብዬ እሄዳለሁ።\n" +
                "16 ፤ ጌታ ሆይ፥ በዚህ ነገር ሰዎች በሕይወት ይኖራሉ፥ በዚህም ሁሉ የመንፈሴ ሕይወት ነው፤ አንተም ፈወስኸኝ ወደ ሕይወትም መለስኸኝ።\n" +
                "17 ፤ እነሆ፥ ታላቅ ምሬት ለደኅንነቴ ሆነ፤ አንተም ነፍሴን ከጥፋት ጕድጓድ አዳንሃት፥ ኃጢአቴንም ሁሉ ወደ ኋላህ ጣልህ።\n" +
                "18 ፤ ሲኦል አያመሰግንህምና፥ ሞትም አያከብርህምና፤ ወደ ጕድጓዱ የሚወርዱ እውነትህን ተስፋ አያደርጉም።\n" +
                "19 ፤ እኔ ዛሬ አንደማደርግ ሕያዋን እነርሱ ያመሰግኑሃል፤ አባት ለልጆች እውነትህን ያስታውቃል።\n" +
                "20 ፤ እግዚአብሔር ያድነኛል፤ ስለዚህ በዕድሜያችን ዘመን ሁሉ በእግዚአብሔር ቤት ቅኔዎችን አውታር ባለው ዕቃ እንዘምራለን።\n" +
                "21 ፤ ኢሳይያስም። የበለስ ጥፍጥፍ አምጥተው በእባጩ ላይ ይለብጡት፥ እርሱም ይፈወሳል ብሎ ነበር።\n" +
                "22 ፤ ሕዝቅያስም። ወደ እግዚአብሔር ቤት እወጣ ዘንድ ምልክቱ ምንድር ነው? ብሎ ነበር።\n"));

        return new Chapter(38, verses);
    }

    private Chapter chapterThirtyNine() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ በዚያም ወራት የባቢሎን ንጉሥ የባልዳን ልጅ መሮዳክ ባልዳን ሕዝቅያስ ታምሞ እንደ ተፈወሰ ሰምቶ ነበርና ደብዳቤና እጅ መንሻ ላከለት።\n" +
                "2 ፤ ሕዝቅያስም ደስ አለው፥ ግምጃ ቤቱንም፥ ብሩንና ወርቁንም፥ ቅመሙንና የከበረውንም ዘይት፥ መሣርያም ያለበትን ቤት ሁሉ፥ በቤተ መዛግብቱም የተገኘውን ሁሉ አሳያቸው፤ በቤቱና በግዛቱ ሁሉ ካለው ሕዝቅያስ ያላሳያቸው የለም።\n" +
                "3 ፤ ነቢዩም ኢሳይያስ ወደ ንጉሡ ወደ ሕዝቅያስ መጥቶ። እነዚህ ሰዎች ምን አሉ? ከወዴትስ መጡልህ? አለው። ሕዝቅያስም። ከሩቅ አገር ከባቢሎን መጡልኝ አለው።\n" +
                "4 ፤ እርሱም። በቤትህ ያዩት ምንድር ነው? አለው፤ ሕዝቅያስም። በቤቴ ያለውን ሁሉ አይተዋል፤ በቤተ መዛግብቴ ካለው ያላሳየኋቸው የለም አለው።\n" +
                "5 ፤ ኢሳይያስም ሕዝቅያስን። የሠራዊትን ጌታ የእግዚአብሔርን ቃል ስማ።\n" +
                "6 ፤ እነሆ፥ በቤትህ ያለው ሁሉ፥ አባቶችህም እስከ ዛሬ ድረስ ያከማቹት ሁሉ ወደ ባቢሎን የሚፈልስበት ወራት ይመጣል፤ ምንም አይቀርም፥ ይላል እግዚአብሔር።\n" +
                "7 ፤ ከአንተም ከሚወጡት ከምትወልዳቸው ልጆችህ ማርከው ይወስዳሉ፤ በባቢሎንም ንጉሥ ቤት ውስጥ ጃንደረቦች ይሆናሉ አለው።\n" +
                "8 ፤ ሕዝቅያስም ኢሳይያስን። የተናገርኸው የእግዚአብሔር ቃል መልካም ነው አለው። ደግሞም። በዘመኔ ሰላምና እውነት ይሁን አለ።\n"));

        return new Chapter(39, verses);
    }

    private Chapter chapterFourty() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ አጽናኑ፥ ሕዝቤን አጽናኑ ይላል አምላካችሁ።\n" +
                "2 ፤ ለኢየሩሳሌም ልብ ተናገሩ የተቀጠረችበት ወራት እንደ ተፈጸመ፥ ኃጢአትዋም እንደ ተሰረየ፥ ከእግዚአብሔርም እጅ ስለ ኃጢአትዋ ሁሉ ሁለት እጥፍ እንደ ተቀበለች ወደ እርስዋ ጩኹ።\n" +
                "3 ፤ የአዋጅ ነጋሪ ቃል። የእግዚአብሔርን መንገድ በምድረ በዳ ጥረጉ፥ ለአምላካችንም ጐዳና በበረሀ አስተካከሉ።\n" +
                "4 ፤ ሸለቆው ሁሉ ከፍ ይላል፥ ተራራውና ኮረብታውም ሁሉ ዝቅ ይላል፤ ጠማማውም ይቃናል፥ ስርጓጕጡም ሜዳ ይሆናል፤\n" +
                "5 ፤ የእግዚአብሔርም ክብር ይገለጣል፥ ሥጋ ለባሹም ሁሉ በአንድነት ያየዋል፥ የእግዚአብሔር አፍ ይህን ተናግሮአልና።\n" +
                "6 ፤ ጩኽ የሚል ሰው ቃል፤ ምን ብዬ ልጩኽ? አልሁ። ሥጋ ለባሽ ሁሉ ሣር ነው፥ ክብሩም ሁሉ እንደ ምድረ በዳ አበባ ነው።\n" +
                "7 ፤ የእግዚአብሔር እስትንፋስ ይነፍስበታልና ሣሩ ይደርቃል አበባውም ይረግፋል፤ በእውነት ሕዝቡ ሣር ነው።\n" +
                "8 ፤ ሣሩ ይደርቃል አበባውም ይረግፋል፥ የአምላካችን ቃል ግን ለዘላለም ጸንታ ትኖራለች።\n" +
                "9 ፤ የምስራች የምትነግሪ ጽዮን ሆይ፥ ከፍ ወዳለው ተራራ ውጪ የምስራች የምትነግሪ ኢየሩሳሌም ሆይ፥ ድምፅሽን በኃይል አንሺ፤ አንሺ፥ አትፍሪ፤ ለይሁዳም ከተሞች። እነሆ፥ አምላካችሁ! ብለሽ ንገሪ።\n" +
                "10 ፤ እነሆ፥ ጌታ እግዚአብሔር እንደ ኃያል ይመጣል ክንዱም ስለ እርሱ ይገዛል፤ እነሆ፥ ዋጋው ከእርሱ ጋር ደመወዙም በፊቱ ነው።\n" +
                "11 ፤ መንጋውን እንደ እረኛ ያሰማራል፥ ጠቦቶቹን በክንዱ ሰብስቦ በብብቱ ይሸከማል፥ የሚያጠቡትንም በቀስታ ይመራል።\n" +
                "12 ፤ ውኆችን በእፍኙ የሰፈረ፥ ሰማይንም በስንዝር የለካ፥ የምድርንም አፈር በመስፈሪያ ሰብስቦ የያዘ፥ ተራሮችን በሚዛን ኮረብቶችንም በሚዛኖች የመዘነ ማን ነው?\n" +
                "13 ፤ የእግዚአብሔርን መንፈስ ያዘዘ፥ ወይስ አማካሪ ሆኖ ያስተማረው ማን ነው?\n" +
                "14 ፤ ወይስ ከማን ጋር ተመካከረ? ወይስ ማን መከረው? የፍርድንም መንገድ ማን አስተማረው? እውቀትንስ ማን አስተማረው? የማስተዋልንስ መንገድ ማን አሳየው?\n" +
                "15 ፤ እነሆ፥ አሕዛብ በገንቦ እንዳለች ጠብታ ናቸው፥ በሚዛንም እንዳለ ትንሽ ትቢያ ተቈጥረዋል፤ እነሆ፥ ደሴቶችን እንደ ቀላል ነገር ያነሣል።\n" +
                "16 ፤ ሊባኖስ ለማንደጃ እንስሶችዋም ለሚቃጠል መሥዋዕት አይበቁም።\n" +
                "17 ፤ አሕዛብ ሁሉ በፊቱ እንዳልነበሩ ናቸው፤ ከምናምን እንደሚያንሱ፥ እንደ ከንቱ ነገርም ይቈጥራቸዋል።\n" +
                "18 ፤ እንግዲህ እግዚአብሔርን በማን ትመስሉታላችሁ? ወይስ በምን ምሳሌ ታስተያዩታላችሁ?\n" +
                "19 ፤ የተቀረጸውንስ ምስል ሠራተኛ ሠርቶታል፥ አንጥረኛም በወርቅ ለብጦታል፥ የብሩንም ሰንሰለት አፍስሶለታል።\n" +
                "20 ፤ ለዚህ መባዕ ገንዘቡ ያልበቃው ድሀ የማይነቅዘውን እንጨት ይመርጣል፤ ምስሉም እንዳይናወጥ ያቆመው ዘንድ ብልህ ሠራተኛን ይፈልጋል።\n" +
                "21 ፤ አላወቃችሁምን? ወይስ አልሰማችሁምን? ከጥንትስ አልተወራላችሁምን? ወይስ ምድር ከተመሠረተች ጀምሮ አላስተዋላችሁምን?\n" +
                "22 ፤ እርሱ በምድር ክበብ ላይ ይቀምጣል፥ በእርስዋም የሚኖሩት እንደ አንበጣ ናቸው፤ ሰማያትን እንደ መጋረጃ የሚዘረጋቸው እንደ ድንኳንም ለመኖርያ የሚዘረጋቸው፥\n" +
                "23 ፤ አለቆችንም እንዳልነበሩ፥ የምድርንም ፈራጆች እንደ ከንቱ ነገር የሚያደርጋቸው እርሱ ነው።\n" +
                "24 ፤ ገና እንደ ተተከሉና እንደ ተዘሩ፥ በምድርም ሥር ገና እንደ ሰደዱ ወዲያውኑ ነፈሰባቸው፥ እነርሱም ደረቁ፥ ዐውሎ ነፋስም እንደ እብቅ ጠረጋቸው።\n" +
                "25 ፤ እንግዲህ እተካከለው ዘንድ በማን መሰላችሁኝ? ይላል ቅዱሱ።\n" +
                "26 ፤ ዓይናችሁን ወደ ላይ አንሥታችሁ ተመልከቱ፤ እነዚህን የፈጠረ ማን ነው? ሠራዊታቸውን በቍጥር የሚያወጣ እርሱ ነው፥ ሁሉንም በየስማቸው ይጠራቸዋል፤ በኃይሉ ብዛትና በችሎቱ ብርታት አንድስ እንኳ አይታጣውም።\n" +
                "27 ፤ ያዕቆብ ሆይ፥ እስራኤልም ሆይ። መንገዴ ከእግዚአብሔር ተሰውራለች ፍርዴም ከአምላኬ አልፋለች ለምን ትላለህ? ለምንስ እንዲህ ትናገራለህ?\n" +
                "28 ፤ አላወቅህምን? አልሰማህምን? እግዚአብሔር የዘላለም አምላክ፥ የምድርም ዳርቻ ፈጣሪ ነው፤ አይደክምም፥ አይታክትም፥ ማስተዋሉም አይመረመርም።\n" +
                "29 ፤ ለደካማ ኃይልን ይሰጣል፥ ጕልበት ለሌለውም ብርታትን ይጨምራል።\n" +
                "30 ፤ ብላቴኖች ይደክማሉ ይታክቱማል፥ ጐበዛዝቱም ፈጽሞ ይወድቃሉ፤\n" +
                "31 ፤ እግዚአብሔርን በመተማመን የሚጠባበቁ ግን ኃይላቸውን ያድሳሉ፤ እንደ ንስር በክንፍ ይወጣሉ፤ ይሮጣሉ፥ አይታክቱም፤ ይሄዳሉ፥ አይደክሙም።\n"));

        return new Chapter(40, verses);
    }
    private Chapter chapterFourtyOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ደሴቶች ሆይ፥ በፊቴ ዝም በሉ፤ አሕዛብም ኃይላቸውን ያድሱ፤ ይቅረቡም በዚያን ጊዜም ይናገሩ፤ ለፍርድ ለአንድነት እንቅረብ።\n" +
                "2 ፤ ከምሥራቅ አንዱን ያስነሣ በጽድቅም ወደ እግሩ የተጠራው ማን ነው? አሕዛብንም አሳልፎ በፊቱ ሰጠው፥ ነገሥታትንም አስገዛለት፤ ለሰይፉ እንደ ትቢያ ለቀስቱም እንደ ተጠረገ እብቅ አድርጎ ሰጣቸው።\n" +
                "3 ፤ አሳደዳቸው፥ እግሮቹም አስቀድመው ባልሄዱባት መንገድ በደኅነት አለፈ።\n" +
                "4 ፤ ይህን የሠራና ያደረገ፥ ትውልድንም ከጥንት የጠራ ማን ነው? እኔ እግዚአብሔር፥ ፊተኛው በኋላኞችም ዘንድ የምኖር እኔ ነኝ።\n" +
                "5 ፤ ደሴቶች አይተው ፈሩ፥ የምድርም ዳርቾች ተንቀጠቀጡ፤ ቀረቡም ደረሱም።\n" +
                "6 ፤ ሁሉም እያንዳንዱ ባልንጀራውን ይረዳው ነበር፥ ወንድሙንም። አይዞህ ይለው ነበር።\n" +
                "7 ፤ አናጢውም አንጥረኛውን፥ በመዶሻም የሚያሳሳውን መስፍ መችውን አጽናና፥ ስለ ማጣበቅ ሥራውም። መልካም ነው አለ፤ እንዳይንቀሳቀስም በችንካር አጋጠመው።\n" +
                "8 ፤ ባሪያዬ እስራኤል፥ የመረጥሁህ ያዕቆብ፥ የወዳጄ የአብርሃም ዘር ሆይ፥\n" +
                "9 ፤ አንተ ከምድር ዳርቻ የያዝሁህ ከማዕዘንዋም የጠራሁህና። አንተ ባሪያዬ ነህ፥ መርጬሃለሁ አልጥልህም ያልሁህ ሆይ፥\n" +
                "10 ፤ እኔ ከአንተ ጋር ነኝና አትፍራ፤ እኔ አምላክህ ነኝና አትደንግጥ፤ አበረታሃለሁ፥ እረዳህማለሁ፥ በጽድቄም ቀኝ ደግፌ እይዝሃለሁ።\n" +
                "11 ፤ እነሆ የሚቆጡህ ሁሉ ያፍራሉ፥ ይዋረዱማል፤ የሚከራከሩህም እንዳልነበሩ ይሆናሉ፥ ይጠፉማል።\n" +
                "12 ፤ የሚያጣሉህንም ትሻቸዋለህ አታገኛቸውምም፥ የሚዋጉህም እንዳልነበሩና እንደ ምናምን ይሆናሉ።\n" +
                "13 ፤ እኔ አምላክህ እግዚአብሔር። አትፍራ፥ እረዳሃለሁ ብዬ ቀኝህን እይዛለሁና።\n" +
                "14 ፤ አንተ ትል ያዕቆብ የእስራኤልም ሰዎች ሆይ፥ አትፍሩ፤ እረዳሃለሁ፥ ይላል እግዚአብሔር፥ የሚቤዥህም የእስራኤል ቅዱስ ነው።\n" +
                "15 ፤ እነሆ፥ እንደ ተሳለች እንደ አዲስ ባለ ጥርስ ማሄጃ አድርጌሃለሁ፤ ተራሮችንም ታሄዳለህ ታደቅቃቸውማለህ፥ ኮረብቶችንም እንደ ገለባ ታደርጋቸዋለህ።\n" +
                "16 ፤ ታበጥራቸዋለህ፥ ነፋስም ይጠርጋቸዋል፥ ዐውሎ ነፋስም ይበትናቸዋል፤ አንተም በእግዚአብሔር ደስ ይልሃል፥ በእስራኤልም ቅዱስ ትመካለህ።\n" +
                "17 ፤ ድሆችና ምስኪኖችም ውኃ ይሻሉ አያገኙምም፥ ምላሳቸውም በጥማት ደርቋል፤ እኔ እግዚአብሔር እሰማቸዋለሁ፥ የእስራኤል አምላክ እኔ አልተዋቸውም።\n" +
                "18 ፤ በወናዎቹ ኮረብቶች ላይ ወንዞችን፥ በሸለቆችም መካከል ምንጮችን እከፍታለሁ፤ ምድረ በዳውን ለውኃ መቆሚያ፥ የጥማትንም ምድር ለውኃ መፍለቂያ አደርጋለሁ።\n" +
                "19 ፤\n" +
                "20 ፤ የእግዚአብሔር እጅ ይህን እንደ ሠራች፥ የእስራኤልም ቅዱስ እንደ ፈጠረው ያዩ ዘንድ ያውቁም ዘንድ ያስቡም ዘንድ በአንድነትም ያስተውሉ ዘንድ፥ በምድረ በዳ ዝግባውንና ግራሩን ባርሰነቱንና የዘይቱን ዛፍ አበቅላለሁ፥ በበረሀውም ጥዱንና አስታውን ወይራውንም በአንድነት አኖራለሁ።\n" +
                "21 ፤ ክርክራችሁን አቅርቡ፥ ይላል እግዚአብሔር፤ ማስረጃችሁን አምጡ፥ ይላል የያዕቆብ ንጉሥ።\n" +
                "22 ፤ ያምጡ፥ የሚሆነውንም ይንገሩን፤ ልብም እናደርግ ዘንድ ፍጻሜአቸውንም እናውቅ ዘንድ፥ የቀደሙት ነገሮች ምን እንደ ሆኑ ተናገሩ፥ የሚመጡትንም አሳዩን።\n" +
                "23 ፤ አማልክትም መሆናችሁን እናውቅ ዘንድ በኋላ የሚመጡትን ተናገሩ፤ እንደነግጥም ዘንድ በአንድነትም እናይ ዘንድ መልካሙን ወይም ክፉውን አድርጉ።\n" +
                "24 ፤ እነሆ፥ እንዳልነበረ ናችሁ፥ ሥራችሁም ከንቱ ነው፤ የሚመርጣችሁም አስጻያፊ ነው።\n" +
                "25 ፤ አንዱን ከሰሜን አነሣሁ መጥቶአልም፤ አንዱም ከፀሐይ መውጫ ስሜን የሚጠራ ይመጣል፤ በጭቃ ላይ እንደሚመጣ ሰው አፈርም እንደሚረግጥ ሸክለኛ በአለቆች ላይ ይመጣል።\n" +
                "26 ፤ እናውቅ ዘንድ ከጥንት የተናገረው። እውነት ነው እንልም ዘንድ ቀድሞ የተናገረው ማን ነው? የሚናገር የለም፥ የሚገልጥም የለም፥ ቃላችሁንም የሚሰማ የለም።\n" +
                "27 ፤ በመጀመሪያ ለጽዮን። እነኋቸው እላለሁ፤ ለኢየሩሳሌምም የምስራች ነጋሪን እሰጣለሁ።\n" +
                "28 ፤ ብመለከት ማንም አልነበረም፤ ብጠይቃቸውም የሚመልስልኝ አማካሪ በመካከላቸው የለም።\n" +
                "29 ፤ እነሆ፥ እነርሱ ሁሉ ከንቱዎች ናቸው፥ ሥራቸውም ምንምን ናት፤ ቀልጠው የተሠሩት ምስሎቻቸውም ነፋስና ኢምንት ናቸው።\n"));
        // Add more verses as needed
        return new Chapter(41, verses);
    }

    private Chapter chapterFourtyTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እነሆ ደግፌ የያዝሁት ባሪያዬ፤ ነፍሴ ደስ የተሰኘችበት ምርጤ፤ በእርሱ ላይ መንፈሴን አድርጌአለሁ፥ እርሱም ለአሕዛብ ፍርድን ያወጣል።\n" +
                "2 ፤ አይጮኽም ቃሉንም አያነሣም፥ ድምፁንም በሜዳ አያሰማም።\n" +
                "3 ፤ የተቀጠቀጠን ሸምበቆ አይሰብርም፥ የሚጤስንም ክር አያጠፋም፤ በእውነት ፍርድን ያወጣል።\n" +
                "4 ፤ በምድርም ፍርድን እስኪያደርግ ድረስ ይበራል እንጂ አይጠፋም፤ አሕዛብም በስሙ ይታመናሉ።\n" +
                "5 ፤ ሰማያትን የፈጠረ የዘረጋቸውም፥ ምድርንና በውስጥዋ ያለውን ያጸና፥ በእርስዋ ላይ ለሚኖሩ ሕዝብ እስትንፋስን፥ ለሚሄዱባትም መንፈስን የሚሰጥ አምላክ እግዚአብሔር እንዲህ ይላል።\n" +
                "6 ፤\n" +
                "7 ፤ እኔ እግዚአብሔር በጽድቅ ጠርቼሃለሁ፥ እጅህንም እይዛለሁ እጠብቅህማለሁ፥ የዕውሩንም ዓይን ትከፍት ዘንድ የተጋዘውንም ከግዞት ቤት በጨለማም የተቀመጡትን ከወህኒ ቤት ታወጣ ዘንድ ለሕዝብ ቃል ኪዳን ለአሕዛብም ብርሃን አድርጌ እሰጥሃለሁ።\n" +
                "8 ፤ እኔ እግዚአብሔር ነኝ፤ ስሜ ይህ ነው፤ ክብሬን ለሌላ፥ ምስጋናዬንም ለተቀረጹ ምስሎች አልሰጥም።\n" +
                "9 ፤ እነሆ፥ የቀድሞው ነገር ተፈጸመ፥ አዲስ ነገርንም እናገራለሁ፤ አስቀድሞም ሳይበቅል እርሱን አስታውቃችኋለሁ።\n" +
                "10 ፤ ወደ ባሕር የምትወርዱ በእርስዋም ውስጥ ያላችሁ ሁሉ፥ ደሴቶችና በእነርሱም ላይ የምትኖሩ ሆይ፥ ለእግዚአብሔር አዲስ መዝሙር፥ ከምድርም ዳርቻ ምስጋናውን ዘምሩ።\n" +
                "11 ፤ ምድረ በዳውና ከተሞቹ የቄዳርም ሰዎች የሚቀመጡባቸው መንደሮች ድምፃቸውን ያንሡ፤ በሴላ የሚኖሩ እልል ይበሉ፥ በተራሮችም ራስ ላይ ሆነው ይጩኹ።\n" +
                "12 ፤ ለእግዚአብሔር ክብርን ይስጡ፥ ምስጋናውንም በደሴቶች ይናገሩ።\n" +
                "13 ፤ እግዚአብሔር እንደ ኃያል ይወጣል እንደ ሰልፈኛም ቅንዓትን ያስነሣል፤ ይጮኻል ድምፁንም ያሰማል በጠላቶቹም ላይ ይበረታል።\n" +
                "14 ፤ ከድሮ ዘመን ጀምሮ ዝም ብያለሁ፥ ዝም ብዬም ታግሻለሁ፤ አሁን ምጥ እንደ ያዛት ሴት እጮኻለሁ፤ አጠፋለሁ በአንድነትም እጨርሳለሁ።\n" +
                "15 ፤ ተራሮችንና ኮረብቶችን አፈርሳለሁ፥ ቡቃያዎቻቸውንም ሁሉ አደርቃለሁ፤ ወንዞችንም ደሴቶች አደርጋለሁ፥ ኵሬዎችንም አደርቃለሁ።\n" +
                "16 ፤ ዕውሮችንም በማያውቋት መንገድ አመጣቸዋለሁ፥ በማያውቋትም ጎዳና እመራቸዋለሁ፤ በፊታቸውም ጨለማውን ብርሃን አደርጋለሁ፥ ጠማማውንም አቀናለሁ። ይህን አደርግላቸዋለሁ፥ አልተዋቸውምም።\n" +
                "17 ፤ በተቀረጹትም ምስሎች የሚታመኑ፥ ቀልጠው የተሠሩትንም ምስሎች። አምላኮቻችን ናችሁ የሚሉ ወደ ኋላቸው ይመለሳሉ ፈጽመውም ያፍራሉ።\n" +
                "18 ፤ እናንተ ደንቆሮች፥ ስሙ፤ እናንተም ዕውሮች፥ ታዩ ዘንድ ተመልከቱ።\n" +
                "19 ፤ ከባሪያዬ በቀር ዕውር ማን ነው? እንደምልከው መልእክተኛዬስ በቀር ደንቆሮ የሆነ ማን ነው? እንደ ፍጹሙ ወይስ እንደ እግዚአብሔር ባሪያ ዕውር የሆነ ማን ነው?\n" +
                "20 ፤ ብዙ ነገርን ታያላችሁ ነገር ግን አትጠባበቁትም፤ ጆሮአችሁም ተከፍተዋል፥ ነገር ግን አትሰሙም።\n" +
                "21 ፤ እግዚአብሔር ስለ ጽድቁ ሕጉን ታላቅ ያደርግና ያከብር ዘንድ ወደደ።\n" +
                "22 ፤ ይህ ግን የተበዘበዘና የተዘረፈ ሕዝብ ነው፤ ሁላቸው በዋሻ ውስጥ ተጠምደዋል በግዞት ቤትም ተሸሽገዋል፤ ብዝበዛ ሆነዋል የሚያድንም የለም፥ ምርኮም ሆነዋል፥ ማንም። መልሱ አይልም።\n" +
                "23 ፤ ከመካከላችሁ ይህን የሚያደምጥ፥ ለሚመጣውም ጊዜ የሚያደምጥና የሚሰማ ማን ነው?\n" +
                "24 ፤ ያዕቆብን ለማረኩ እስራኤልንም ለበዘበዙ ሰዎች የሰጠ ማን ነው? እኛ የበደልነው፥ እነርሱም በመንገዱ ይሄዱ ዘንድ ያልወደዱት ለሕጉም ያልታዘዙለት እግዚአብሔር እርሱ አይደለምን?\n" +
                "25 ፤ ስለዚህ የቍጣውን መዓትና የሰልፉን ጽናት አፈሰሰበት፤ በዙሪያም አነደደው እርሱ ግን አላወቀም፥ አቃጠለውም እርሱ ግን ልብ አላደረገም።\n" ));
        // Add more verses as needed
        return new Chapter(42, verses);
    }

    private Chapter chapterFourtyThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ አሁንም ያዕቆብ ሆይ፥ የፈጠረህ፥ እስራኤልም ሆይ፥ የሠራህ እግዚአብሔር እንዲህ ይላል። ተቤዥቼሃለሁና አትፍራ፤ በስምህም ጠርቼሃለሁ፥ አንተ የእኔ ነህ።\n" +
                "2 ፤ በውኃ ውስጥ ባለፍህ ጊዜ ከአንተ ጋር እሆናለሁ፥ በወንዞችም ውስጥ ባለፍህ ጊዜ አያሰጥሙህም፤ በእሳትም ውስጥ በሄድህ ጊዜ አትቃጠልም፥ ነበልባሉም አይፈጅህም።\n" +
                "3 ፤ እኔ የእስራኤል ቅዱስ አምላክህ እግዚአብሔር መድኃኒትህ ነኝ፤ ግብጽን ለአንተ ቤዛ አድርጌ፥ ኢትዮጵያንና ሳባንም ለአንተ ፋንታ ሰጥቻለሁ።\n" +
                "4 ፤ በዓይኔ ፊት የከበርህና የተመሰገንህ ነህና፥ እኔም ወድጄሃለሁና ስለዚህ ሰዎችን ለአንተ አሕዛብንም ለነፍስህ እሰጣለሁ።\n" +
                "5 ፤ እኔ ከአንተ ጋር ነኝና አትፍራ፤ ዘርህንም ከምሥራቅ አመጣዋለሁ፥ ከምዕራብም እሰበስብሃለሁ።\n" +
                "6 ፤\n" +
                "7 ፤ ሰሜንን። መልሰህ አምጣ፥ ደቡብንም። አትከልክል፤ ወንዶች ልጆቼን ከሩቅ ሴቶች ልጆቼንም ከምድር ዳርቻ፥ በስሜ የተጠራውን ለክብሬም የፈጠርሁትን፥ የሠራሁትንና ያደረግሁትን ሁሉ አምጣ እለዋለሁ።\n" +
                "8 ፤ ዓይኖች ያሉአቸውን ዕውሮችን ሕዝብ፥ ጆሮችም ያሉአቸውን ደንቆሮቹን አውጣ።\n" +
                "9 ፤ አሕዛብ ሁሉ በአንድነት ይሰብሰቡ ወገኖችም ይከማቹ፤ ከመካከላቸው፤ ይህን የሚናገር፥ የቀድሞውንስ ነገር የሚያሳየን ማን ነው? ይጸድቁ ዘንድ ምስክሮቻቸውን ያምጡ፥ ሰምተውም እውነት ነው ይበሉ።\n" +
                "10 ፤ ታውቁና ታምኑብኝ ዘንድ እኔም እንደሆንሁ ታስተውሉ ዘንድ፥ እናንተ የመረጥሁትም ባሪያዬ ምስክሮቼ ናችሁ ይላል እግዚአብሔር፤ ከእኔ በፊት አምላክ አልተሠራም ከእኔም በኋላ አይሆንም።\n" +
                "11 ፤ እኔ፥ እኔ እግዚአብሔር ነኝ፥ ከእኔ ሌላም የሚያድን የለም።\n" +
                "12 ፤ ተናግሬአለሁ አድኜማለሁ አሳይቼማለሁ፥ በእናንተም ዘንድ ባዕድ አምላክ አልነበረም፤ ስለዚህ እናንተ ምስክሮቼ ናችሁ፥ ይላል እግዚአብሔር፥ እኔም አምላክ ነኝ።\n" +
                "13 ፤ ከጥንት ጀምሮ እኔ ነኝ ከእጄም የሚያመልጥ የለም፤ እሠራለሁ፥ የሚከለክልስ ማን ነው?\n" +
                "14 ፤ የእስራኤል ቅዱስ፥ የሚቤዣችሁ፥ እግዚአብሔር እንዲህ ይላል። ስለ እናንተ ወደ ባቢሎን ሰድጃለሁ፥ ከለዳውያንንም ሁሉ ስደተኞች አድርጌ በሚመኩባቸው መርከቦች አዋርዳቸዋለሁ።\n" +
                "15 ፤ ቅዱሳችሁ፥ የእስራኤል ፈጣሪ፥ ንጉሣችሁ፥ እግዚአብሔር እኔ ነኝ።\n" +
                "16 ፤ እግዚአብሔር በባሕር ውስጥ መንገድን በኃይለኛም ውኃ ውስጥ መተላለፊያን ያደርጋል፤\n" +
                "17 ፤ እግዚአብሔር ሰረገላውንና ፈረሱን ሠራዊቱንና አርበኛውን ያወጣል፤ እነርሱ ግን በአንድነት ተኝተዋል፥ አይነሡም፤ ቀርተዋል፥ እንደ ጥዋፍ ኩስታሪም ጠፍተዋል፤ እግዚአብሔር እንዲህ ይላል።\n" +
                "18 ፤ የፊተኛውን ነገር አታስተውሉ፥ የጥንቱንም ነገር አታስቡ።\n" +
                "19 ፤ እነሆ፥ አዲስ ነገርን አደርጋለህ፤ እርሱም አሁን ይበቅላል፥ እናንተም አታውቁትምን? በምድረ በዳም መንገድን በበረሀም ወንዞችን አደርጋለሁ።\n" +
                "20 ፤\n" +
                "21 ፤ ምስጋናዬን እንዲናገሩ ለእኔ የፈጠርሁት ሕዝብ፥ የመረጥሁትን ሕዝቤን አጠጣ ዘንድ በምድረ በዳ ውኃን በበረሀም ወንዞችን ሰጥቻለሁና የምድረ በዳ አራዊት፥ ቀበሮችና ሰጎኖች፥ ያከብሩኛል።\n" +
                "22 ፤ ያዕቆብ ሆይ፥ አንተ ግን አልጠራኸኝም፥ አንተም እስራኤል ሆይ፥ በእኔ ዘንድ ደክመሃል።\n" +
                "23 ፤ ለሚቃጠል መሥዋዕት በጎችህን አላቀረብህልኝም በሌላም መሥዋዕትህ አላከበርኸኝም፤ በእህልም ቍርባን አላስቸገርሁህም በዕጣንም አላደከምሁህም።\n" +
                "24 ፤ ዕጣንም በገንዘብ አልገዛህልኝም በመሥዋዕትህም ስብ አላጠገብኸኝም፤ ነገር ግን በኃጢአትህ አስቸገርኸኝ፥ በበደልህም አደከምኸኝ።\n" +
                "25 ፤ መተላለፍህን። ስለ እኔ ስል የምደመስስ እኔ ነኝ፤ ኃጢአትህንም አላስብም።\n" +
                "26 ፤ አሳስበኝ፥ በአንድነትም ሆነን እንፋረድ፤ እንድትጸድቅ ነገርህን ተናገር።\n" +
                "27 ፤ ፊተኛው አባትህ ኃጢአት ሠርቶአል፥ መምህሮችህም በድለውኛል።\n" +
                "28 ፤ ስለዚህ የመቅደሱን አለቆች አረከስሁ፥ ያዕቆብንም እርግማን፥ እስራኤልንም ስድብ አደረግሁ።\n"));
        // Add more verses as needed
        return new Chapter(43, verses);
    }

    private Chapter chapterFourtyFour() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ አሁንም ባሪያዬ ያዕቆብ የመረጥሁህም እስራኤል ሆይ፥ ስማ።\n" +
                "2 ፤ የፈጠረህ ከማኅፀንም የሠራህ የሚረዳህም እግዚአብሔር እንዲህ ይላል። ባሪያዬ ያዕቆብ የመረጥሁህም ይሹሩን ሆይ፥ አትፍራ።\n" +
                "3 ፤ በተጠማ ላይ ውኃን በደረቅም መሬት ላይ ፈሳሾችን አፈስሳለሁና፤ መንፈሴን በዘርህ ላይ በረከቴንም በልጆችህ ላይ አፈስሳለሁ፥\n" +
                "4 ፤ በፈሳሾችም አጠገብ እንደሚበቅሉ እንደ አኻያ ዛፎች በሣር መካከል ይበቅላሉ።\n" +
                "5 ፤ ይህ። እኔ የእግዚአብሔር ነኝ ይላል፥ ያም በያዕቆብ ስም ይጠራል፤ ይህም። እኔ የእግዚአብሔር ነኝ ብሎ በእጁ ይጽፋል በእስራኤልም የቁልምጫ ስም ይጠራል።\n" +
                "6 ፤ የእስራኤል ንጉሥ እግዚአብሔር፥ የሚቤዥም የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። እኔ ፊተኛ ነኝ እኔም ኋለኛ ነኝ፥ ከእኔ ሌላም አምላክ የለም።\n" +
                "7 ፤ እንደ እኔ ያለ ማን ነው? ይነሣና ይጥራ ይናገርም፤ ከጥንት የፈጠርሁትን ሕዝብ ያዘጋጅልኝ፥ የሚመጣውም ነገር ሳይደርስ ይንገሩኝ።\n" +
                "8 ፤ አትፍሩ አትደንግጡም፤ ከጥንቱ ጀምሬ አልነገርኋችሁምን? ወይስ አላሳየኋችሁምን? እናንተ ምስክሮቼ ናችሁ። ከእኔ ሌላ አምላክ አለን? አምባ የለም፤ ማንንም አላውቅም።\n" +
                "9 ፤ የተቀረጸውን ምስል የሚሠሩ ሁሉ ከንቱዎች ናቸው፥ የወደዱትም ነገር አይረባቸውም፤ ምስክሮቻቸውም አያዩምና አያውቁም፤ ስለዚህ ያፍራሉ።\n" +
                "10 ፤ አምላክን የሠራ ወይስ ለምንም የማይረባ ምስልን የቀረጸ ማን ነው?\n" +
                "11 ፤ እነሆ፥ ባልንጀሮቹ ሁሉ ያፍራሉ፥ ሠራተኞቹም ከሰዎች ወገን ናቸው፤ ሁላቸው ተሰብስበው ይቁሙ፤ ይፈራሉ በአንድነትም ያፍራሉ።\n" +
                "12 ፤ ብረት ሠሪ መጥረቢያውን ይሠራል፥ በፍምም ውስጥ ያደርገዋል፥ በመዶሻም መትቶ ቅርጽ ይሰጠዋል፥ በክንዱም ኃይል ይሠራዋል፥ እርሱም ይራባል ይደክምማል፥ ውኃም አይጠጣም ይታክትማል።\n" +
                "13 ፤ ጠራቢውም ገመድ ይዘረጋል በበረቅም ያመለክተዋል በመቅረጫም ይቀርጸዋል በመለኪያም ይለካዋል፤ በቤትም ውስጥ ይቀመጥ ዘንድ በሰው አምሳልና በሰው ውበት ያስመስለዋል።\n" +
                "14 ፤ የዝግባን ዛፎች ይቈርጣል፤ የዞጲንና የኮምቦልን ዛፍ ይመርጣል፥ ከዱር ዛፎችም መካከል ይጠነክር ዘንድ ይተወዋል፤ የጥድንም ዛፍ ይተክላል ዝናብም ያበቅለዋል።\n" +
                "15 ፤ ለሰውም ማገዶ ይሆናል፤ ከእርሱም ወስዶ ይሞቃል፥ አንድዶም እንጀራ ይጋግርበታል፤ ከእርሱም አምላክ አበጅቶ ይሰግድለታል፥ የተቀረጸውንም ምስል ሠርቶ በእርሱ ፊት ይንበረከካል።\n" +
                "16 ፤ ግማሹን በእሳት ያቃጥላል፥ በዚያ በግማሹ ሥጋ ይበላል፥ ሥጋም ይጠብስበትና ይጠግባል፤ ይሞቃልና። እሰይ ሞቅሁ፥ እሳቱን አይቻለሁ ይላል።\n" +
                "17 ፤ የቀረውንም እንጨት አምላክ አድርጎ ምስል ይቀርጽበታል፤ በፊቱም ተጐንብሶ ይሰግዳል ወደ እርሱም እየጸለየ። አምላኬ ነህና አድነኝ ይላል።\n" +
                "18 ፤ አያውቁም፥ አያስቡም፤ እንዳያዩ ዓይኖቻቸውን፥ እንዳያስተውሉ ልቦቻቸውን ጨፍነዋል።\n" +
                "19 ፤ በልቡም ማንም አያስብም። ግማሽዋን በእሳት አቃጥያለሁ፥ በፍምዋም ላይ እንጀራን ጋግሬአለሁ፥ ሥጋም ጠብሼ በልቻለሁ፤ የቀረውንም አስጸያፊ ነገር አደርጋለሁን? ለዛፍስ ግንድ እሰግዳለሁን? እንዲልም እውቀትና ማስተዋል የለውም።\n" +
                "20 ፤ አመድ ይበላል፥ የተታለለ ልብ አስቶታል፥ ነፍሱን ለማዳን አይችልም፥ ወይም። በቀኝ እጄ ሐሰት አለ አይልም።\n" +
                "21 ፤ ያዕቆብ ሆይ፥ አንተም እስራኤል፥ ባሪያዬ ነህና ይህን አስብ፤ እኔ ሠርቼሃለሁ አንተም ባሪያዬ ነህ፤ እስራኤል ሆይ፥ በእኔ ዘንድ ያልተረሳ ትሆናለህ።\n" +
                "22 ፤ መተላለፍህን እንደ ደመና፥ ኃጢአትህንም እንደ ጭጋግ ደምስሼአለሁ፤ ተቤዥቼሃለሁና ወደ እኔ ተመለስ።\n" +
                "23 ፤ ሰማያት ሆይ፥ እግዚአብሔር አድርጎታልና ዘምሩ፤ እግዚአብሔር ያዕቆብን ተቤዥቶአልና፥ በእስራኤልም ዘንድ ይከበራልና አንተ የምድር ጥልቅ ሆይ፥ ጩኽ፤ እናንተም ተራሮች አንተም ዱር በአንተም ያለ ዛፍ ሁሉ፥ እልል በሉ።\n" +
                "24 ፤ ከማኅፀን የሠራህ፥ የሚቤዥህ እግዚአብሔር እንዲህ ይላል ። ሁሉን የፈጠርሁ፥ ሰማያትን ለብቻዬ የዘረጋሁ ምድርንም ያጸናሁ እግዚአብሔር እኔ ነኝ፤ ከእኔ ጋር ማን ነበረ?\n" +
                "25 ፤ የሐሰተኞችን ምልክት ከንቱ አደርጋለሁ፥ ምዋርተኞችንም አሳብዳለሁ፥ ጥበበኞቹንም ወደ ኋላ እመልሳለሁ እውቀታቸውንም ስንፍና አደርጋለሁ፤\n" +
                "26 ፤ የባሪያዬን ቃል አጸናለሁ፥ የመልእክተኞቼንም ምክር እፈጽማለሁ፤ ኢየሩሳሌምን። የሰው መኖሪያ ትሆኛለሽ፥ የይሁዳንም ከተሞች። ትታነጻላችሁ ፍራሾቻችሁንም አቆማለሁ እላለሁ፤\n" +
                "27 ፤ ቀላዩንም። ደረቅ ሁን፥ ፈሳሾችህንም አደርቃለሁ እላለሁ፤\n" +
                "28 ፤ ቂሮስንም። እርሱ እረኛዬ ነው፤ እርሱም ኢየሩሳሌምን ። ትታነጺያለሽ ቤተ መቅደስም ይመሠረታል ብሎ ፈቃዴን ሁሉ ይፈጽማል እላለሁ።\n"));
        // Add more verses as needed
        return new Chapter(44, verses);
    }
    private Chapter chapterFourtyFive() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እግዚአብሔር ለቀባሁት፥ አሕዛብንም በፊቱ አስገዛ ዘንድ የነገሥታትንም ወገብ እፈታ ዘንድ፥ በሮቹም እንዳይዘጉ መዝጊያዎቹን በፊቱ እከፍት ዘንድ፥ ቀኝ እጁን ለያዝሁት ለቂሮስ እንዲህ ይላል።\n" +
                "2 ፤ በፊትህ እሄዳለሁ ተራሮችንም ትክክል አደርጋለሁ፥ የናሱንም ደጆች እሰብራለሁ የብረቱንም መወርወሪያዎች እቈርጣለሁ፤\n" +
                "3 ፤ በስምህም የምጠራህ የእስራኤል አምላክ እግዚአብሔር እኔ እንደ ሆንሁ ታውቅ ዘንድ በጨለማ የነበረችውን መዝገብ በስውርም የተደበቀችውን ሀብት እሰጥሃለሁ።\n" +
                "4 ፤ ስለ ባሪያዬ ስለ ያዕቆብ፥ ስለ መረጥሁትም ስለ እስራኤል ብዬ በስምህ ጠርቼሃለሁ፤ በቍልምጫ ስምህ ጠራሁህ፥ አንተ ግን አላወቅኸኝም።\n" +
                "5 ፤\n" +
                "6 ፤ እኔ እግዚአብሔር ነኝ ከእኔም ሌላ ማንም የለም፤ ከእኔም በቀር አምላክ የለም፤ በፀሐይ መውጫና በምዕራብ ያሉ ከእኔ በቀር ማንም ሌላ እንደሌለ ያውቁ ዘንድ አስታጠቅሁህ፥ አንተ ግን አላወቅኸኝም፤ እኔ እግዚአብሔር ነኝ፥ ከእኔም ሌላ ማንም የለም።\n" +
                "7 ፤ ብርሃንን ሠራሁ፥ ጨለማውንም ፈጠርሁ፤ ደኅንነትን እሠራለሁ፥ ክፋትንም እፈጥራለሁ፤ እነነዚህን ሁሉ ያደረግሁ እግዚአብሔር እኔ ነኝ።\n" +
                "8 ፤ እናንተ ሰማያት ከላይ አንጠባጥቡ ደመናትም ጽድቅን ያዝንቡ፤ ምድርም ትከፈት መድኃኒትንም ታብቅል፥ ጽድቅም በአንድነት ይብቀል፤ እኔ እግዚአብሔር ፈጥሬዋለሁ።\n" +
                "9 ፤ ከሠሪው ጋር ለሚታገል ወዮለት! በምድር ሸክላዎች መካከል ያለ ሸክላ ነው። ጭቃ ሠሪውን። ምን ትሠራለህ? ወይስ ሥራህ። እጅ የለውም ይላልን?\n" +
                "10 ፤ አባትን። ምን ወልደሃል? ወይም ሴትን። ምን አማጥሽ? ለሚል ወዮ!\n" +
                "11 ፤ የእስራኤል ቅዱስ ሠሪውም እግዚአብሔር እንዲህ ይላል። ስለሚመጣው ነገር ጠይቁኝ፥ ስለ ልጆቼና ስለ እጄ ሥራም እዘዙኝ።\n" +
                "12 ፤ እኔ ምድርን ሠርቻለሁ ሰውንም በእርስዋ ላይ ፈጥሬአለሁ፤ እኔ በእጄ ሰማያትን ዘርግቼአለሁ፥ ሠራዊታቸውንም ሁሉ አዝዣለሁ።\n" +
                "13 ፤ እኔ በጽድቅ አስነሥቼዋለሁ መንገዱንም ሁሉ አቀናለሁ፤ እርሱ ከተማዬን ይሠራል፥ በዋጋም ወይም በደመወዝ ሳይሆን ምርኮኞቼን ያወጣል፥ ይላል የሠራዊት ጌታ እግዚአብሔር።\n" +
                "14 ፤ እግዚአብሔርም እንዲህ ይላል። የግብጽ ድካምና የኢትዮጵያ ንግድ ቁመተ ረጅሞችም የሳባ ሰዎች ወደ አንተ ያልፋሉ፤ ለአንተም ይሆናሉ እጆቻቸውም ታስረው ይከተሉሃል፤ በፊትህም ያልፋሉ፥ ለአንተም እየሰገዱ። በእውነት እግዚአብሔር በአንተ አለ፥ ከእርሱም ሌላ አምላክ የለም ብለው ይለምኑሃል።\n" +
                "15 ፤ የእስራኤል አምላክ መድኃኒት ሆይ፥ በእውነት አንተ ራስህን የምትሰውር አምላክ ነህ።\n" +
                "16 ፤ ሁሉም ያፍራሉ ይዋረዱማል፥ ጣዖታትንም የሚሠሩ በአንድነት ወደ ውርደት ይሄዳሉ።\n" +
                "17 ፤ እግዚአብሔር ግን እስራኤልን በዘላለማዊ መድኃኒት ያድነዋል፥ እናንተም ለዘላለም አታፍሩምና አትዋረዱም።\n" +
                "18 ፤ ሰማያትን የፈጠረ እግዚአብሔር፥ እርሱም ምድርን የሠራና ያደረገ ያጸናትም፥ መኖሪያም ልትሆን እንጂ ለከንቱ እንድትሆን ያልፈጠራት አምላክ፥ እንዲህ ይላል። እኔ እግዚአብሔር ነኝ ከእኔም በቀር ሌላ የለም።\n" +
                "19 ፤ በስውር ወይም በጨለማ ምድር ስፍራ አልተናገርሁም፤ ለያዕቆብ ዘር። በከንቱ ፈልጉኝ አላልሁም፤ እኔ እግዚአብሔር ጽድቅን እናገራለሁ ቅንንም አወራለሁ።\n" +
                "20 ፤ እናንተ ከአሕዛብ ወገን ሆናችሁ ያመለጣችሁ፥ ተሰብስባችሁ ኑ በአንድነትም ቅረቡ፤ የተቀረጸውን የምስላቸውን እንጨት የሚሸከሙና ያድን ዘንድ ወደማይችል አምላክ የሚጸልዩ እውቀት የላቸውም።\n" +
                "21 ፤ ይናገሩ ይቅረቡም በአንድነትም ይማከሩ፤ ከጥንቱ ይህን ያሳየ ከቀድሞስ የተናገረ ማን ነው? ያሳየሁም የተናገርሁም እኔ እግዚአብሔር አይደለሁምን? ከእኔም በቀር ሌላ አምላክ የለም፤ እኔ ጻድቅ አምላክና መድኃኒት ነኝ፥ ከእኔም በቀር ማንም የለም።\n" +
                "22 ፤ እናንተ የምድር ዳርቻ ሁሉ፥ እኔ አምላክ ነኝና፥ ከእኔም በቀር ሌላ የለምና ወደ እኔ ዘወር በሉ ትድኑማላችሁ።\n" +
                "23 ፤ ቃሌ ከአፌ በጽድቅ ወጥታለች፥ አትመለስም። ጕልበት ሁሉ ለእኔ ይንበረከካል፥ ምላስም ሁሉ በእኔ ይምላል ብዬ በራሴ ምያለሁ።\n" +
                "24 ፤ ስለ እኔም። በእግዚአብሔር ዘንድ ብቻ ጽድቅና ኃይል አለ፥ ወደ እርሱም ሰዎች ይመጣሉ፥ በእርሱም ላይ የተቈጡ ሁሉ ያፍራሉ።\n" +
                "25 ፤ የእስራኤልም ዘር ሁሉ በእግዚአብሔር ይጸድቃሉ፥ ይመካሉም ይባላል።\n"));

        return new Chapter(45, verses);
    }

    private Chapter chapterFourtySix() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ቤል ተዋረደ፥ ናባው ተሰባበረ፤ ጣዖቶቻቸው በእንስሳና በከብት ላይ ተጭነዋል፤ ሸክሞቻችሁ ለደካማ እንስሳ ከባድ ጭነት ሆነዋል።\n" +
                "2 ፤ ተጐነበሱ በአንድነትም ተዋረዱ፤ ሸክሙን ለማዳን አልቻሉም፥ ራሳቸው ግን ተማረኩ።\n" +
                "3 ፤ እናንተ የያዕቆብ ቤት ሆይ፥ የእስራኤልም ቤት ቅሬታ ሁሉ፥ ከሆድ ያነሣኋችሁ ከማኅፀንም የተሸከምኋችሁ፥ ስሙኝ።\n" +
                "4 ፤ እስከ ሽምግልና ድረስ እኔ ነኝ፥ እስከ ሽበትም ድረስ እሸከማችኋለሁ፤ እኔ ሠርቻለሁ እኔም አነሣለሁ፤ እኔ እሸከማለሁ እኔም አድናለሁ።\n" +
                "5 ፤ በማን ትመስሉኛላችሁ? ከማንስ ጋር ታስተካክሉኛላችሁ? እንመሳሰል ዘንድ ከማን ጋር ታስተያዩኛላችሁ?\n" +
                "6 ፤ ወርቁን ከኮረጆ የሚያፈስሱ ብሩንም በሚዛን የሚመዝኑ እነርሱ አንጥረኛውን ይቀጥራሉ፥ እርሱም አምላክ አድርጎ ይሠራ ዋል፤ ለዚያም ይጐነበሱለታል ይሰግዱለትማል።\n" +
                "7 ፤ በጫንቃቸው ላይ አንሥተው ይሸከሙታል በስፍራውም ያደርጉታል፥ በዚያም ይቆማል፥ ከስፍራውም ፈቀቅ አይልም፤ ሰውም ወደ እርሱ ቢጮኽ አይሰማውም ከመከራውም አያድነውም።\n" +
                "8 ፤ ይህን አስቡና አልቅሱ፤ ተላላፊዎች ሆይ፥ ንስሐ ግቡ፥ ልባችሁንም መልሱ።\n" +
                "9 ፤ እኔ አምላክ ነኝና፥ ሌላም የለምና የቀድሞውን የጥንቱን ነገር አስቡ፤ እኔ እግዚአብሔር ነኝ እንደ እኔም ያለ ማንም የለም።\n" +
                "10 ፤ በመጀመሪያ መጨረሻውን፥ ከጥንትም ያልተደረገውን እነግራለሁ፤ ምክሬ ትጸናለች ፈቃዴንም ሁሉ እፈጽማለሁ እላለሁ።\n" +
                "11 ፤ ከምሥራቅ ነጣቂ ወፍን፥ ከሩቅም አገር ምክሬን የሚያደርገውን ሰው እጠራዋለሁ። ተናግሬአለሁ፤ እፈጽማለሁ፤ አስቤአለሁ አደርግማለሁ።\n" +
                "12 ፤ እናንተ ከጽድቅ የራቃችሁ እልከኞች፥ ስሙኝ፤\n" +
                "13 ፤ ጽድቄን አቀርባለሁ፥ አይርቅም መድኃኒቴም አይዘገይም፤ ከጽዮን ለክብር እንዲሆን መድኃኒትን ለእስራኤል ሰጥቻለሁ።\n" ));

        return new Chapter(46, verses);
    }

    private Chapter chapterFourtySeven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ አንቺ ድንግል የባቢሎን ልጅ ሆይ፥ ውረጂ በትቢያም ላይ ተቀመጪ፤ የከለዳውያን ሴት ልጅ ሆይ፥ ከዚህ በኋላ ቅልጣናምና ቅምጥል አትባይምና ያለ ዙፋን በመሬት ላይ ተቀመጪ።\n" +
                "2 ፤ ወፍጮ ወስደሽ ዱቄትን ፍጪ፤ መሸፈኛሽን አውጪ ረጅሙንም ልብስሽን አውልቀሽ ጣዪው፤ ባትሽን ግለጪ፥ ወንዙን ተሻገሪ።\n" +
                "3 ፤ ኀፍረተ ሥጋሽ ይገለጣል እፍረትሽም ይታያል፤ እኔ እበቀላለሁ፥ ለማንም አልራራም።\n" +
                "4 ፤ ታዳጊያችን፥ ስሙ የሠራዊት ጌታ እግዚአብሔር፥ የእስራኤል ቅዱስ ነው።\n" +
                "5 ፤ የከለዳውያን ሴት ልጅ ሆይ፥ ከዚህ በኋላ። የመንግሥታት እመቤት አትባይምና ዝም ብለሽ ተቀመጪ ወደ ጨለማም ውስጥ ግቢ።\n" +
                "6 ፤ በሕዝቤ ላይ ተቈጥቼ ነበር ርስቴንም አረከስሁ በእጅሽም አሳልፌ ሰጠኋቸው፤ ከእነርሱ ጋር ምሕረት አላደረግሽም፥ በሽማግሌዎቻቸው ላይ ቀንበርሽን እጅግ አክብደሻል።\n" +
                "7 ፤ አንቺም። እኔ ለዘላለም እመቤት እሆናለሁ ብለሻል፤ ይህንም በልብሽ አላደረግሽም ፍጻሜውንም አላሰብሽም።\n" +
                "8 ፤ አሁንም አንቺ ቅምጥል ተዘልለሽ የምትቀመጪ፥ በልብሽም። እኔ ነኝ ከእኔም በቀር ሌላ የለም፤ መበለትም ሆኜ አልኖርም የወላድ መካንነትንም አላውቅም የምትዪ ይህን ስሚ፤\n" +
                "9 ፤ አሁን ግን በአንድ ቀን እነዚህ ሁለት ነገሮች፥ የወላድ መካንነትና መበለትነት፥ በድንገት ይመጡብሻል፤ ስለ መተቶችሽ ብዛትና ስለ አስማቶችሽ ጽናት ፈጽመው ይመጡብሻል።\n" +
                "10 ፤ በክፋትሽ ታምነሻል፤ የሚያየኝ የለም ብለሻል፤ ጥበብሽና እውቀትሽ አታልለውሻል፥ በልብሽም። እኔ ነኝ ከእኔም በቀር ሌላ የለም ብለሻል።\n" +
                "11 ፤ ስለዚህ ምክንያት ክፉ ነገር ይመጣብሻል፥ በምዋርትሽም እንዴት እንደምታርቂው አታውቂም፤ ጉዳት ይውድቅብሻል ታስወግጅውም ዘንድ አይቻልሽም፤ የማትውቂያትም ጕስቍልና ድንገት ትመጣብሻለች።\n" +
                "12 ፤ ምናልባትም መጠቀም ትችዪ ወይም ታስደነግጪ እንደ ሆነ፥ ከአስማቶችሽና ከሕፃንነትሽ ጀምረሽ ከደከምሽበት ከመተቶችሽ ብዛት ጋር ቁሚ።\n" +
                "13 ፤ በምክርሽ ብዛት ደክመሻል፤ አሁንም የሰማይን ከዋክብት የሚቈጥሩ፥ ከዋክብትንም የሚመለከቱ፥ በየመባቻውም የሚመጣውን ነገር የሚናገሩ ተነሥተው ከሚመጣብሽ ነገር ያድኑሽ።\n" +
                "14 ፤ እነሆ፥ እንደ እብቅ ይሆናሉ፥ እሳትም ያቃጥላቸዋል ሰውነታቸውንም ከነበልባል ኃይል አያድኑም፤ እርሱም ሰው እንደሚሞቀው ፍም፥ ወይም በፊቱ ሰው እንደሚቀመጥበት እሳት ያለ አይደለም።\n" +
                "15 ፤ የደከምሽባቸው ነገሮች እንዲህ ይሆኑብሻል፤ ከሕፃንነትሽ ጀምረው ከአንቺ ጋር ይነግዱ የነበሩ እያንዳንዳቸው ወደ ስፍራቸው ይሄዳሉ፥ የሚያድንሽም የለም።\n"));

        return new Chapter(47, verses);
    }

    private Chapter chapterFourtyEight() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እናንተ በእስራኤል ስም የተጠራችሁ ከይሁዳም ውኆች የወጣችሁ፥ በእግዚአብሔር ስም የምትምሉ፥ በእውነት ሳይሆን በጽድቅም ሳይሆን የእስራኤልን አምላክ የምትጠሩ፥\n" +
                "2 ፤ በቅድስት ከተማ ስም የተጠራችሁ፥ ስሙም የሠራዊት ጌታ እግዚአብሔር በሚባል በእስራኤል አምላክ የምትደገፉ፥ የያዕቆብ ቤት ሆይ፥ ይህን ስሙ።\n" +
                "3 ፤ የቀድሞውን ነገር ከጥንት ተናግሬአለሁ፥ ከአፌም ወጥቶአል አሳይቼውማለሁ፤ ድንገት አድርጌዋለሁ ተፈጽሞማል።\n" +
                "4 ፤ አንተ እልከኛ፥ አንገትህም የብረት ጅማት፥ ግምባርህም ናስ እንደሆነ አውቄአለሁ፤\n" +
                "5 ፤ ስለዚህ፥ አንተ። ጣዖቴ ይህን አድርጎአል፥ የተቀረጸው ምስሌና ቀልጦ የተሠራው ምስሌ ይህን አዘዙኝ እንዳትል፥ አስቀድሜ ነግሬህ ነበር ሳይሆንም አሳይቼህ ነበር።\n" +
                "6 ፤ ሰምተሃል፤ ይህን ሁሉ ተመልከት፤ እናንተም የምትናገሩት አይደላችሁምን? የተሰወሩትን ያላወቅሃቸውንም አዲሶች ነገሮችን ከዚህ ጀምሬ አሳይቼሃለሁ።\n" +
                "7 ፤ እነርሱም አሁን እንጂ ከጥንት አልተፈጠሩም፤ አንተም ። እነሆ፥ አውቄአቸዋለሁ እንዳትል ከዛሬ በፊት አልሰማሃቸውም።\n" +
                "8 ፤ አልሰማህም፥ አላወቅህም፥ ጆሮህ ከጥንት አልተከፈተችም፤ አንተ ፈጽሞ ወንጀለኛ እንደ ሆንህ ከማኅፀንም ጀምረህ ተላላፊ ተብለህ እንደተጠራህ አውቄአለሁና።\n" +
                "9 ፤ ስለ ስሜ ቍጣዬን አዘገያለሁ፥ እንዳላጠፋህም ስለ ምስጋናዬ እታገሣለሁ።\n" +
                "10 ፤ እነሆ፥ አንጥሬሃለሁ ነገር ግን እንደ ብር አይደለም፤ በመከራም እቶን ፈትኜሃለሁ።\n" +
                "11 ፤ ስለ እኔ፥ ስለ ራሴ አደርገዋለሁ ስሜ ተነቅፎአልና፤ ክብሬንም ለሌላ አልሰጥም።\n" +
                "12 ፤ ያዕቆብ ሆይ፥ የጠራሁህም እስራኤል ሆይ፥ ስማኝ፤ እኔ ነኝ፤ እኔ ፊተኛው ነኝ እኔም ኋለኛው ነኝ።\n" +
                "13 ፤ እጄም ምድርን መሥርታለች ቀኜም ሰማያትን ዘርግታለች፤ በጠራኋቸው ጊዜ በአንድነት ይቆማሉ።\n" +
                "14 ፤ እናንተ ሁሉ፥ በአንድነት ተሰብስባችሁ ስሙ፤ ከእነርሱ ይህን የተናገረ ማን ነው? እግዚአብሔር የወደደው ፈቃዱን በባቢሎን ላይ ያደርጋል፥ ክንዱም በከለዳውያን ላይ ይሆናል።\n" +
                "15 ፤ እኔ ራሴ ተናግሬአለሁ፤ እኔ ጠርቼዋለሁ፤ አምጥቼዋለሁ፥ መንገዱም ትከናወንለታለች።\n" +
                "16 ፤ ወደ እኔ ቅረቡ ይህንም ስሙ፤ እኔ ከጥንት ጀምሬ በስውር አልተናገርሁም፤ ከሆነበት ዘመን ጀምሮ እኔ በዚያ ነበርሁ፥ አሁንም ጌታ እግዚአብሔርና መንፈሱ ልከውኛል።\n" +
                "17 ፤ ታዳጊህ፥ የእስራኤል ቅዱስ፥ እግዚአብሔር እንዲህ ይላል ። እኔ የሚረባህን ነገር የማስተምርህ በምትሄድባትም መንገድ የምመራህ አምላክህ እግዚአብሔር ነኝ።\n" +
                "18 ፤ ትእዛዜን ብትሰማ ኖሮ፥ ሰላምህ እንደ ወንዝ ጽድቅህም እንደ ባሕር ሞገድ በሆነ ነበር፤\n" +
                "19 ፤ ዘርህም እንደ አሸዋ የሆድህም ትውልድ እንደ ምድር ትቢያ በሆነ ነበር፥ ስሙም ከፊቴ ባልጠፋና ባልፈረሰ ነበር።\n" +
                "20 ፤ ከባቢሎን ውጡ ከከለዳውያንም ኰብልሉ፤ በእልልታ ድምፅ ተናገሩ ይህንም ንገሩ እስከ ምድርም ዳርቻ ድረስ አውሩና። እግዚአብሔር ባሪያውን ያዕቆብን ታድጎታል በሉ።\n" +
                "21 ፤ በምድረ በዳ በኩል በመራቸው ጊዜ አልተጠሙም፤ ውኃንም ከዓለቱ ውስጥ አፈለቀላቸው፥ ዓለቱንም ሰነጠቀ ውኃውም ፈሰሰ።\n" +
                "22 ፤ ለክፉዎች ሰላም የላቸውም ይላል እግዚአብሔር።"));

        return new Chapter(48, verses);
    }

    private Chapter chapterFourtyNine() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ ደሴቶች ሆይ፥ ስሙኝ፥ እናንተም በሩቅ ያላችሁ አሕዛብ፥ አድምጡ፤ እግዚአብሔር ከማኅፀን ጠርቶኛል፥ ከእናቴም ሆድ ጀምሮ ስሜን አንሥቶአል፤\n" +
                "2 ፤ አፌንም እንደ ተሳለ ሰይፍ አድርጎአል፥ በእጁ ጥላ ሰውሮኛል፤ እንደ ተሳለ ፍላጻም አድርጎኛል፥ በሰገባውም ውስጥ ሽጎኛል።\n" +
                "3 ፤ እርሱም። እስራኤል ሆይ፥ አንተ ባሪያዬ ነህ በአንተም እከበራለሁ አለኝ።\n" +
                "4 ፤ እኔ ግን። በከንቱ ደከምሁ፥ ምንም ጥቅም ለሌለውና ለከንቱ ጕልበቴን ፈጀሁ፤ ፍርዴ ግን በእግዚአብሔር ዘንድ፥ ዋጋዬም በአምላኬ ዘንድ ነው አልሁ።\n" +
                "5 ፤ አሁንም በእግዚአብሔር ዓይን ከብሬአለሁና፥ አምላኬም ጕልበት ሆኖኛልና ያዕቆብን ወደ እርሱ እንድመልስ እስራኤልንም ወደ እርሱ እንድሰበስብ ባሪያ እሆነው ዘንድ ከማኅፀን ጀምሮ የሠራኝ እግዚአብሔር እንዲህ ይላል።\n" +
                "6 ፤ እርሱም። የያዕቆብን ነገዶች እንድታስነሣ ከእስራኤልም የዳኑትን እንድትመስል ባሪያዬ ትሆን ዘንድ እጅግ ቀላል ነገር ነውና እስከ ምድር ዳር ድረስ መድኃኒት ትሆን ዘንድ ለአሕዛብ ብርሃን አድርጌ ሰጥቼሃለሁ ይላል።\n" +
                "7 ፤ የእስራኤል ታዳጊ ቅዱሱም፥ እግዚአብሔር፥ ሰዎች ለሚንቁት ሕዝብም ለሚጠላው ለገዥዎች ባሪያ እንዲህ ይላል። ስለ ታማኙ ስለ እግዚአብሔር ስለ መረጠህም ስለ እስራኤል ቅዱስ ነገሥታት አይተው ይነሣሉ፥ መሳፍንትም አይተው ይሰግዳሉ።\n" +
                "8 ፤ እግዚአብሔር እንዲህ ይላል። በተወደደ ጊዜ ሰምቼሃለሁ፥ በመድኃኒትም ቀን ረድቼሃለሁ፤ እጠብቅህማለሁ፥ ምድርንም ታቀና ዘንድ፥ ውድማ የሆኑትንም ርስቶች ታወርስ ዘንድ፥\n" +
                "9 ፤ የተጋዙትንም። ውጡ በጨለማም የተቀመጡትን። ተገለጡ ትል ዘንድ ቃል ኪዳን አድርጌ ለሕዝቡ ሰጥቼሃለሁ። በመንገድም ላይ ይሰማራሉ፥ ማሰማርያቸውም በወና ኮረብታ ሁሉ ላይ ይሆናል።\n" +
                "10 ፤ የሚራራላቸውም ይመራቸዋልና፥ በውኃም ምንጮች በኩል ይነዳቸዋልና አይራቡም፥ አይጠሙም፥ ትኩሳት ወይም ፀሐይ አይጐዳቸውም።\n" +
                "11 ፤ ተራሮቼንም ሁሉ መንገድ አደርጋለሁ፥ ጎዳኖቼም ከፍ ከፍ ይላሉ።\n" +
                "12 ፤ እነሆ፥ እነዚህ ከሩቅ፥ እነሆም፥ እነዚህ ከሰሜንንና ከምዕራብ፥ እነዚህም ከሲኒም አገር ይመጣሉ።\n" +
                "13 ፤ እግዚአብሔር ሕዝቡን አጽናንቶአልና፥ ለችግረኞቹም ራርቶአልና ሰማያት ሆይ፥ ዘምሩ፥ ምድር ሆይ፥ ደስ ይበልሽ ተራሮችም ሆይ፥ እልል በሉ።\n" +
                "14 ፤ ጽዮን ግን። እግዚአብሔር ትቶኛል ጌታም ረስቶኛል አለች።\n" +
                "15 ፤ በውኑ ሴት ከማኅፀንዋ ለተወለደው ልጅ እስከማትራራ ድረስ ሕፃንዋን ትረሳ ዘንድ ትችላለችን? አዎን፥ እርስዋ ትረሳ ይሆናል፥ እኔ ግን አልረሳሽም።\n" +
                "16 ፤ እነሆ፥ እኔ በእጄ መጻፍ ቀርጬሻለሁ፥ ቅጥሮችሽም ሁልጊዜ በፊቴ አሉ።\n" +
                "17 ፤ ልጆችሽ ይፈጥናሉ፤ ያፈረሱሽና ያወደሙሽ ከአንቺ ዘንድ ይወጣሉ።\n" +
                "18 ፤ ዓይንሽን አንሥተሽ በዙሪያሽ ተመልከቺ፤ እነዚህ ሁሉ ተሰብስበው ወደ አንቺ ይመጣሉ። እኔ ሕያው ነኝና እነዚህን ሁሉ እንደ ጌጥ ትለብሻቸዋለሽ፥ እንደ ሙሽራም ትጐናጸፊአቸዋለሽ፥ ይላል እግዚአብሔር።\n" +
                "19 ፤ ባድማሽና ውድማሽ ወናም የሆነው ምድርሽ ከሚኖሩብሽ የተሣ ዛሬ ጠባብ ትሆናለችና፥ የዋጡሽም ይርቃሉና።\n" +
                "20 ፤ የወላድ መካን ከሆንሽ በኋላ የተወለዱልሽ ልጆችሽ በጆሮሽ። ስፍራ ጠብቦኛልና እቀመጥ ዘንድ ቦታ አስፊልኝ ይላሉ።\n" +
                "21 ፤ አንቺም በልብሽ፥ የወላድ መካን ሆኛለሁና፥ እኔም ብቻዬን ተሰድጄአለሁና ተቅበዝበዤ አለሁምና እነዚህን ማን ወለደልኝ? እነዚህንስ ማን አሳደጋቸው? እነሆ፥ ብቻዬን ቀርቼ ነበር፤ እነዚህስ ወዴት ነበሩ? ትያለሽ።\n" +
                "22 ፤ ጌታ እግዚአብሔር እንዲህ ይላል። እነሆ፥ እጄን ወደ አሕዛብ አነሣለሁ፥ ዓለማዬንም ወደ ወገኖች አቆማለሁ፤ ወንዶች ልጆችሽንም በብብታቸው ያመጡአቸዋል፥ ሴቶች ልጆችሽንም በጫንቃቸው ላይ ይሸከሙአቸዋል።\n" +
                "23 ፤ ነገሥታትም አሳዳጊ አባቶችሽ ይሆናሉ፥ እቴጌዎቻቸውም ሞግዚቶችሽ ይሆናሉ፤ ግምባራቸውንም ወደ ምድር ዝቅ አድርገው ይሰግዱልሻል፥ የእግርሽንም ትቢያ ይልሳሉ፤ እኔም እግዚአብሔር እንደ ሆንሁ ታውቂያለሽ፥ እኔንም በመተማመን የሚጠባበቁ አያፍሩም።\n" +
                "24 ፤ በውኑ ብዝበዛ ከኃያል እጅ ይወሰዳልን? ወይስ የጨካኙ ምርኮኞች ያመልጣሉን?\n" +
                "25 ፤ እግዚአብሔር ግን እንዲህ ይላል። በኃያላን የተማረኩ ይወሰዳሉ፥ የጨካኞችም ብዝበዛ ያመልጣል፤ ከአንቺ ጋር የሚጣሉትን እጣላቸዋለሁ፥ ልጆችሽንም አድናለሁ።\n" +
                "26 ፤ አስጨናቂዎችሽንም ሥጋቸውን አስበላቸዋለሁ፥ እንደ ጣፋጭም ወይን ጠጅ ደማቸውን ጠጥተው ይሰክራሉ፤ ሥጋ ለባሹም ሁሉ እኔ እግዚአብሔር መድኃኒትሽና ታዳጊሽ፥ የያዕቆብ ኃያል እንደ ሆንሁ ያውቃል።\n"));

        return new Chapter(49, verses);
    }

    private Chapter chapterFifty() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እግዚአብሔር እንዲህ ይላል። እናታችሁን የፈታሁበት የፍችዋ ጽሕፈት የት አለ? ወይስ እናንተን የሸጥሁ ከአበዳሪዎች ለየትኛው ነው? እነሆ፥ ስለ ኃጢአታችሁ ተሽጣችኋል፥ ስለ በደላችሁም እናታችሁ ተፈትታለች።\n" +
                "2 ፤ በመጣሁስ ጊዜ ሰው ስለ ምን አልነበረም? በጠራሁስ ጊዜ የሚመልስ ስለ ምን አልነበረም? መታደግ እንዳትችል እጄ አጭር ሆናለችን? ወይስ ለማዳን ኃይል የለኝምን? እነሆ፥ በገሠጽሁ ጊዜ ባሕርን አደርቃለሁ፥ ወንዞችንም ምድረ በዳ አደርጋቸዋለሁ፤ ውኃም በማጣት ዓሦቻቸው ይገማሉ በጥማትም ይሞታሉ።\n" +
                "3 ፤ ሰማያትን ጥቍረት አለብሳቸዋለሁ፥ መጋረጃቸውንም ማቅ አደርጋለሁ።\n" +
                "4 ፤ የደከመውን በቃል እንዴት እንደምደግፍ አውቅ ዘንድ ጌታ እግዚአብሔር የተማሩትን ምላስ ሰጥቶኛል ማለዳ ማለዳ ያነቃኛል፥ እንደ ተማሪዎችም ትሰማ ዘንድ ጆሮዬን ያነቃቃል።\n" +
                "5 ፤ ጌታ እግዚአብሔር ጆሮዬን ከፍቶአል፥ እኔም ዓመፀኛ አልነበርሁም ወደ ኋላዬም አልተመለስሁም።\n" +
                "6 ፤ ጀርባዬን ለገራፊዎች ጕንጬንም ለጠጕር ነጪዎች ሰጠሁ፥ ፊቴንም ከውርደትና ከትፋት አልመለስሁም።\n" +
                "7 ፤ ጌታ እግዚአብሔር ይረዳኛልና ስለዚህ አልታወክሁም፤ ስለዚህም ፊቴን እንደ ባልጩት ድንጋይ አድርጌዋለሁ፥ እንዳላፍርም አውቃለሁ።\n" +
                "8 ፤ የሚያጸድቀኝ ቅርብ ነው፤ ከእኔስ ጋር የሚከራከር ማን ነው? በአንድነት እንቁም፤ የሚከራከረኝ ማን ነው? ወደ እኔ ይቅረብ።\n" +
                "9 ፤ እነሆ፥ ጌታ እግዚአብሔር ይረዳኛል፤ ማን ይፈርድብኛል? እነሆ፥ ሁሉ እንደ ልብስ ያረጃሉ ብልም ይበላቸዋል።\n" +
                "10 ፤ ከእናንተ እግዚአብሔርን የሚፈራ፥ የባሪያውንም ቃል የሚሰማ፥ በጨለማም የሚሄድ፥ ብርሃንም የሌለው፥ ነገር ግን በእግዚአብሔር ስም የሚታመን፥ በአምላኩም የሚደገፍ ማን ነው?\n" +
                "11 ፤ እነሆ፥ እሳት የምታነድዱ የእሳትንም ወላፈን የምትታጠቁ ሁላችሁ፥ በእሳታችሁ ነበልባል ባነደዳችሁትም ወላፈን ሂዱ፤ ይህ ከእጄ ይሆንባችኋል፤ በኀዘን ትተኛላችሁ።\n"));

        return new Chapter(50, verses);
    }
    private Chapter chapterFiftyOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እናንተ ጽድቅን የምትከተሉ እግዚአብሔርንም የምትሹ፥ ስሙኝ፤ ከእርሱ የተቈረጣችሁበትን ድንጋይ ከእርሱም የተቈፈራችሁበትን ጕድጓድ ተመልከቱ።\n" +
                "2 ፤ ወደ አባታችሁ ወደ አብርሃም፥ ወደ ወለደቻችሁም ወደ ሳራ ተመልከቱ፤ አንድ ብቻውን በሆነ ጊዜ ጠራሁት፥ ባረክሁትም አበዛሁትም።\n" +
                "3 ፤ እግዚአብሔርም ጽዮንን ያጽናናል፤ በእርስዋም ባድማ የሆነውን ሁሉ ያጽናናል፥ ምድረ በዳዋንም እንደ ዔደን በረሀዋንም እንደ እግዚአብሔር ገነት ያደርጋል፤ ደስታና ተድላ ምስጋናና የዝማሬ ድምፅ ይገኝበታል።\n" +
                "4 ፤ ወገኔ ሆይ፥ አድምጠኝ፤ ሕዝቤ ሆይ፥ ስማኝ፤ ሕግ ከእኔ ይወጣልና ፍርዴም ለአሕዛብ ብርሃን ይሆናልና።\n" +
                "5 ፤ ጽድቄ ፈጥኖ ቀርቦአል፥ ማዳኔም ወጥቶአል፥ ክንዴም በአሕዛብ ላይ ይፈርዳል፤ ደሴቶች እኔን በመተማመን ይጠባበቃሉ፥ በክንዴም ይታመናሉ።\n" +
                "6 ፤ ዓይናችሁን ወደ ሰማይ አንሡ፥ ወደ ታችም ወደ ምድር ተመልከቱ፤ ሰማያት እንደ ጢስ በንነው ይጠፋሉ፥ ምድርም እንደ ልብስ ታረጃለች፥ የሚኖሩባትም እንዲሁ ይሞታሉ፤ ማዳኔ ግን ለዘላለም ይሆናል፥ ጽድቄም አይፈርስም።\n" +
                "7 ፤ ጽድቅን የምታውቁ ሕጌም በልባችሁ ያለ ሕዝብ ሆይ፥ ስሙኝ፤ የሰውን ተግዳሮት አትፍሩ፥ በስድባቸውም አትደንግጡ።\n" +
                "8 ፤ እንደ ልብስም ብል ይበላቸዋል፥ እንደ በግ ጠጕርም ትል ይበላቸዋል፤ ጽድቄ ግን ለዘላለም ማዳኔም ለትውልድ ሁሉ ይሆናል።\n" +
                "9 ፤ የእግዚአብሔር ክንድ ሆይ፥ ተነሥ፥ ተነሥ፥ ኃይልንም ልበስ፤ በቀድሞው ወራትና በጥንቱ ዘመን በነበረው ትውልድ እንደ ሆነው ተነሥ። ረዓብን የቈራረጥህ ዘንዶውንም የወጋህ አንተ አይደለህምን?\n" +
                "10 ፤ ባሕሩንና የታላቁን ጥልቅ ውኃ ያደረቅኸው፥ የዳኑትም ይሻገሩ ዘንድ ጠሊቁን ባሕር መንገድ ያደረግህ አንተ አይደለህምን?\n" +
                "11 ፤ እግዚአብሔርም የተቤዣቸው ይመለሳሉ ወደ ጽዮንም ይመጣሉ፤ የዘላለምም ደስታ በራሳቸው ላይ ይሆናል፤ ደስታንና ተድላን ያገኛሉ፥ ኀዘንና ልቅሶም ይሸሻል።\n" +
                "12 ፤ የማጽናናችሁ እኔ ነኝ፥ እኔ ነኝ፤ የሚሞተውን ሰው እንደ ሣርም የሚጠወልገውን የሰው ልጅ ትፈራ ዘንድ አንተ ማን ነህ?\n" +
                "13 ፤ ሰማያትንም የዘረጋው ምድርንም የመሠረተውን ፈጣሪህን እግዚአብሔርን ረስተሃል፤ ያጠፋ ዘንድ ባዘጋጀ ጊዜ ከአስጨናቂው ቍጣ የተነሣ ሁልጊዜ ቀኑን ሁሉ ፈርተሃል፤ የአስጨናቂው ቍጣ የት አለ?\n" +
                "14 ፤ ምርኮኛ ፈጥኖ ይፈታል፤ አይሞትም ወደ ጕድጓድም አይወርድም፥ እንጀራም አይጐድልበትም።\n" +
                "15 ፤ ሞገዱም እንዲተምም ባሕርን የማናውጥ አምላክህ እግዚአብሔር እኔ ነኝ፥ ስሜም የሠራዊት ጌታ እግዚአብሔር ነው።\n" +
                "16 ፤ ሰማያትን እዘረጋ ዘንድ ምድርንም እመሠርት ዘንድ፥ ጽዮንንም። አንቺ ሕዝቤ ነሽ እል ዘንድ ቃሌን በአፍህ አድርጌአለሁ፥ በእጄም ጥላ ጋርጄሃለሁ።\n" +
                "17 ፤ ከእግዚአብሔር እጅ የቍጣውን ጽዋ የጠጣሽ ኢየሩሳሌም ሆይ፥ ንቂ፥ ንቂ፥ ቁሚ፤ የሚያንገደግድን ዋንጫ ጠጥተሻል ጨልጠሽውማል።\n" +
                "18 ፤ ከወለደቻቸው ልጆች ሁሉ የሚመራት የለም፥ ካሳደገቻቸውም ልጆች ሁሉ እጅዋን የሚይዝ የለም።\n" +
                "19 ፤ እነዚህ ሁለት ነገሮች ሆነውብሻል፥ ማንስ ያስተዛዝንሻል? መፈታትና ጥፋት ራብና ሰይፍ ናቸው፤ እንዴትስ አድርጌ አጽናናሻለሁ?\n" +
                "20 ፤ ልጆችሽ ዝለዋል፤ በወጥመድ እንደተያዘ ሚዳቋ በአደባባይ ሁሉ ራስ ላይ ተኝተዋል፤ በእግዚአብሔር ቍጣና በአምላክሽ ተግሣጽ ተሞልተዋል።\n" +
                "21 ፤ ስለዚህም ያለ ወይን ጠጅ የሰከርሽ አንቺ ችግረኛ፥ ይህን ስሚ፤\n" +
                "22 ፤ ስለ ወገኑ የሚምዋገት አምላክሽ ጌታሽ እግዚአብሔር እንዲህ ይላል። እነሆ፥ የሚያንገደግድን ጽዋ የቍጣዬንም ዋንጫ ከእጅሽ ወስጃለሁ፤ ደግመሽም ከእንግዲህ ወዲህ አትጠጪውም።\n" +
                "23 ፤ ነፍስሽንም። እንሻገር ዘንድ ዝቅ በዪ በሚሉአት በአስጨናቂዎችሽ እጅ አኖረዋለሁ፤ ጀርባሽንም ለሚሻገሩት እንደ መሬትና እንደ መንገድ አደረግሽላቸው።\n"));
        // Add more verses as needed
        return new Chapter(51, verses);
    }

    private Chapter chapterFiftyTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ጽዮን ሆይ፥ ተነሺ፥ ተነሺ፥ ኃይልሽን ልበሺ፤ ቅድስቲቱ ከተማ ኢየሩሳሌም ሆይ፥ ያልተገረዘና ርኩስ ከእንግዲህ ወዲህ አይገባብሽምና ጌጠኛ ልብስሽን ልበሺ።\n" +
                "2 ፤ ኢየሩሳሌም ሆይ፥ ትቢያን አራግፊ፤ ተነሺ፥ ተቀመጪ፤ ምርኮኛይቱ የጽዮን ልጅ ሆይ፥ የአንገትሽን እስራት ፍቺ።\n" +
                "3 ፤ እግዚአብሔር እንዲህ ይላል። በከንቱ ተሽጣችሁ ነበር፥ ያለ ገንዘብም ትቤዣላችሁ።\n" +
                "4 ፤ ጌታ እግዚአብሔር እንዲህ ይላል። ወገኔ በዚያ እንግዳ ሆኖ ይቀመጥ ዘንድ አስቀድሞ ወደ ግብጽ ወረደ፥ አሦርም ያለ ምክንያት በደለው።\n" +
                "5 ፤ ወገኔ በከንቱ ተወስዶአልና አሁን ከዚህ ምን አለኝ? ይላል እግዚአብሔር፤ የሚገዙአቸው ይጮኻሉ፥ ይላል እግዚአብሔር፥ ስሜም ሁልጊዜ ቀኑን ሁሉ ይሰደባል።\n" +
                "6 ፤ ስለዚህ ወገኔ ስሜን ያውቃል፥ ስለዚህም የምናገር እኔ እንደ ሆንሁ በዚያ ቀን ያውቃሉ፤ እነሆ፥ እኔ ነኝ።\n" +
                "7 ፤ የምስራች የሚናገር፥ ሰላምንም የሚያወራ፥ የመልካምንም ወሬ የምስራች የሚናገር፥ መድኃኒትንም የሚያወራ፥ ጽዮንንም። አምላክሽ ነግሦአል የሚል ሰው እግሩ በተራሮች ላይ እጅግ ያማረ ነው።\n" +
                "8 ፤ እነሆ፥ ጕበኞችሽ ጮኸዋል፤ እግዚአብሔር ወደ ጽዮን በተመለሰ ጊዜ ዓይን በዓይን ይተያያሉና ድምፃቸውን ያነሣሉ፥ በአንድነትም ይዘምራሉ።\n" +
                "9 ፤ እናንተ የኢየሩሳሌም ፍርስራሾች ሆይ፥ እግዚአብሔር ሕዝቡን አጽናንቶአልና፥ ኢየሩሳሌምንም ታድጎአልና ደስ ይበላችሁ፥ በአንድነትም ዘምሩ።\n" +
                "10 ፤ እግዚአብሔር የተቀደሰውን ክንዱን በአሕዛብ ሁሉ ፊት ገልጦአል፥ በምድር ዳርቻ የሚኖሩትም ሁሉ የአምላካችንን መድኃኒት ያያሉ።\n" +
                "11 ፤ እናንተ የእግዚአብሔር ዕቃ የምትሸከሙ ሆይ፥ እልፍ በሉ፥ እልፍ በሉ፥ ከዚያ ውጡ፥ ርኩስን ነገር አትንኩ፥ ከመካከልዋ ውጡ፥ ንጽሐን ሁኑ።\n" +
                "12 ፤ እግዚአብሔር ይቀድማችኋልና፥ የእስራኤልም አምላክ ይከተላችኋልና በችኰላ አትወጡም በመኰብለልም አትሄዱም።\n" +
                "13 ፤ እነሆ፥ ባሪያዬ በማስተዋል ያደርጋል፤ ይከብራል ከፍ ከፍም ይላል፥ እጅግ ታላቅም ይሆናል።\n" +
                "14 ፤ ፊቱ ከሰዎች ሁሉ ይልቅ፥ መልኩም ከሰዎች ልጆች ይልቅ ተጐሳቍሎአልና ብዙ ሰዎች ስለ አንተ እንደ ተደነቁ፥ እንዲሁ ብዙ አሕዛብን ያስደንቃል፤\n" +
                "15 ፤ ያልተነገረላቸውንም ያያሉና፥ ያልሰሙትንም ያስተውላሉና ነገሥታት ስለ እርሱ አፋቸውን ይዘጋሉ።\n" ));
        // Add more verses as needed
        return new Chapter(52, verses);
    }

    private Chapter chapterFiftyThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ የሰማነውን ነገር ማን አምኖአል? የእግዚአብሔርስ ክንድ ለማን ተገልጦአል?\n" +
                "2 ፤ በፊቱ እንደ ቡቃያ ከደረቅም መሬት እንደ ሥር አድጎአል። መልክና ውበት የለውም፥ ባየነውም ጊዜ እንወድደው ዘንድ ደም ግባት የለውም።\n" +
                "3 ፤ የተናቀ ከሰውም የተጠላ፥ የሕማም ሰው ደዌንም የሚያውቅ ነው፤ ሰውም ፊቱን እንደሚሰውርበት የተናቀ ነው፥ እኛም አላከበርነውም።\n" +
                "4 ፤ በእውነት ደዌያችንን ተቀበለ ሕመማችንንም ተሸክሞአል፤ እኛ ግን እንደ ተመታ በእግዚአብሔርም እንደ ተቀሠፈ እንደ ተቸገረም ቈጠርነው።\n" +
                "5 ፤ እርሱ ግን ስለ መተላለፋችን ቈሰለ፥ ስለ በደላችንም ደቀቀ፤ የደኅንነታችንም ተግሣጽ በእርሱ ላይ ነበረ፥ በእርሱም ቍስል እኛ ተፈወስን።\n" +
                "6 ፤ እኛ ሁላችን እንደ በጎች ተቅበዝብዘን ጠፋን፤ ከእኛ እያንዳንዱ ወደ ገዛ መንገዱ አዘነበለ፤ እግዚአብሔርም የሁላችንን በደል በእርሱ ላይ አኖረ።\n" +
                "7 ፤ ተጨነቀ ተሣቀየም አፉንም አልከፈተም፤ ለመታረድ እንደሚነዳ ጠቦት፥ በሸላቶቹም ፊት ዝም እንደሚል በግ፥ እንዲሁ አፉን አልከፈተም።\n" +
                "8 ፤ በማስጨነቅና በፍርድ ተወሰደ፤ ስለ ሕዝቤ ኃጢአት ተመትቶ ከሕያዋን ምድር እንደ ተወገደ ከትውልዱ ማን አስተዋለ?\n" +
                "9 ፤ ከክፉዎችም ጋር መቃብሩን አደረጉ፥ ከባለጠጎችም ጋር በሞቱ ሆኖም ግፍን አላደረገም ነበር፥ በአፉም ተንኮል አልተገንበትም ነበር።\n" +
                "10 ፤ እግዚአብሔርም በደዌ ያደቅቀው ዘንድ ፈከደ፤ ነፍሱን ስለ ኃጢአት መሥዋዕት ካደረገ በኋላ ዘሩን ያያል፥ ዕድሜውም ይረዝማል፥ የእግዚአብሔርም ፈቃድ በእጁ ይከናወናል።\n" +
                "11 ፤ ከነፍሱ ድካም ብርሃን ያያል ደስም ይለዋል፤ ጻድቅ ባሪያዬም በእውቀቱ ብዙ ሰዎችን ያጸድቃል፥ ኃጢአታቸውን ይሰከማል።\n" +
                "12 ፤ ስለዚህም እርሱ ብዙዎችን ይወርሳል፥ ከኃያላንም ጋር ምርኮን ይከፋፈላል፤ ነፍሱን ለሞት አሳልፎ ሰጥቶአልና፥ ከዓመፀኞችም ጋር ተቈጥሮአልና፤ እርሱ ግን የብዙ ሰዎችን ኃጢአት ተሸከመ፥ ስለ ዓመፀኞችም ማለደ።\n"));
        // Add more verses as needed
        return new Chapter(53, verses);
    }

    private Chapter chapterFiftyFour() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ አንቺ ያልወለድሽ መካን ሆይ፥ ዘምሪ፤ አንቺ ያላማጥሽ ሆይ፥ እልል በዪ፥ ጩኺም፤ ባል ካላት ይልቅ ፈት የሆነቺቱ ልጆች በዝተዋልና፥ ይላል እግዚአብሔር።\n" +
                "2 ፤ የድንኳንሽን ስፍራ አስፊ፥ መጋረጃዎችሽንም ይዘርጉ፤ አትቈጥቢ፤ አውታሮችሽን አስረዝሚ ካስሞችሽንም አጽኚ።\n" +
                "3 ፤ በቀኝና በግራ ትሰፋፊያለሽና፥ ዘርሽም አሕዛብን ይወርሳልና፥ የፈረሱትንም ከተሞች መኖሪያ ያደርጋልና።\n" +
                "4 ፤ አታፍሪምና አትፍሪ፤ አተዋረጂምና አትደንግጪ፤ የሕፃንነትሽንም እፍረት ትረሺዋለሽ፥ የመበለትነትሽንም ስድብ ከእንግዲህ ወዲህ አታስቢም።\n" +
                "5 ፤ ፈጣሪሽ ባልሽ ነው፥ ስሙም የሠራዊት ጌታ እግዚአብሔር ነው፤ የእስራኤልም ቅዱስ ታዲጊሽ ነው፥ እርሱም የምድር ሁሉ አምላክ ይባላል።\n" +
                "6 ፤ እግዚአብሔር እንደ ተተወችና እንደ ተበሳጨች በልጅነትዋም እንደ ተጣለች ሚስት ጠርቶሻል፥ ይላል አምላክሽ።\n" +
                "7 ፤ ጥቂት ጊዜ ተውሁሽ፥ በታላቅም ምሕረት እሰበስብሻለሁ።\n" +
                "8 ፤ በጥቂት ቍጣ ለቅጽበት ዓይን ፊቴን ከአንቺ ሰወርሁ፥ በዘላለምም ቸርነት እምርሻለሁ፥ ይላል ታዳጊሽ እግዚአብሔር።\n" +
                "9 ፤ ይህ ለእኔ እንደ ኖኅ ውኃ ነው፤ የኖኅ ውኃ ደግሞ በምድር ላይ እንዳያልፍ እንደ ማልሁ፥ እንዲሁ አንቺን እንዳልቈጣ እንዳልዘልፍሽም ምያለሁ።\n" +
                "10 ፤ ተራሮች ይፈልሳሉ፥ ኮረብቶችም ይወገዳሉ፤ ቸርነቴ ግን ከአንቺ ዘንድ አይፈልስም የሰላሜም ቃል ኪዳን አይወገድም፥ ይላል መሐሪሽ እግዚአብሔር።\n" +
                "11 ፤ አንቺ የተቸገርሽ በዐውል ነፋስም የተናወጥሽ ያልተጽናናሽም፥ እነሆ፥ ድንጋዮችሽን ሸላልሜ እገነባለሁ፥ በሰንፔርም እመሠርትሻለሁ።\n" +
                "12 ፤ የግንብሽንም ጕልላት በቀይ ዕንቍ፥ በሮችሽንም በሚያብረቀርቅ ዕንቍ፥ ዳርቻሽንም ሁሉ በከበሩ ድንጋዮች እሠራለሁ።\n" +
                "13 ፤ ልጆችሽም ሁሉ ከእግዚአብሔር የተማሩ ይሆናሉ፥ የልጆችሽም ሰላም ብዙ ይሆናል።\n" +
                "14 ፤ በጽድቅ ትታነጺያለሽ፤ ከግፍ ራቂ፥ አትፈሪምም፥ ድንጋጤም ወደ አንቺ አትቀርብም።\n" +
                "15 ፤ እነሆ፥ ይሰበሰባሉ፥ ነገር ግን ከእኔ ዘንድ አይሆንም፤ በአንቺም ላይ የሚሰበሰቡ ሁሉ ከአንቺ የተነሣ ይወድቃሉ።\n" +
                "16 ፤ እነሆ፥ ፍሙን በወናፍ የሚያናፋ ለሥራውም መሣሪያ የሚያወጣ ብረት ሠሪን እኔ ፈጥሬአለሁ፤ የሚያፈርሰውንም እንዲያጠፋ ፈጥሬአለሁ።\n" +
                "17 ፤ በአንቺ ላይ የተሠራ መሣሪያ ሁሉ አይከናወንም፤ በፍርድም በሚነሣብሽ ምላስ ሁሉ ትፈርጂበታለሽ። የእግዚአብሔር ባሪያዎች ርስት ይህ ነው፥ ጽድቃቸውም ከእኔ ዘንድ ነው፥ ይላል እግዚአብሔር።\n"));
        // Add more verses as needed
        return new Chapter(54, verses);
    }
    private Chapter chapterFiftyFive() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እናንተ የተጠማችሁ ሁሉ፥ ወደ ውኃ ኑ፥ ገንዘብም የሌላችሁ ኑና ግዙ ብሉም፤ ኑ ያለ ገንዘብም ያለ ዋጋም የወይን ጠጅና ወተት ግዙ።\n" +
                "2 ፤ ገንዘብን እንጀራ ላይደለ፥ የድካማችሁንም ዋጋ ለማያጠግብ ነገር ለምን ትመዝናላችሁ? አድምጡኝ፥ በረከትንም ብሉ፥ ሰውነታችሁም በጮማ ደስ ይበለው።\n" +
                "3 ፤ ጆሮአችሁን አዘንብሉ ወደ እኔም ቅረቡ፤ ስሙ ሰውነታችሁም በሕይወት ትኖራለች፤ የታመነችይቱን የዳዊትን ምሕረት፥ የዘላለምን ቃል ኪዳን ከእናንተ ጋር አደርጋለሁ።\n" +
                "4 ፤ እነሆ፥ ለአሕዛብ ምስክር፥ ለወገኖችም አለቃና አዛዥ እንዲሆን ሰጥቼዋለሁ።\n" +
                "5 ፤ እነሆ፥ የማታውቀውን ሕዝብ ትጠራለህ፥ የእስራኤልም ቅዱስ አክብሮሃልና ስለ አምላክህ ስለ እግዚአብሔር የማያውቁህ ሕዝብ ወደ አንተ ይሮጣሉ።\n" +
                "6 ፤ እግዚአብሔር በሚገኝበት ጊዜ ፈልጉት፥ ቀርቦም ሳለ ጥሩት፤\n" +
                "7 ፤ ክፉ ሰው መንገዱን በደለኛም አሳቡን ይተው፤ ወደ እግዚአብሔርም ይመለስ እርሱም ይምረዋል፥ ይቅርታውም ብዙ ነውና ወደ አምላካችን ይመለስ።\n" +
                "8 ፤ አሳቤ እንደ አሳባችሁ መንገዳችሁም እንደ መንገዴ አይደለምና ይላል እግዚአብሔር።\n" +
                "9 ፤ ሰማይ ከምድር ከፍ እንደሚል፥ እንዲሁ መንገዴ ከመንገዳችሁ አሳቤም ከአሳባችሁ ከፍ ያለ ነው።\n" +
                "10 ፤ ዝናብና በረዶ ከሰማይ እንደሚወርድ፥ ምድርን እንደሚያረካት፥ ታበቅልና ታፈራም ዘንድ እንደሚያደርጋት፥ ዘርንም ለሚዘራ እንጀራንም ለሚበላ እንደሚሰጥ እንጂ ወደ ሰማይ እንደማይመለስ፥\n" +
                "11 ፤ ከአፌ የሚወጣ ቃሌ እንዲሁ ይሆናል፤ የምሻውን ያደርጋል የላክሁትንም ይፈጽማል እንጂ ወደ እኔ በከንቱ አይመለስም።\n" +
                "12 ፤ እናንተም በደስታ ትወጣላችሁ በሰላምም ትሸኛላችሁ፤ ተራሮችና ኮረብቶች በፊታችሁ እልልታ ያደርጋሉ፥ የሜዳም ዛፎች ሁሉ ያጨበጭባሉ።\n" +
                "13 ፤ በእሾህም ፋንታ ጥድ በኩርንችትም ፋንታ ባርሰነት ይበቅላል፤ ለእግዚአብሔርም መታሰቢያን ለዘላለምም የማይጠፋ፥ ምልክት ይሆናል።\n"));

        return new Chapter(55, verses);
    }

    private Chapter chapterFiftySix() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እግዚአብሔር እንዲህ ይላል። ማዳኔ ሊመጣ ጽድቄም ሊገለጥ ቀርቦአልና ፍርድን ጠብቁ ጽድቅንም አድርጉ።\n" +
                "2 ፤ ይህን የሚያደርግ ሰው ይህንንም የሚይዝ የሰው ልጅ፥ እንዳያረክሰው ሰንበትንም የሚጠብቅ እጁንም ክፋት ከማድረግ የሚጠብቅ ብፁዕ ነው።\n" +
                "3 ፤ ወደ እግዚአብሔርም የተጠጋ መጻተኛ። በእውነት እግዚአብሔር ከሕዝቡ ይለየኛል አይበል፤ ጃንደረባም። እነሆ፥ እኔ ደረቅ ዛፍ ነኝ አይበል።\n" +
                "4 ፤ እግዚአብሔር ሰንበቴን ስለሚጠብቁ ደስ የሚያሰኘኝንም ነገር ስለሚመርጡ ቃል ኪዳኔንም ስለሚይዙ ጃንደረቦች እንዲህ ይላልና።\n" +
                "5 ፤ በቤቴና በቅጥሬ ውስጥ ከወንዶችና ከሴቶች ልጆች ይልቅ የሚበልጥ መታሰቢያና ስም እሰጣቸዋለሁ፤ የማይጠፋም የዘላለም ስም እሰጣቸዋለሁ።\n" +
                "6 ፤ ያገለግሉት ዘንድ የእግዚአብሔርንም ስም ይወድዱ ዘንድ ባሪያዎቹም ይሆኑ ዘንድ ወደ እግዚአብሔር የሚጠጉትንም መጻተኞች፥ እንዳያረክሱት ሰንበትን የሚጠብቁትን ቃል ኪዳኔንም የሚይዙትን ሁሉ፥\n" +
                "7 ፤ ወደ ተቀደሰ ተራራዬ አመጣቸዋለሁ፥ በጸሎቴም ቤት ደስ አሰኛቸዋለሁ፤ ቤቴ ለአሕዛብ ሁሉ የሚሆን የጸሎት ቤት ይባላልና የሚቃጠለውን መሥዋዕታቸውንና ሌላ መሥዋዕታቸውን በመሠዊያዬ ላይ እቀበላለሁ።\n" +
                "8 ፤ ከእስራኤል የተበተኑትን የሚሰበስብ ጌታ እግዚአብሔር። ወደ ተሰበሰቡት ዘንድ ሌሎችን እሰበስብለታለሁ ይላል።\n" +
                "9 ፤ እናንተ የምድረ በዳ አራዊት ሁሉ፥ እናንተም የዱር አራዊት ሁሉ፥ ትበሉ ዘንድ ቅረቡ።\n" +
                "10 ፤ ጕበኞቹ ዕውሮች ናቸው፥ ሁሉ ያለ እውቀት ናቸው፤ ሁሉም ዲዳ የሆኑ ውሾች ናቸው ይጮኹም ዘንድ አይችሉም፤ ሕልምን ያልማሉ፤ ይተኛሉ፤ ማንቀላፋትንም ይወድዳሉ።\n" +
                "11 ፤ መብል ወዳጆች ከቶ የማይጠግቡ ውሾች ናቸው፥ እነርሱም ያስተውሉ ዘንድ የማይችሉ እረኞች ናቸው፤ ሁሉ ወደ መንገዳቸው፥ ከፊተኛው እስከ ኋለኛው ድረስ ሁሉ፥ እያንዳንዳቸው ወደ ጥቅማቸው ዘወር ብለዋል።\n" +
                "12 ፤ ኑ የወይን ጠጅ እንውሰድ፥ በሚያሰክርም መጠጥ እንርካ፤ ዛሬም እንደ ሆነ እንዲሁ ነገ ይሆናል፥ ከዛሬም ይልቅ እጅግ ይበልጣል ይላሉ።\n" ));

        return new Chapter(56, verses);
    }

    private Chapter chapterFiftySeven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ጻድቅ ይሞታል፥ በልቡም ነገሩን የሚያኖር የለም፤ ምሕረተኞችም ይወገዳሉ፥ ጽድቅም ከክፋት ፊት እንደ ተወገደ ማንም አያስተውልም።\n" +
                "2 ፤ ወደ ሰላም ይገባል፤ በቅንነት የሄደ በአልጋው ላይ ያርፋል።\n" +
                "3 ፤ እናንተ የአስማተኛይቱ ልጆች፥ የአመንዝራውና የጋለሞታይቱ ዘር፥ ወደዚህ ቅረቡ።\n" +
                "4 ፤ በማን ታላግጣላችሁ? በማንስ ላይ አፋችሁን ታላቅቃላችሁ? ምላሳችሁንስ በማን ላይ ታስረዝማላችሁ?\n" +
                "5 ፤ እናንተ በአድባር ዛፎች መካከል በለመለመም ዛፍ ሁሉ በታች በፍትወት የምትቃጠሉ፥ እናንተም በሸለቆች ውስጥ በዓለትም ስንጣቂዎች በታች ሕፃናትን የምታርዱ፥ የዓመፅ ልጆችና የሐሰት ዘር አይደላችሁምን?\n" +
                "6 ፤ በሸለቆው ውስጥ ያሉ የለዘቡ ድንጋዮች እድል ፈንታሽ ናቸው፥ እነርሱም ዕጣሽ ናቸው፤ ለእነርሱም የመጠጥ ቍርባን አፍስሰሻል፥ የእህልንም ቍርባን አቅርበሻል። እንግዲህ በዚህ ነገር አልቈጣምን?\n" +
                "7 ፤ ከፍ ባለውም በረዘመውም ተራራ ላይ መኝታሽን አደረግሽ፥ መሥዋዕትንም ትሠዊ ዘንድ ወደዚያ ወጣሽ።\n" +
                "8 ፤ ከመዝጊያውና ከመቃኑ በኋላ መታሰቢያሽን አደረግሽ፤ እኔን ትተሽ ለሌላ ተገልጠሻል፥ ወጥተሽ መኝታሽን አስፍተሻል፤ ቃል ኪዳንም ተጋባሻቸው፥ ባየሽበትም ስፍራ ሁሉ መኝታቸውን ወደድሽ።\n" +
                "9 ፤ ዘይትም ይዘሽ ወደ ንጉሡ ሄድሽ፥ ሽቱሽንም አበዛሽ፥ መልእክተኞችሽንም ወደ ሩቅ ላክሽ፥ እስከ ሲኦልም ድረስ ተዋረድሽ።\n" +
                "10 ፤ በመንገድሽም ብዛት ደከምሽ፥ ነገር ግን። ተስፋ የለም አላልሽም፤ የጕልበትን መታደስ አገኘሽ፥ ስለዚህም አልዛልሽም።\n" +
                "11 ፤ ሐሰትን የተናገርሺው እኔንም ያላሰብሺው በልብሽም ነገሩን ያላኖርሺው ማንን ሰግተሽ ነው? ማንንስ ፈርተሽ ነው? እኔ ብዙ ጊዜ ዝም አልሁ፥ አንቺም አልፈራሽም።\n" +
                "12 ፤ እኔ ጽድቅሽን እናገራለሁ፥ ሥራሽም አይረባሽም።\n" +
                "13 ፤ ወደ አንቺ የሰበሰብሻቸው በጮኽሽ ጊዜ ይታደጉሽ፤ ንፋስ ግን ይወስዳቸዋል ሽውሽውታም ሁሉን ያስወግዳቸዋል። በእኔ የታመነ ግን ምድሪቱን ይገዛል፥ የተቀደሰውንም ተራራዬን ይወርሳል።\n" +
                "14 ፤ እርሱም። ጥረጉ፥ መንገድን አዘጋጁ፥ ከሕዝቤም መንገድ ዕንቅፋትን አውጡ ይላል።\n" +
                "15 ፤ ለዘላለም የሚኖር ስሙም ቅዱስ የሆነ፥ ከፍ ያለው ልዑል እንዲህ ይላል። የተዋረዱትን ሰዎች መንፈስ ሕያው አደርግ ዘንድ፥ የተቀጠቀጠውንም ልብ ሕያው አደርግ ዘንድ፥ የተቀጠቀጠና የተዋረደ መንፈስ ካለው ጋር በከፍታና በተቀደሰ ስፍራ እቀመጣለሁ።\n" +
                "16 ፤ መንፈስም የፈጠርሁትም ነፍስ ከፊቴ እንዳይዝል ለዘላለም አልጣላም፥ ሁልጊዜም አልቈጣም።\n" +
                "17 ፤ ስለ ኃጢአቱ ጥቂት ጊዜ ተቈጥቼ ቀሠፍሁት፥ ፊቴን ሰውሬ ተቈጣሁ፤ እርሱም በልቡ መንገድ እያፈገፈገ ሄደ።\n" +
                "18 ፤ መንገዱን አይቻለሁ እፈውሰውማለሁ፥ እመራውማለሁ፥ ለእርሱና ስለ እርሱም ለሚያለቅሱ መጽናናትን እመልሳለሁ።\n" +
                "19 ፤ የከንፈሮችን ፍሬ እፈጥራለሁ፤ በሩቅም በቅርብም ላለው ሰላም ሰላም ይሁን፥ እፈውሰውማለሁ፥ ይላል እግዚአብሔር።\n" +
                "20 ፤ ክፉዎች ግን እንደሚንቀሳቀስ ባሕር ናቸው፤ ጸጥ ይል ዘንድ አይችልምና፥ ውኆቹም ጭቃና ጕድፍ ያወጣሉና።\n" +
                "21 ፤ ለክፉዎች ሰላም የላቸውም ይላል አምላኬ።\n"));

        return new Chapter(57, verses);
    }

    private Chapter chapterFiftyEight() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በኃይልህ ጩኽ፥ አትቈጥብ፥ ድምፅህን እንደ መለከት አንሣ፥ ለሕዝቤ መተላለፋቸውን ለያዕቆብ ቤትም ኃጢአታቸውን ንገር።\n" +
                "2 ፤ ነገር ግን ዕለት ዕለት ይሹኛል መንገዴንም ያውቁ ዘንድ ይወድዳሉ፤ ጽድቅን እንዳደረጉ የአምላካቸውንም ፍርድ እንዳልተዉ ሕዝብ እውነተኛውን ፍርድ ይለምኑኛል፥ ወደ እግዚአብሔርም ለመቅረብ ይወድዳሉ።\n" +
                "3 ፤ ስለ ምን ጾምን፥ አንተም አልተመለከትኸንም? ሰውነታችንንስ ስለ ምን አዋረድን፥ አንተም አላወቅህም? ይላሉ። እነሆ፥ በጾማችሁ ቀን ፈቃዳችሁን ታደርጋላችሁ፥ ሠራተኞቻችሁንም ሁሉ ታስጨንቃላችሁ።\n" +
                "4 ፤ እነሆ፥ ለጥልና ለክርክር ትጾማላችሁ በግፍ ጡጫም ትማታላችሁ፤ ድምፃችሁንም ወደ ላይ ታሰሙ ዘንድ ዛሬ እንደምትጾሙት አትጾሙም።\n" +
                "5 ፤ እኔ የመረጥሁት ጾም ይህ ነውን? ሰውስ ነፍሱን የሚያዋርደው እንደዚህ ባለ ቀን ነውን? በውኑ ራሱን እንደ እንግጫ ዝቅ ያደርግ ዘንድ ማቅንና አመድንም በበታቹ ያነጥፍ ዘንድ ነውን? በውኑ ይህን ጾም፥ በእግዚአብሔርም ዘንድ የተወደደ ቀን ትለዋለህን?\n" +
                "6 ፤ እኔስ የመረጥሁት ጾም ይህ አይደለምን? የበደልን እስራት ትፈቱ ዘንድ፥ የቀንበርንስ ጠፍር ትለቅቁ ዘንድ፥ የተገፉትንስ አርነት ትሰድዱ ዘንድ፥ ቀንበሩንስ ሁሉ ትሰብሩ ዘንድ አይደለምን?\n" +
                "7 ፤ እንጀራህንስ ለተራበ ትቈርስ ዘንድ፥ ስደተኞቹን ድሆች ወደ ቤትህ ታገባ ዘንድ፥ የተራቈተውንስ ብታይ ታለብሰው ዘንድ፥ ከሥጋ ዘምድህ እንዳትሸሽግ አይደለምን?\n" +
                "8 ፤ የዚያን ጊዜ ብርሃንህ እንደ ንጋት ይበራል፥ ፈውስህም ፈጥኖ ይበቅላል፥ ጽድቅህም በፊትህ ይሄዳል፥ የእግዚአብሔርም ክብር በኋላህ ሆኖ ይጠብቅሃል።\n" +
                "9 ፤ የዚያን ጊዜ ትጠራለህ እግዚአብሔርም ይሰማሃል፤ ትጮኻለህ እርሱም። እነሆኝ ይላል። ከመካከልህ ቀንበርን ብታርቅ፥ ጣትህንም መጥቀስ ብትተው፥\n" +
                "10 ፤ ባታንጐራጕርም፥ ነፍስህንም ለተራበ ብታፈስስ፥ የተጨነቀውንም ነፍስ ብታጠግብ፥ ብርሃንህ በጨለማ ይወጣል ጨለማህም እንደ ቀትር ይሆናል።\n" +
                "11 ፤ እግዚአብሔርም ሁልጊዜ ይመራሃል፤ ነፍስህንም በመልካም ነገር ያጠግባል አጥንትህንም ያጠናል፤ አንተም እንደሚጠጣ ገነት፥ ውኃውም እንደማያቋርጥ ምንጭ ትሆናለህ።\n" +
                "12 ፤ ከዱሮ ዘመን የፈረሱት ስፍራዎች ይሠራሉ፥ የብዙ ትውልድም መሠረት ይታነጻል፤ አንተም። ሰባራውን ጠጋኝ፥ የመኖሪያ መንገድን አዳሽ ትባላለህ።\n" +
                "13 ፤ ፈቃድህን በተቀደሰው ቀኔ ከማድረግ እግርህን ከሰንበት ብትመልስ፥ ሰንበትንም ደስታ፥ እግዚአብሔርም የቀደሰውን ክቡር ብትለው፥ የገዛ መንገድህንም ከማድረግ ፈቃድህንም ከማግኘት ከንቱ ነገርንም ከመናገር ተከልክለህ ብታከብረው፥\n" +
                "14 ፤ በዚያን ጊዜ በእግዚአብሔር ደስ ይልሃል፥ በምድርም ከፍታዎች ላይ አወጣሃለሁ፥ የአባትህንም የያዕቆብን ርስት አበላሃለሁ፤ የእግዚአብሔር አፍ ተናግሮአልና።\n"));

        return new Chapter(58, verses);
    }

    private Chapter chapterFiftyNine() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ እነሆ፥ የእግዚአብሔር እጅ ከማዳን አላጠረችም፥ ጆሮውም ከመስማት አልደነቈረችም፤\n" +
                "2 ፤ ነገር ግን በደላችሁ በእናንተና በአምላካችሁ መካከል ለይታለች፥ እንዳይሰማም ኃጢአታችሁ ፊቱን ከእናንተ ሰውሮታል።\n" +
                "3 ፤ እጃችሁ በደም ጣታችሁም በበደል ረክሳለች፥ ከንፈራችሁም ሐሰትን ተናግሮአል፥ ምላሳችሁም ኃጢአትን አሰምቶአል።\n" +
                "4 ፤ በጽድቅ የሚጠራ በእውነትም የሚፈርድ የለም፤ በምናምንቴ ነገር ታምነዋል ሐሰትንም ተናግረዋል፤ ጕዳትን ፀንሰዋል በደልንም ወልደዋል፤\n" +
                "5 ፤ የእባብን እንቍላል ቀፈቀፉ፥ የሸረሪትንም ድር አደሩ፤ እንቍላላቸውንም የሚበላ ሰው ይሞታል፥ እንቍላሉም ሲሰበር እፉኝት ይወጣል።\n" +
                "6 ፤ ድሮቻቸውም ልብስ አይሆኑላቸውም፥ በሥራቸውም አይሸፈኑም፤ ሥራቸውም የበደል ሥራ ነው፥ የግፍም ሥራ በእጃቸው ነው።\n" +
                "7 ፤ እግሮቻቸው ወደ ክፋት ይሮጣሉ፥ ንጹሑን ደም ለማፍሰስ ይፈጥናሉ፤ አሳባቸው የኃጢአት አሳብ ነው፥ ጕስቍልናና ቅጥቃጤ በመንገዳቸው አለ።\n" +
                "8 ፤ የሰላምን መንገድ አያውቁም፥ በአካሄዳቸውም ፍርድ የለም፤ መንገዳቸውን አጣምመዋል፥ የሚሄድባትም ሁሉ ሰላምን አያውቅም።\n" +
                "9 ፤ ስለዚህ ፍርድ ከእኛ ዘንድ ርቆአል፥ ጽድቅም አላገኘንም፤ ብርሃንን በተስፋ እንጠባበቅ ነበር፥ እነሆም፥ ጨለማ ሆነ፤ ጸዳልን በተስፋ እንጠባበቅ ነበር፥ ነገር ግን በጨለማ ሄድን።\n" +
                "10 ፤ እንደ ዕውሮች ወደ ቅጥሩ ተርመሰመስን፥ ዓይን እንደሌላቸው ተርመሰመስን፤ በቀትር ጊዜ በድግዝግዝታ እንዳለ ሰው ተሰናከልን፥ እንደ ሙታን በጨለማ ስፍራ ነን።\n" +
                "11 ፤ ሁላችን እንደ ድቦች እንጮኻለን፥ እንደ ርግብ እንለቃቀሳለን፤ ፍርድን በተስፋ እንጠባበቅ ነበር እርሱም የለም፤ መዳንም ከእኛ ዘንድ ርቆአል።\n" +
                "12 ፤ ዓመፃችን በአንተ ፊት በዝቶአልና፥ ኃጢአታችን መስክሮብናልና፥ ዓመፃችን ከእኛ ጋር ነውና፥ በደላችንን እናውቃለንና።\n" +
                "13 ፤ ዐምፀናል፥ ሐሰትን ተናግረናል፥ አምላካችንንም ከመከተል ተመልሰናል፤ ግፍንና ዓመፅንም ተናግረናል፥ የኃጢአት ቃልንም ፀንሰን ከልብ አውጥተናል።\n" +
                "14 ፤ ፍርድም ወደ ኋላ ተመልሶአል፥ ጽድቅም በሩቅ ቆሞአል፤ እውነትም በአደባባይ ላይ ወድቆአልና፥ ቅንነትም ሊገባ አልቻለምና።\n" +
                "15 ፤ እውነትም ታጥቶአል፥ ከክፋትም የራቀ ሰው ለብዝበዛ ሆኖአል። እግዚአብሔርም አየ፥ ፍርድም ስለሌለ ተከፋ።\n" +
                "16 ፤ ሰውም እንደሌለ አየ፥ ወደ እርሱ የሚማልድ እንደሌለ ተረዳ ተደነቀም፤ ስለዚህ የገዛ ክንዱ መድኃኒት አመጣለት፥ ጽድቁም አገዘው።\n" +
                "17 ፤ ጽድቅንም እንደ ጥሩር ለበሰ፥ በራሱም ላይ የማዳንን ራስ ቍር አደረገ፤ የበቀልንም ልብስ ለበሰ፥ በቅንዓትም መጐናጸፊያ ተጐናጸፈ።\n" +
                "18 ፤ እንደ ሥራቸው መጠን እንዲሁ ቍጣን ለባላጋራዎቹ፥ ፍዳንም ለጠላቶቹ ይከፍላል፤ ለደሴቶችም ፍዳቸውን ይከፍላል።\n" +
                "19 ፤ እርሱ የእግዚአብሔር ነፋስ እንደሚነዳው እንደ ጐርፍ ፈሳሽ ይመጣልና በምዕራብ ያሉት የእግዚአብሔርን ስም፥ በፀሐይ መውጫም ያሉት ክብሩን ይፈራሉ።\n" +
                "20 ፤ ለጽዮን ታዳጊ ይመጣል፥ በያዕቆብም ዘንድ ከኃጢአት ለሚርቁ፥ ይላል እግዚአብሔር።\n" +
                "21 ፤ ከእርሱ ጋር ያለው ቃል ኪዳኔ ይህ ነው ይላል እግዚአብሔር፥ በአንተ ላይ ያለው መንፈሴ በአፍህም ውስጥ ያደረግሁት ቃሌ ከዛሬ ጀምሮ እስከ ዘላለም ድረስ ከአፍህ ከዘርህም አፍ ከዘር ዘርህም አፍ አያልፍም፥ ይላል እግዚአብሔር።\n"));

        return new Chapter(59, verses);
    }

    private Chapter chaptersixty() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ብርሃንሽ መጥቶአልና፥ የእግዚአብሔርም ክብር ወጥቶልሻልና ተነሺ፥ አብሪ።\n" +
                "2 ፤ እነሆ፥ ጨለማ ምድርን ድቅድቅ ጨለማም አሕዛብን ይሸፍናል፤ ነገር ግን በአንቺ ላይ እግዚአብሔር ይወጣል ክብሩም በአንቺ ላይ ይታያል፤\n" +
                "3 ፤ አሕዛብም ወደ ብርሃንሽ ነገሥታትም ወደ መውጫሽ ጸዳል ይመጣሉ።\n" +
                "4 ፤ ዓይኖችሽን አንሥተሽ በዙሪያሽ ተመልከቺ፤ እነዚህ ሁሉ ተሰብስበው ወደ አንቺ ይመጣሉ፤ ወንዶች ልጆችሽ ከሩቅ ይመጣሉ፥ ሴቶች ልጆችሽንም በጫንቃ ላይ ይሸከሙአቸዋል።\n" +
                "5 ፤ በዚያን ጊዜ የባሕሩ በረከት ወደ አንቺ ስለሚመለስ፥ የአሕዛብም ብልጥግና ወደ አንቺ ስለሚመጣ፥ አይተሽ ደስ ይልሻል፥ ልብሽም ይደነቃል ይሰፋማል።\n" +
                "6 ፤ የግመሎች ብዛት፥ የምድያምና የጌፌር ግመሎች፥ ይሸፍኑሻል፤ ሁሉ ከሳባ ይመጣሉ፥ ወርቅንና ዕጣንን ያመጣሉ የእግዚአብሔርንም ምስጋና ያወራሉ።\n" +
                "7 ፤ የቄዳር መንጎች ሁሉ ወደ አንቺ ይሰበሰባሉ የነባዮትም አውራ በጎች ያገለግሉሻል፤ እኔን ደስ ሊያሰኙ በመሠዊያዬ ላይ ይወጣሉ፥ የክብሬንም ቤት አከብራለሁ።\n" +
                "8 ፤ ርግቦች ወደ ቤታቸው እንደሚበርሩ፥ እነዚህ እንደ ደመና የሚበርሩ እነማን ናቸው?\n" +
                "9 ፤ እርሱ አክብሮሻልና ለአምላክሽ ለእግዚአብሔር ስምና ለእስራኤል ቅዱስ ልጆችሽን ከሩቅ ከእነርሱ ጋርም ብራቸውንና ወርቃቸውን ያመጡ ዘንድ ደሴቶች የተርሴስ መርከቦችም አስቀድመው ይጠባበቁኛል።\n" +
                "10 ፤ በቍጣዬ ቀሥፌ በፍቅሬ ምሬሻለሁና መጻተኞች ቅጥርሽን ይሠራሉ፥ ነገሥታቶቻቸውም ያገለግሉሻል።\n" +
                "11 ፤ በሮችሽም ሁልጊዜ ይከፈታሉ፤ ሰዎች የአሕዛብን ብልጥግና የተማረኩትንም ነገሥታቶቻቸውን ወደ አንቺ ያመጡ ዘንድ ሌሊትና ቀን አይዘጉም።\n" +
                "12 ፤ ለአንቺም የማይገዛ ሕዝብና መንግሥት ይጠፋል፥ እነዚያ አሕዛብም ፈጽመው ይጠፋሉ።\n" +
                "13 ፤ የመቅደሴንም ስፍራ ያስጌጡ ዘንድ የሊባኖስ ክብር፥ ጥዱና አስታው ባርሰነቱም፥ ወደ አንቺ ይመጣሉ፥ የእግሬንም ስፍራ አከብራለሁ።\n" +
                "14 ፤ የአስጨናቂዎችሽም ልጆች አንገታቸውን ደፍተው ወደ አንቺ ይመጣሉ፥ የናቁሽም ሁሉ ወደ እግርሽ ጫማ ይሰግዳሉ፤ የእግዚአብሔርም ከተማ፥ የእስራኤል ቅዱስ የሆንሽ ጽዮን ይሉሻል።\n" +
                "15 ፤ ከሰውም ማንም እስከማያልፍብሽ ድረስ የተተውሽና የተጠላሽ ነበርሽ፤ ነገር ግን የዘላለም ትምክሕትና የልጅ ልጅ ደስታ አደርግሻለሁ።\n" +
                "16 ፤ የአሕዛብንም ወተት ትጠጫለሽ የነገሥታትንም ጡት ትጠቢያለሽ፤ እኔም እግዚአብሔር የያዕቆብ ኃይል፥ መድኃኒትሽና ታዳጊሽ እንደ ሆንሁ ታውቂያለሽ።\n" +
                "17 ፤ በናስ ፋንታ ወርቅን፥ በብረትም ፋንታ ብርን፥ በእንጨትም ፋንታ ናስን፥ በድንጋይም ፋንታ ብረትን አመጣለሁ። አለቆችሽንም ሰላም፥ የበላይ ገዢዎችሽንም ጽድቅ አደርጋለሁ፤\n" +
                "18 ፤ ከዚያ በኋላ በምድርሽ ውስጥ ግፍ፥ በዳርቻሽም ውስጥ ጕስቍልናና ቅጥቃጤ አይሰማም፤ ቅጥርሽን መዳን በሮችሽንም ምስጋና ብለሽ ትጠሪያለሽ\n" +
                "19 ፤ ከዚያ በኋላ እግዚአብሔር የዘላለም ብርሃንሽ፥ አምላክሽም ክብርሽ ይሆናልና ፀሐይ በቀን ብርሃን አይሆንልሽም፥ የጨረቃም ብርሃን በሌሊት አይበራልሽም።\n" +
                "20 ፤ እግዚአብሔር የዘላለም ብርሃንሽ ይሆናልና፥ የልቅሶሽም ወራት ታልቃለችና ፀሐይሽ ከዚያ በኋላ አትጠልቅም ጨረቃሽም አይቋረጥም።\n" +
                "21 ፤ ሕዝብሽም ሁሉ ጻድቃን ይሆናሉ፤ እኔም እከብር ዘንድ የአታክልቴን ቡቃያ፥ የእጄ ሥራ የምትሆን ምድሪቱንም ለዘላለም ይወርሳሉ።\n" +
                "22 ፤ ታናሹ ለሺህ የሁሉም ታናሹ ለብርቱ ሕዝብ ይሆናል፤ እኔ እግዚአብሔር በዘመኑ ይህን አፋጥነዋለሁ።\n"));

        return new Chapter(60, verses);
    }
    private Chapter chaptersixtyOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ የጌታ የእግዚአብሔር መንፈስ በእኔ ላይ ነው፥ ለድሆች የምሥራችን እሰብክ ዘንድ እግዚአብሔር ቀብቶኛልና፤ ልባቸው የተሰበረውን እጠግን ዘንድ፥ ለተማረኩትም ነጻነትን ለታሰሩትም መፈታትን እናገር ዘንድ ልኮኛል።\n" +
                "2 ፤ የተወደደችውን የእግዚአብሔርን ዓመት አምላካችንም የሚበቀልበትን ቀን እናገር ዘንድ፥ የሚያለቅሱትንም ሁሉ አጽናና ዘንድ፤\n" +
                "3 ፤ እግዚአብሔር ለክብሩ የተከላቸው የጽድቅ ዛፎች እንዲባሉ ለጽዮን አልቃሾች አደርግላቸው ዘንድ፥ በአመድ ፋንታ አክሊልን፥ በልቅሶም ፋንታ የደስታን ዘይት፥ በኀዘንም መንፈስ ፋንታ የምስጋናን መጐናጸፊያ እሰጣቸው ዘንድ ልኮኛል።\n" +
                "4 ፤ ከጥንትም ጀምሮ ባድማ የነበሩትን ይሠራሉ ከቀድሞ የፈረሱትንም ያቆማሉ፤ ባድማ የነበሩትንና ከብዙ ትውልድ በፊት የፈረሱትን ከተሞች እንደ ገና ይሠራሉ።\n" +
                "5 ፤ መጻተኞችም ቆመው በጎቻችሁን ያሰማራሉ፥ ሌሎች ወገኖችም አራሾችና ወይም ጠባቂዎች ይሆኑላችኋል።\n" +
                "6 ፤ እናንተ ግን የእግዚአብሔር ካህናት ትባላላችሁ፥ ሰዎቹም የአምላካችን አገልጋዮች ብለው ይጠሩአችኋል፤ የአሕዛብን ሀብት ትበላላችሁ፥ በክብራቸውም ትመካላችሁ።\n" +
                "7 ፤ በእፍረታችሁ ፋንታ ሁለት እጥፍ ይሆንላችኋል፥ በውርደታችሁም ፋንታ ዕድል ፈንታችሁ ደስ ይላቸዋል፤ ስለዚህ በምድራቸው ሁሉ እጥፍ ይገዛሉ፥ የዘላለምም ደስታ ይሆንላቸዋል።\n" +
                "8 ፤ እኔ እግዚአብሔር ፍርድን የምወድድ ስርቆትንና በደልን የምጠላ ነኝ፤ ፍዳቸውንም በእውነት እሰጣቸዋለሁ፥ ከእነርሱም ጋር የዘላለም ቃል ኪዳን አደርጋለሁ።\n" +
                "9 ፤ ዘራቸውም በአሕዛብ መካከል፥ ልጆቻቸውም በወገኖች መካከል የታወቁ ይሆናሉ፤ ያያቸው ሁሉ እግዚአብሔር የባረካቸው ዘር እንደ ሆኑ ይገነዘባል።\n" +
                "10 ፤ አክሊልን እንደ ለበሰ ሙሽራ፥ በጌጥ ሽልማትዋም እንዳጌጠች ሙሽራ፥ የማዳንን ልብስ አልብሶኛልና፥ የጽድቅንም መጐናጸፊያ ደርቦልኛልና በእግዚአብሔር እጅግ ደስ ይለኛል፥ ነፍሴም በአምላኬ ሐሤት ታደርጋለች።\n" +
                "11 ፤ ምድርም ቡቃያዋን እንደምታወጣ፥ ገነትም ዘሩን እንደሚያበቅል፥ እንዲሁ ጌታ እግዚአብሔር ጽድቅንና ምስጋናን በአሕዛብ ሁሉ ፊት ያበቅላል።\n"));
        // Add more verses as needed
        return new Chapter(61, verses);
    }

    private Chapter chaptersixtyTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ስለ ጽዮን ዝም አልልም፥ ስለ ኢየሩሳሌምም ጸጥ አልልም፥ ጽድቅዋ እንደ ጸዳል መዳንዋም እንደሚበራ ፋና እስኪወጣ ድረስ።\n" +
                "2 ፤ አሕዛብም ጽድቅሽን ነገሥታትም ሁሉ ክብርሽን ያያሉ፤ የእግዚአብሔርም አፍ በሚጠራበት በአዲሱ ስም ትጠሪያለሽ።\n" +
                "3 ፤ በእግዚአብሔር እጅ የክብር አክሊል፥ በአምላክሽም እጅ የመንግሥት ዘውድ ትሆኛለሽ።\n" +
                "4 ፤ ከእንግዲህ ወዲህ። የተተወች አትባዪም፤ ምድርሽም ከእንግዲህ ወዲህ። ውድማ አትባልም፤ ነገር ግን እግዚአብሔር በአንቺ ደስ ብሎታልና፥ ምድርሽም ባል ታገባለችና አንቺ። ደስታዬ የሚኖርባት ትባያለሽ ምድርሽም። ባል ያገባች ትባላለች።\n" +
                "5 ፤ ጕልማሳም ድንግሊቱን እንደሚያገባ፥ እንዲሁ ልጆችሽ ያገቡሻል፤ ሙሽራም በሙሽራይቱ ደስ እንደሚለው፥ እንዲሁ አምላክሽ በአንቺ ደስ ይለዋል።\n" +
                "6 ፤\n" +
                "7 ፤ ኢየሩሳሌም ሆይ፥ ጕበኞችን በቅጥርሽ ላይ አቁሜአለሁ፤ ቀንና ሌሊት ከቶ ዝም አይሉም፤ እናንተ እግዚአብሔርን የምታሳስቡ፥ ኢየሩሳሌምን እስኪያጸና በምድርም ላይ ምስጋና እስኪያደርጋት ድረስ አትረፉ ለእርሱም ዕረፍት አትስጡ።\n" +
                "8 ፤ እግዚአብሔር። ከእንግዲህ ወዲህ በእርግጥ ለጠላቶችሽ መብል ይሆን ዘንድ እህልሽን አልሰጥም፥ መጻተኞችም የደከምሽበትን ወይንሽን አይጠጡም፤\n" +
                "9 ፤ ነገር ግን የሰበሰቡት ይበሉታል እግዚአብሔርንም ያመሰግናሉ፥ ያከማቹትም በመቅደሴ አደባባይ ላይ ይጠጡታል ብሎ በቀኙና በኃይሉ ክንድ ምሎአል።\n" +
                "10 ፤ እለፉ፥ በበሮች በኩል እለፉ፤ የሕዝቡንም መንገድ ጥረጉ፤ አዘጋጁ፥ ጐዳናውን አዘጋጁ፥ ድንጋዮቹንም አስወግዱ፤ ለአሕዛብም ዓለማ አንሡ።\n" +
                "11 ፤ እነሆ፥ እግዚአብሔር ለምድር ዳርቻ አዋጅ እንዲህ ብሎ ነግሮአል። ለጽዮን ልጅ። እነሆ፥ መድኃኒትሽ ይመጣል፤ እነሆ፥ ዋጋው ከእርሱ ጋር ሥራውም በፊቱ አለ በሉአት።\n" +
                "12 ፤ እግዚአብሔር። የተቤዣቸው፥ የተቀደሰ ሕዝብ ብለው ይጠሩአቸዋል፤ አንቺም። የተፈለገች ያልተተወችም ከተማ ትባያለሽ።\n" ));
        // Add more verses as needed
        return new Chapter(62, verses);
    }

    private Chapter chaptersixtyThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ ይህ ከኤዶምያስ፥ ልብሱም የቀላ ከባሶራ የሚመጣ፥ አለባበሱ ያማረ፥ በጕልበቱ ጽናት የሚራመድ ማን ነው? በጽድቅ የምናገር ለማዳንም የምበረታ እኔ ነኝ።\n" +
                "2 ፤ ቀሚስህ ስለ ምን ቀላ? ልብስህስ በወይን መጥመቂያ እንደሚረግጥ ሰው ልብስ ስለ ምን መሰለ?\n" +
                "3 ፤ መጥመቂያውን ብቻዬን ረግጫለሁ፥ ከአሕዛብም አንድ ሰው ከእኔ ጋር አልነበረም፤ በቍጣዬ ረገጥኋቸው በመዓቴም ቀጠቀጥኋቸው፤ ደማቸውም በልብሴ ላይ ተረጭቶአል፥ ልብሴንም ሁሉ አስድፌአለሁ።\n" +
                "4 ፤ የምበቀልበት ቀን በልቤ ነውና፥ የምቤዥበትም ዓመት ደርሶአልና።\n" +
                "5 ፤ ተመለከትሁ፥ የሚረዳም አልተገኘም፤ የሚያግዝም አልነበረምና ተደነቅሁ፤ ስለዚህ የገዛ ክንዴ መድኃኒት አመጣልኝ፥ ቍጣዬም እርሱ አገዘኝ።\n" +
                "6 ፤ በቍጣዬም አሕዛብን ረገጥሁ በመዓቴም ቀጠቀጥኋቸው፥ ደማቸውንም ወደ ምድር አፈሰስሁት።\n" +
                "7 ፤ እግዚአብሔር እንደ ሰጠን ሁሉ፥ የእግዚአብሔርን ቸርነትና የእግዚአብሔርን ምስጋና፥ እንደ ምሕረቱና እንደ ቸርነቱም ብዛት ለእስራኤል ቤት የሰጠውን ትልቅ በጎነት አሳስባለሁ።\n" +
                "8 ፤ እርሱም። በእውነት ሕዝቤ፥ ሐሰትን የማያደርጉ ልጆች፥ ናቸው አለ፤ መድኃኒትም ሆነላቸው።\n" +
                "9 ፤ በጭንቃቸው ሁሉ እርሱ ተጨነቀ፥ የፊቱም መልአክ አዳናቸው፤ በፍቅሩና በርኅራኄውም ተቤዣቸው፥ በቀደመውም ዘመን ሁሉ አንሥቶ ተሸከማቸው።\n" +
                "10 ፤ እነርሱ ግን ዐመፁ ቅዱስ መንፈሱንም አስመረሩ፤ ስለዚህ ተመልሶ ጠላት ሆናቸው፥ እርሱም ተዋጋቸው።\n" +
                "11 ፤ እርሱም እንዲህ ብሎ የቀደመውን ዘመን አሰበ። የበጎቹን እረኛ ከባሕሩ ያወጣው ወዴት ነው ያለ? ቅዱስ መንፈሱንም በመካከላቸው ያኖረ ወዴት ነው ያለ?\n" +
                "12 ፤ የከበረውንም ክንድ በሙሴ ቀኝ ያስሄደ፥ ለራሱም የዘላለምን ስም ያደርግ ዘንድ ውኃውን በፊታቸው የከፈለ፥\n" +
                "13 ፤ በምድረ በዳም እንደሚያልፍ ፈረስ፥ በቀላይ ውስጥ ያለ ዕንቅፋት ያሳለፋቸው ወዴት ነው ያለ?\n" +
                "14 ፤ ወደ ሸለቆ እንደሚወርዱ ከብቶች፥ እንዲሁ የእግዚአብሔር መንፈስ ወደ ዕረፍት አመጣቸው፤ እንዲሁም ለራስህ የከበረ ስም ታደርግ ዘንድ ሕዝብን መራህ።\n" +
                "15 ፤ ከሰማይ ተመልከት፥ ከቅዱስነትህና ከክብርህም ማደሪያ ጐብኝ፤ ቅንዓትህና ኃይልህስ ወዴት ነው? ለእኔም የሆነው የልብህ ናፍቆትና ርኅራኄህ ተከለከለ።\n" +
                "16 ፤ አብርሃም ባያውቀን እስራኤልም ባይገነዘበን አንተ አባታችን ነህ፤ አቤቱ፥ አንተ አባታችን ነህ፥ ስምህም ከዘላለም ታዳጊያችን ነው።\n" +
                "17 ፤ አቤቱ፥ ከመንገድህ ለምን አሳትኸን? እንዳንፈራህም ልባችንን ለምን አጸናህብን? ስለ ባሪያዎችህ ስለ ርስትህ ነገዶች ተመለስ።\n" +
                "18 ፤ የተቀደሰው ሕዝብህ መቅደስህን ጥቂት ጊዜ ወረሱት፤ ጠላቶቻችንም ረግጠውታል።\n" +
                "19 ፤ ከዘላለም እንዳልገዛኸን በስምህም እንዳልተጠራን ሆነናል።\n"));
        // Add more verses as needed
        return new Chapter(63, verses);
    }

    private Chapter chaptersixtyFour() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ሰማዮችን ቀድደህ ምነው ብትወርድ! ተራሮችም ምነው ቢናወጡ!\n" +
                "2 ፤ እሳት ጭራሮውን እንደሚያቃጥል፥ እሳትም ውኃውን እንደሚያፈላ፥ ስምህ ለጠላቶችህ ይገለጥ ዘንድ፥ አሕዛብም በፊትህ ይንቀጠቀጡ ዘንድ።\n" +
                "3 ፤ ያልተጠባበቅነውን የክብርህን ሥራ ባደረግህ ጊዜ፥ ወረድህ ተራሮችም በፊትህ ተንቀጠቀጡ።\n" +
                "4 ፤ ሰዎች ከጥንት ጀምሮ ለሚጠብቁህ ከምትሠራላቸው ከአንተ በቀር ሌላ አምላክን አልሰሙም በጆሮአቸውም አልተቀበሉም ዓይንም አላየችም።\n" +
                "5 ፤ ጽድቅን የሚያደርገውን በመንገዶችህም የሚያስቡህን ትገናኛቸዋለህ። እነሆ፥ እነተ ተቈጣህ እኛም ኃጢአት ሠራን፤ ስለዚህም ተሳሳትን።\n" +
                "6 ፤ ሁላችን እንደ ርኩስ ሰው ሆነናል፥ ጽድቃችንም ሁሉ እንደ መርገም ጨርቅ ነው፤ ሁላችንም እንደ ቅጠል ረግፈናል፥ በደላችንም እንደ ነፋስ ወስዶናል።\n" +
                "7 ፤ ስምህንም የሚጠራ፥ አንተንም ሊይዝ የሚያስብ የለም፤ ፊትህንም ከእኛ ሰውረሃል፥ በኃጢአታችንም አጥፍተኸናል።\n" +
                "8 ፤ አሁን ግን፥ አቤቱ፥ አንተ አባታችን ነህ፤ እኛ ጭቃ ነን አንተም ሠሪያችን ነህ፥ እኛም ሁላችን የእጅህ ሥራ ነን።\n" +
                "9 ፤ አቤቱ፥ እጅግ አትቈጣ፥ ለዘላለምም ኃጢአትን አታስብ፤ እነሆ፥ እባክህ፥ ተመልከት፥ እኛ ሁላችን ሕዝብህ ነን።\n" +
                "10 ፤ የተቀደሱ ከተሞችህ ምድረ በዳ ሆነዋል፤ ጽዮን ምድረ በዳ ኢየሩሳሌምም ውድማ ሆናለች።\n" +
                "11 ፤ አባቶቻችን አንተን ያመሰገኑበት የተቀደሰና የተዋበ ቤታችን በእሳት ተቃጥሎአል፥ ያማረውም ስፍራችን ሁሉ ፈርሶአል።\n" +
                "12 ፤ አቤቱ፥ በውኑ በዚህ ነገር ትታገሣለህን? ዝምስ ትላለህን? አጥብቀህስ ታስጨንቀናለህን?\n"));
        // Add more verses as needed
        return new Chapter(64, verses);
    }
    private Chapter chaptersixtyFive() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ላልጠየቁኝ ተገለጥሁ፥ ላልፈለጉኝም ተገኘሁ፤ በስሜም ያልተጠራውን ሕዝብ። እነሆኝ፥ እነሆኝ አልሁት።\n" +
                "2 ፤ መልካም ባልሆነው መንገድ፥ አሳባቸውን እየተከተሉ፥ ወደሚሄዱ ወደ ዓመፀኛ ሕዝብ ቀኑን ሁሉ እጆቼን ዘረጋሁ።\n" +
                "3 ፤ ይህ ሕዝብ ዘወትር የሚያስቈጡኝ ናቸው፤ እነርሱ በአትክልት ውስጥ የሚሠዉ በጡብም ላይ የሚያጥኑ፥\n" +
                "4 ፤ በመቃብርም መካከል የሚቀመጡ፥ በስውርም ስፍራ የሚያድሩ፥ የእሪያ ሥጋም የሚበሉ ናቸው። የረከሰው መረቅ በዕቃቸው ውስጥ አለ።\n" +
                "5 ፤ እነርሱም። ለራስህ ቁም፥ እኔ ከአንተ ይልቅ ቅዱስ ነኝና ወደ እኔ አትቅረብ ይላሉ፤ እነዚህ በአፍንጫዬ ዘንድ ጢስ ቀኑንም ሁሉ የምትነድድ እሳት ናቸው።\n" +
                "6 ፤ እነሆ፥ በፊቴ ተጽፎአል። ኃጢአታችሁና የአባቶቻችሁን ኃጢአት በአንድ ላይ ወደ ብብታቸው ፍዳ አድርጌ አመልሳለሁ እንጂ ዝም አልልም፥ ይላል እግዚአብሔር፤\n" +
                "7 ፤ በተራሮችም ላይ ስላጠኑ፥ በኮረብቶችም ላይ ስለ ሰደቡኝ፥ ስለዚህ አስቀድመው የሠሩትን ሥራቸውን በብብታቸው እሰፍራለሁ።\n" +
                "8 ፤ እግዚአብሔር እንዲህ ይላል። ወይን በዘለላው በተገኘች ጊዜ። በረከት በእርስዋ ላይ አለና አታጥፉት እንደሚባለው፥ ሁሉን እንዳላጠፉ ስለባሪያዎቼ እንዲሁ አደርጋለሁ።\n" +
                "9 ፤ ከያዕቆብ ዘርን ከይሁዳም ተራሮቼን የሚወርሰውን አወጣለሁ፤ እኔም የመረጥኋቸው ይወርሱአታል፥ ባሪያዎቼም በዚያ ይኖራሉ።\n" +
                "10 ፤ ሳሮንም የበጎች ማሰማርያ፥ የአኮርም ሸለቆ የላሞች መመሰግያ ለፈልጉኝ ሕዝቤ ይሆናል።\n" +
                "11 ፤ እናንተን ግን እግዚአብሔርን የተዋችሁትን፥ ቅዱሱንም ተራራዬን የረሳችሁትን፥ ጉድ ለተባለ ጣዖትም ማዕድ ያዘጋጃችሁትን፥ እድል ለተባለ ጣዖትም የወይን ጠጅ ለመጠጥ ቍርባን የቀዳችሁትን፥\n" +
                "12 ፤ እድላችሁን ለሰይፍ አደርገዋለሁ፥ ሁላችሁም ለመታረድ ትጐነበሳላችሁ፤ በፊቴም ክፉ ነገርን አደረጋችሁ፥ ያልወደድሁትንም መረጣችሁ እንጂ በጠራሁ ጊዜ አልመለሳችሁልኝምና፥ በተናገርሁም ጊዜ አልሰማችሁኝምና።\n" +
                "13 ፤ ስለዚህ ጌታ እግዚአብሔር እንዲህ ይላል። እነሆ፥ ባሪያዎቼ ይበላሉ እናንተ ግን ትራባላችሁ፤ እነሆ፥ ባሪያዎቼ ይጠጣሉ እናንተ ግን ትጠማላችሁ፤ እነሆ፥ ባሪያዎቼ ደስ ይላቸዋል እናንተ ግን ታፍራላችሁ፤\n" +
                "14 ፤ እነሆ፥ ባሪያዎቼ ከልባቸው ደስታ የተነሣ ይዘምራሉ፥ እናንተ ግን ከልባችሁ ኀዘን የተነሣ ትጮኻላችሁ፥ መንፈሳችሁም ስለ ተሰበረ ወዮ ትላላችሁ።\n" +
                "15 ፤ ስማችሁንም ለተመረጡት ሕዝቤ እርግማን አድርጋችሁ ትተዋላችሁ፥ ጌታ እግዚአብሔርም ይገድላችኋል፥ ባሪያዎቹንም በሌላ ስም ይጠራቸዋል።\n" +
                "16 ፤ እንዲሁም በምድር ላይ የተባረከ በእውነት አምላክ ይባረካል፥ በምድርም ላይ የማለ በእውነት አምላክ ይምላል፤ የቀድሞው ጭንቀት ተረስቶአልና፥ ከዓይኔም ተሰውሮአልና።\n" +
                "17 ፤ እነሆ፥ አዲስ ሰማይና አዲስ ምድር እፈጥራለሁና፤ የቀደሙትም አይታሰቡም፥ ወደ ልብም አይገቡም።\n" +
                "18 ፤ ነገር ግን በፈጠርሁት ደስ ይበላችሁ ለዘላለምም ሐሤት አድርጉ፤ እነሆ፥ ኢየሩሳሌምን ለሐሤት፥ ሕዝብዋንም ለደስታ እፈጥራለሁና።\n" +
                "19 ፤ እኔም በኢየሩሳሌም ሐሤት አደርጋለሁ በሕዝቤም ደስ ይለኛል፤ ከዚያም ወዲያ የልቅሶ ድምፅና የዋይታ ድምፅ አይሰማባትም።\n" +
                "20 ፤ ከዚያም ወዲያ ጥቂት ዘመን ብቻ የሚኖር ሕፃን፥ ወይም ዕድሜውን ያልፈጸመ ሽማግሌ አይገኝም፤ ጕልማሳው የመቶ ዓመት ሆኖት ይሞታልና፥ ኃጢአተኛውም የመቶ ዓመት ሆኖት የተረገመ ይሆናልና።\n" +
                "21 ፤ ቤቶችንም ይሠራሉ ይቀመጡባቸውማል፤ ወይኑንም ይተክላሉ ፍሬውንም ይበላሉ።\n" +
                "22 ፤ ሌላ እንዲቀመጥበት አይሠሩም፥ ሌላም እንዲበላው አይተከሉም፤ የሕዝቤ ዕድሜ እንደ ዛፍ ዕድሜ ይሆናልና፥ እኔም የመረጥኋቸው በእጃቸው ሥራ ረጅም ዘመን ደስ ይላቸዋልና።\n" +
                "23 ፤ እነርሱ ከነልጆቻቸው የእግዚአብሔር ቡሩካን ዘር ናቸውና በከንቱ አይደክሙም ለጥፋትም አይወልዱም።\n" +
                "24 ፤ እንዲህም ይሆናል፤ ሳይጠሩ አመልስላቸዋለሁ፥ ገናም ሲናገሩ እሰማለሁ።\n" +
                "25 ፤ ተኵላና ጠቦት በአንድነት ይሰማራሉ፥ አንበሳም እንደ በሬ ገለባ ይበላል፥ የእባብም መብል ትቢያ ይሆናል። በተቀደሰው ተራራዬ ሁሉ አይጐዱም፥ አያጠፉምም፥ ይላል እግዚአብሔር።\n"));

        return new Chapter(65, verses);
    }

    private Chapter chaptersixtySix() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እግዚአብሔር እንዲህ ይላል። ሰማይ ዙፋኔ ነው፥ ምድርም የእግሬ መረገጫ ናት፤ የምትሠሩልኝ ቤት ምን ዓይነት ነው? የማርፍበትስ ስፍራ ምንድር ነው?\n" +
                "2 ፤ እነዚህን ሁሉ እጄ ሠርታለችና እነዚህ ሁሉ የእኔ ናቸው ይላል እግዚአብሔር፤ ነገር ግን ወደዚህ ወደ ትሑት፥ መንፈሱም ወደ ተሰበረ፥ በቃሌም ወደሚንቀጠቀጥ ሰው እመለከታለሁ።\n" +
                "3 ፤ በሬን የሚያርድልኝ ሰውን እንደሚገድል ነው፤ ጠቦትንም የሚሠዋ የውሻውን አንገት እንደሚሰብር ነው፤ የእህልን ቍርባን የሚያቀርብ የእርያን ደም እንደሚያቀርብ ነው፤ ዕጣንን የሚያጥን ጣዖትን እንደሚባርክ ነው። እነዚህ የገዛ መንገዳቸውን መረጡ፤ ነፍሳቸውም በርኵሰታቸው ደስ ይላታል፤\n" +
                "4 ፤ እኔ ደግሞ የተሳለቀባቸውን እመርጣለሁ፥ የፈሩትንም ነገር አመጣባቸዋለሁ፤ በፊቴ ክፉ ነገርን አደረጉ፥ ያልወደድሁትንም መረጡ እንጂ በጠራሁ ጊዜ አልመለሱልኝምና፥ በተናገርሁም ጊዜ አልሰሙኝምና።\n" +
                "5 ፤ በቃሉ የምትንቀጠቀጡ ሆይ፥ የእግዚአብሔርን ቃል ስሙ። የጠሉአችሁ ስለ ስሜም ያባረሩአችሁ ወንድሞቻችሁ። ደስታችሁን እናይ ዘንድ እግዚአብሔር ይክበር ብለዋል፤ ነገር ግን ያፍራሉ።\n" +
                "6 ፤ የጩኸት ድምፅ ከከተማ፥ ድምፅም ከመቅደስ፥ በጠላቶቹ ላይ ፍዳን የሚያመጣ የእግዚአብሔር ድምፅ ተሰምቶአል።\n" +
                "7 ፤ ሳታምጥ ወለደች፤ ምጥም ሳያገኛት ወንድ ልጅን ወለደች።\n" +
                "8 ፤ ከቶ እንዲህ ያለ ነገር ማን ሰምቶአል? እንዲህስ ያለ ነገር ማን አይቶአል? በውኑ አገር በአንድ ቀን ታምጣለችን? ወይስ በአንድ ጊዜ ሕዝብ ይወለዳልን? ጽዮን እንዳማጠች ወዲያው ልጆችዋን ወልዳለችና።\n" +
                "9 ፤ በውኑ ወደ መውለድ የማደርስ እኔ አላስወልድምን? ይላል እግዚአብሔር፤ የማስወልድስ ማኅፀንን እኔ እዘጋለሁን? ይላል አምላክሽ።\n" +
                "10 ፤ እናንተ የምትወድዱአት ሁሉ፥ ከኢየሩሳሌም ጋር ሐሤትን አድርጉ፥ ስለ እርስዋም ደስ ይበላችሁ፤ እናንተም የምታለቅሱላት ሁሉ፥ ከእርስዋ ጋር በደስታ ሐሤትን አድርጉ፥\n" +
                "11 ፤ ትጠቡ ዘንድ ከማጽናናትዋም ጡት ትጠግቡ ዘንድ፤ እጅግ ጠጥታችሁ በክብርዋ ሙላት ደስ ይላችሁ ዘንድ።\n" +
                "12 ፤ እግዚአብሔር እንዲህ ይላልና። እነሆ፥ ሰላምን እንደ ወንዝ፥ የአሕዛብንም ክብር እንደሚጐርፍ ፈሳሽ እመልስላታለሁ፤ ከዚያም ትጠባላችሁ፥ በጫንቃ ላይ ይሸከሙአችኋል በጕልበትም ላይ እያስቀመጡ ያቀማጥሉአችኋል።\n" +
                "13 ፤ እናት ልጅዋን እንደምታጽናና እንዲሁ አጽናናችኋለሁ፥ በኢየሩሳሌምም ውስጥ ትጽናናላችሁ።\n" +
                "14 ፤ ታያላችሁ፥ ልባችሁም ሐሤት ታደርጋለች፥ አጥንታችሁም እንደ ለምለም ሣር ትበቅላለች፤ የእግዚአብሔርም እጅ ለሚፈሩት ትታወቃለች፥ በጠላቶቹም ላይ ይቈጣል።\n" +
                "15 ፤ እነሆ፥ እግዚአብሔር መዓቱን በቍጣ፥ ዘለፋውንም በእሳት ነበልባል ይመልስ ዘንድ ከእሳት ጋር ይመጣል፥ ሰረገሎቹም እንደ ዐውሎ ነፋስ ይሆናሉ።\n" +
                "16 ፤ እግዚአብሔርም በሥጋ ለባሽ ሁሉ ላይ በእሳትና በሰይፉ ይፈርዳል፤ በእግዚአብሔርም ተወግተው የሞቱት ይበዛሉ።\n" +
                "17 ፤ በመካከላቸው ያለውን አንዱን ተከትለው ወደ ገነቱ ይገቡ ዘንድ ሰውነታቸውን የሚቀድሱና የሚያነጹ፥ የእሪያንም ሥጋ አስጸያፊ ነገርንም አይጥንም የሚበሉ በአንድነት ይጠፋሉ፥ ይላል እግዚአብሔር።\n" +
                "18 ፤ ሥራቸውንና አሳባቸውን አውቄአለሁና፤ አሕዛብንና ልሳናትን ሁሉ የምሰበስብበት ጊዜ ይደርሳል፥ እነርሱም ይመጣሉ ክብሬንም ያያሉ።\n" +
                "19 ፤ በመካከላቸውም ምልክት አደርጋለሁ፥ ከእነርሱም የዳኑትን ዝናዬን ወዳልሰሙ፥ ክብሬንም ወዳላዩ ወደ አሕዛብ ወደ ተርሴስ ወደ ፉጥ ወደ ሉድ ወደ ሞሳሕ ወደ ቶቤል ወደ ያዋን በሩቅ ወዳሉ ደሴቶች እልካቸዋለሁ፥ በአሕዛብም መካከል ክብሬንም ይናገራሉ።\n" +
                "20 ፤ የእስራኤል ልጆች ቍርባናቸውን በጥሩ ዕቃ አድርገው ወደ እግዚአብሔር ቤት እንደሚያመጡ፥ እንዲሁ ለእግዚአብሔር ቍርባን ይሆን ዘንድ ወንድሞቻችሁን ሁሉ፥ በፈረሶችና በሰረገሎች፥ በአልጋዎችና በበቅሎች በጠያር ግመሎችም ላይ አድርገው፥ ከአሕዛብ ሁሉ ወደ ተቀደሰው ተራራዬ ወደ ኢየሩሳሌም ያመጡአቸዋል፥ ይላል እግዚአብሔር።\n" +
                "21 ፤ ካህናትና ሌዋውያን እንዲሆኑ ከእነርሱ እወስዳለሁ፥ ይላል እግዚአብሔር።\n" +
                "22 ፤ እኔ የምሠራቸው አዲስ ሰማይና አዲስ ምድር ከፊቴ ጸንተው እንደሚኖሩ፥ እንዲሁ ዘራችሁና ስማችሁ ጸንተው ይኖራሉ፥ ይላል እግዚአብሔር።\n" +
                "23 ፤ እንዲህ ይሆናል፤ በየመባቻውና በየሰንበቱ ሥጋ ለባሽ ሁሉ በፊቴ ይሰግድ ዘንድ ዘወትር ይመጣል፥ ይላል እግዚአብሔር።\n" +
                "24 ፤ ወጥተውም በእኔ ያመፁብኝን ሰዎች ሬሳቸውን ያያሉ፤ ትላቸው አይሞትምና፥ እሳታቸውም አይጠፋምና፤ ለሥጋ ለባሽም ሁሉ አስጸያፊ ነገር ይሆናሉ።\n" ));

        return new Chapter(66, verses);
    }
}
