package com.example.bibleapp.books.added;

import com.example.bibleapp.models.Book;
import com.example.bibleapp.models.Chapter;
import com.example.bibleapp.models.Verse;

import java.util.ArrayList;
import java.util.List;

public class NAHOM {
    private Book NAHOMBook;

    public NAHOM() {
        List<Chapter> chapters = new ArrayList<>();
        chapters.add(chapterOne());
        chapters.add(chapterTwo());
        chapters.add(chapterThree());
 
        NAHOMBook = new Book("ትንቢተ ናሆም", chapters);
    }

    public Book getNAHOMBook() {
        return NAHOMBook;
    }

    private Chapter chapterOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","ስለ ነነዌ የተነገረ ሸክም፤ የኤልቆሻዊው የናሆም የራእዩ መጽሐፍ ይህ ነው።  \n" +   
                "2 ፤ እግዚአብሔር ቀናተኛና ተበቃይ አምላክ ነው፤ እግዚአብሔር ተበቃይና መዓትን የተሞላ ነው፤ እግዚአብሔር ተቃዋሚዎቹን ይበቀላል፥ ለጠላቶቹም ቍጣውን ይጠብቃል።  \n" +   
                "3 ፤ እግዚአብሔር ትዕግሥተኛ፥ ኃይሉም ታላቅ ነው፥ በደለኛውንም። ንጹሕ ነህ አይልም፤ እግዚአብሔር በወጀብና በዐውሎ ነፋስ ውስጥ መንገድ አለው፥ ደመናም የእግሩ ትቢያ ነው።  \n" +   
                "4 ፤ ባሕሩንም ይገሥጻታል፥ ያደርቃትማል፥ ወንዞችንም ሁሉ ያደርቃል፤ ባሳንና ቀርሜሎስም ላልተዋል፥ የሊባኖስም አበባ ጠውልጎአል።  \n" +   
                "5 ፤ ተራሮችም ከእርሱ የተነሣ ታወኩ፥ ኮረብቶችም ቀለጡ፤ ምድርና ዓለም የሚኖሩበትም ሁሉ ከፊቱ ተናወጡ።  \n" +   
                "6 ፤ በቍጣው ፊት የሚቆም ማን ነው? የቍጣውንም ትኵሳት ማን ይታገሣል? መዓቱ እንደ እሳት ይፈስሳል፥ ከእርሱም የተነሣ ዓለቶች ተሰነጠቁ።  \n" +   
                "7 ፤ እግዚአብሔር መልካም ነው፥ በመከራ ቀንም መሸሸጊያ ነው፤ በእርሱ የሚታመኑትንም ያውቃል።  \n" +   
                "8 ፤ ስፍራዋን ግን በሚያጥለቀልቅ ጎርፍ ፈጽሞ ያጠፋታል፥ ጠላቶቹንም ወደ ጨለማ ያሳድዳቸዋል።  \n" +   
                "9 ፤ በእግዚአብሔር ላይ የምታስቡት ምንድር ነው? እርሱ ፈጽሞ ያጠፋል፥ መከራም ሁለተኛ አይነሣም።  \n" +   
                "10 ፤ እርስ በእርሳቸው እንደ ተመሰቃቅለ እሾህ ቢሆኑ፥ በመጠጣቸውም ቢሰክሩ እንደ ደረቅ ገለባ ፈጽመው ይጠፋሉ።  \n" +   
                "11 ፤ በእግዚአብሔር ላይ በክፉ የሚያስብ፥ ክፋትን የሚመክር፥ ከአንተ ዘንድ ወጥቶአል።  \n" +   
                "12 ፤ እግዚአብሔር እንዲህ ይላል። ኃይለኞችና ብዙዎች ቢሆኑ እንዲሁ ይቈረጣሉ፥ እርሱም ያልቃል። እኔም አስጨንቄሃለሁ፥ ነገር ግን ከእንግዲህ ወዲህ አላስጨንቅህም።  \n" +   
                "13 ፤ አሁንም ቀንበሩን ከአንተ እሰብራለሁ፥ እስራትህንም እበጥሳለሁ።  \n" +   
                "14 ፤ እግዚአብሔርም ከስምህ ማንም ከእንግዲህ ወዲህ እንዳይዘራ ስለ አንተ አዝዞአል፤ ከአምላኮችህ ቤት የተቀረጸውንና ቀልጦ የተሠራውን ምስል አጠፋለሁ፤ አንተም የተጠቃህ ነህና መቃብርህን እምሳለሁ።  \n" +   
                "15 ፤ እነሆ፥ የምስራችን የሚያመጣ ሰላምንም የሚያወራ ሰው እግር በተራሮች ላይ ነው! ይሁዳ ሆይ፥ አጥፊው ፈጽሞ ጠፍቶአልና፥ ከእንግዲህም ወዲህ በአንተ ዘንድ አያልፍምና ዓመት በዓሎችህን አድርግ፥ ስእለቶችህን ክፈል።"));

        return new Chapter(1, verses);
    }

    private Chapter chapterTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "የሚቀጠቅጥ በአንተ ላይ ወጥቶአል፤ ምሽግን ጠብቅ፥ መንገድንም ሰልል፤ ወገብህን አጽና፥ ኃይልህንም እጅግ አበርታ።  \n" +   
                "2 ፤ ዘራፊዎች ዘርፈዋቸዋልና፥ የወይናቸውንም አረግ አጥፍተዋልና እግዚአብሔር የያዕቆብን ክብር እንደ እስራኤል ክብር ይመልሳል።  \n" +   
                "3 ፤ የኃያላኑ ጋሻ ቀልቶአል፥ ጽኑዓንም ቀይ ልብስ ለብሰዋል። እርሱም በሚያዘጋጅበት ቀን ሰረገሎች እንደ እሳት ይንቦገቦጋሉ፤ የጦሩም ሶመያ ይወዛወዛል።  \n" +   
                "4 ፤ ሰረገሎች በመንገድ ላይ ይነጕዳሉ፥ አደባባይም ይጋጫሉ፤ መልካቸው እንደ ፋና ነው፥ እንደ መብረቅም ይከንፋሉ።  \n" +   
                "5 ፤ መሳፍንቱን ያስባል፤ በአረማመዳቸው ይሰናከላሉ፤ ፈጥነው በቅጥርዋ ላይ ይወጣሉ፥ መጠጊያም ተዘጋጀለት።  \n" +   
                "6 ፤ የወንዞቹም መዝጊያዎች ተከፈቱ፥ የንጉሡ ቤትም ቀለጠች።  \n" +   
                "7 ፤ ንግሥት ተገለጠች፥ ተማረከችም፥ ሴቶች ባሪያዎችዋም እንደ ርግብ እየጮኹና ደረታቸውን እየመቱ ዋይ ዋይ ይላሉ።  \n" +   
                "8 ፤ ነነዌ ግን ከዱሮ ዘመን ጀምራ እንደ ተከማቸ ውኃ ነበረች፤ አሁን ግን ይሸሻሉ፤ እነርሱም። ቁሙ፥ ቁሙ ይላሉ፥ ነገር ግን የሚመለስ የለም።  \n" +   
                "9 ፤ መዝገብዋ መጨረሻ የለውምና፥ የከበረውም የዕቃዋ ሁሉ ብዛት አይቈጠርምና ብሩን በዝብዙ፥ ወርቁንም በዝብዙ።  \n" +   
                "10 ፤ ባዶና ባድማ ምድረ በዳም ሆናለች፤ ልብ ቀልጦአል፥ ጕልበቶችም ተብረክርከዋል፤ በወገብም ሁሉ ሕማም አለ፥ የሰዎችም ሁሉ ፊት ጠቍሮአል።  \n" +   
                "11 ፤ የአንበሾችም መደብ፥ የአንበሾችም ደቦል የሚሰማራበት፥ አንበሳውና አንበሳይቱ ግልገሉም ሳይፈሩ የሚሄዱት ስፍራ ወዴት ነው?  \n" +   
                "12 ፤ አንበሳው ለልጆቹ የሚበቃውን ነጠቀ፥ ለእንስቶቹም ሰበረላቸው ዋሻውን በንጥቂያ፥ መደቡንም በቅሚያ ሞልቶታል።  \n" +   
                "13 ፤ እነሆ በአንቺ ላይ ነኝ፥ ይላል የሠራዊት ጌታ እግዚአብሔር፤ ሰረገሎችዋንም አቃጥዬ አጤሳለሁ፥ ሰይፍም የአንበሳ ደቦሎችሽን ይበላቸዋል፤ ንጥቂያሽንም ከምድር አጠፋለሁ፥ የመልክተኞችሽን ድምፅ ከእንግዲህ ወዲህ አይሰማም።"));
        return new Chapter(2, verses);
    }

    private Chapter chapterThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ለደም ከተማ ወዮላት! በሁለንተናዋ ሐሰትና ቅሚያ ሞልቶባታል፤ ንጥቂያ ከእርስዋ አያልቅም።  \n" +   
                "2 ፤ የአለንጋ ድምፅ፥ የመንኰራኵርም ድምፅ፥ የፈረሶችም ኮቴ፥ የፈጣን ሰረገላም ጩኸት ተሰምቶአል፤  \n" +   
                "3 ፤ ፈረሰኛው ይጋልባል፥ ሰይፍም ይንቦገቦጋል፥ ጦርም ይብለጨለጫል፤ የተገደሉትም ይበዛሉ፥ በድኖችም በክምር ይከመራሉ፥ ሬሳቸውም አይቈጠርም፤ በሬሳቸውም ይሰናከላሉ።  \n" +   
                "4 ፤ ስለ ተዋበችው ጋለሞታ ግልሙትና ብዛት ይህ ሆኖአል፤ እርስዋም በመተትዋ እጅግ በለጠች፥ አሕዛብንም በግልሙትናዋ፥ ወገኖችንም በመተትዋ ሸጠች።  \n" +   
                "5 ፤ እነሆ፥ በአንቺ ላይ ነኝ፥ ይላል የሠራዊት ጌታ እግዚአብሔር፥ ልብስሽን በፊትሽ እገልጣለሁ፤ ኅፍረተ ሥጋሽንም ለአሕዛብ፥ ነውርሽንም ለመንግሥታት አሳያለሁ።  \n" +   
                "6 ፤ ርኵሰትንም በላይሽ እጥላለሁ፥ እንቅሻማለሁ፥ ማላገጫም አደርግሻለሁ።  \n" +   
                "7 ፤ የሚያይሽም ሁሉ ከአንቺ ሸሽቶ። ነነዌ ባድማ ሆናለች፤ የሚያለቅስላትስ ማን ነው? የሚያጽናናትንስ ከወዴት እፈልጋለሁ? ይላል።  \n" +   
                "8 ፤ አንቺ በመስኖች መካከል ከተቀመጠችው፥ ውኃም በዙሪያዋ ከነበራት፥ ምሽግዋም ባሕር ከነበረ፥ ቅጥርዋም በባሕር ውስጥ ከነበረ ከኖእ አሞን ትበልጫለሽን?  \n" +   
                "9 ፤ ኢትዮጵያና ግብጽ የማይቈጠር ኃይልዋ ነበሩ፤ ፉጥና ልብያ ረዳቶችዋ ነበሩ።  \n" +   
                "10 ፤ እርስዋ ግን ተማርካ ፈለሰች፤ ሕፃናቶችዋ በመንገድ ሁሉ ራስ ላይ ተፈጠፈጡ፤ በከበርቴዎችዋም ላይ ዕጣ ተጣጣሉ፥ ታላላቆችዋም ሁሉ በሰንሰለት ታሰሩ።  \n" +   
                "11 ፤ አንቺም ትሰክሪአለሽ ወራዳም ትሆኛለሽ፤ አንቺ ደግሞ ከጠላት የተነሣ መጠጊያን ትፈልጊአለሽ።  \n" +   
                "12 ፤ አምባሽ ሁሉ የመጀመሪያውን የበሰለ ፍሬ እንደ ያዙ እንደ በለስ ዛፎች ነው፤ ቢወዛወዝ በሚበላው አፍ ውስጥ ይወድቃል።  \n" +   
                "13 ፤ እነሆ፥ በመካከልሽ ያሉ ሕዝብሽ ሴቶች ናቸው፤ የአገርሽ በሮች ለጠላቶችሽ ፈጽሞ ተከፍተዋል፥ እሳትም መወርወሪያዎችህን በልቶአል።  \n" +   
                "14 ፤ ከብበው ያስጨንቁሻልና ውኃን ቅጂ፤ አምባሽን አጠንክሪ፤ ወደ ጭቃ ገብተሽ እርገጪ፤ የጡብን መሠሪያ ያዢ።  \n" +   
                "15 ፤ በዚያ እሳት ይበላሻል፥ ሰይፍ ያጠፋሻል፥ እንደ ደጎብያ ይበላሻል፤ እንደ ደጎብያ ብዢ፥ እንደ አንበጣም ተባዢ።  \n" +   
                "16 ፤ ነጋዴዎችሽን ከሰማይ ከዋክብት ይልቅ አበዛሽ፤ ደጎብያ ተዘረጋ፥ በረረም።  \n" +   
                "17 ፤ በአንቺ ዘንድ ዘውድ የጫኑት እንደ አንበጣ፥ አለቆችሽም እንደሚንቀሳቀሱ ኩብኩባዎች ናቸው፤ በብርድ ቀን በቅጥር ውስጥ ይቀመጣሉ፥ ፀሐይም በወጣች ጊዜ ያኰበኵባሉ፤ ስፍራቸው በየት እንደ ሆነ አይታወቅም።  \n" +   
                "18 ፤ የአሦር ንጉሥ ሆይ፥ እረኞችህ አንቀላፍተዋል፤ መኳንንቶችህም ዐርፈዋል፤ ሕዝብህም በተራሮች ላይ ተበትኖአል፥ የሚሰበስበውም የለም።  \n" +   
                "19 ፤ ስብራትህ አይፈወስም፥ ቍስልህም ክፉ ነው፤ ወሬህንም የሚሰሙ ሁሉ እጃቸውን በአንተ ላይ ያጨበጭባሉ፤ ክፋትህ ሁልጊዜ ያላለፈችበት ሰው ማን ነውና?"));

        return new Chapter(3, verses);
    }


       
}