package com.example.bibleapp.books.added;

import com.example.bibleapp.models.Book;
import com.example.bibleapp.models.Chapter;
import com.example.bibleapp.models.Verse;

import java.util.ArrayList;
import java.util.List;

public class OBADIAH {
    private Book OBADIAHBook;

    public OBADIAH() {
        List<Chapter> chapters = new ArrayList<>();
        chapters.add(chapterOne());

 
        OBADIAHBook = new Book("ትንቢተ አብድዩ", chapters);
    }

    public Book getOBADIAHBook() {
        return OBADIAHBook;
    }

    private Chapter chapterOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","የአብድዩ ራእይ። ጌታ እግዚአብሔር ስለ ኤዶምያስ እንዲህ ይላል። ከእግዚአብሔር ዘንድ ወሬ ሰምተናል፤ መልእክተኛ ወደ አሕዛብ ተልኮ። ተነሡ፥ በላይዋም በሰልፍ እንነሣ ብሎአል።  \n" +   
                "2 ፤ እነሆ፥ በአሕዛብ ዘንድ ታናሽ አድርጌሃለሁ፤ አንተ እጅግ ተንቀሃል።  \n" +   
                "3 ፤ በተሰነጠቀ ዓለት ውስጥ የምትኖር፥ ማደሪያህንም ከፍ ከፍ ያደረግህ፥ በልብህም። ወደ ምድር የሚያወርደኝ ማን ነው? የምትል አንተ ሆይ፥ የልብህ ትዕቢት አታልሎሃል።  \n" +   
                "4 ፤ እንደ ንስር መጥቀህ ብትወጣ፥ ቤትህም በከዋክብት መካከል ቢሆን፥ ከዚያ አወርድሃለሁ፥ ይላል እግዚአብሔር።  \n" +   
                "5 ፤ ሌቦች ቢመጡብህ ወይም ወንበዴዎች በሌሊት ቢመጡ፥ የሚበቃቸውን የሚሰርቁ አይደሉምን? ወይንንም የሚቈርጡ ወደ አንተ ቢመጡ ቃርሚያ አያስቀሩምን?  \n" +   
                "6 ፤ አንተ ግን ምንኛ ጠፋህ! ዔሳው ምንኛ ተመረመረ! የተሸሸገበት ነገር ምንኛ ተፈለገ!  \n" +   
                "7 ፤ የተማማልሃቸው ሰዎች ሁሉ ወደ ዳርቻህ ሰደዱህ፤ የታመንሃቸው ሰዎች አታለሉህ፥ አሸነፉህም፤ በበታችህም አሽክላ ዘረጉብህ፥ እነርሱም ማስተዋል የላቸውም።  \n" +   
                "8 ፤ በዚያ ቀን ከኤዶምያስ ጥበበኞችን፥ ከዔሳውም ተራራ ማስተዋልን አላጠፋምን? ይላል እግዚአብሔር።  \n" +   
                "9 ፤ ቴማን ሆይ፥ ሰዎች ሁሉ ከዔሳው ተራራ በመገደል ይጠፉ ዘንድ ኃያላንህ ይደነግጣሉ።  \n" +   
                "10 ፤ በወንድምህ በያዕቆብ ላይ ስለ ተደረገ ግፍ እፍረት ይከድንሃል፥ ለዘላለምም ትጠፋለህ።  \n" +   
                "11 ፤ በፊቱ አንጻር በቆምህ ቀን፥ አሕዛብ ጭፍራውን በማረኩበት፥ እንግዶችም በበሩ በገቡበት፥ በኢየሩሳሌምም ዕጣ በተጣጣሉበት ቀን አንተ ደግሞ ከእነርሱ እንደ አንዱ ነበርህ።  \n" +   
                "12 ፤ ነገር ግን በመከራው ቀን ወንድምህን ትመለከት ዘንድ፥ በጥፋታቸውም ቀን በይሁዳ ልጆች ላይ ደስ ይልህ ዘንድ፥ በጭንቀትም ቀን በትዕቢት ትናገር ዘንድ አይገባህም ነበር።  \n" +   
                "13 ፤ በጥፋታቸውም ቀን በሕዝቤ በር ትገባ ዘንድ፥ በጥፋታቸውም ቀን መከራቸውን ትመለከት ዘንድ፥ በጥፋታቸውም ቀን በሀብታቸው ላይ እጅህን ትዘረጋ ዘንድ አይገባህም ነበር።  \n" +   
                "14 ፤ የሸሹትንም ለመግደል በመንታ መንገድ ላይ ትቆም ዘንድ፥ በጭንቀትም ቀን ከእርሱ የቀሩትን አሳልፈህ ትሰጥ ዘንድ አይገባህም ነበር።  \n" +   
                "15 ፤ የእግዚአብሔር ቀን በአሕዛብ ሁሉ ላይ ቀርቦአልና፤ አንተ እንዳደረግኸው እንዲሁ ይደረግብሃል፥ ፍዳህም በራስህ ላይ ይመለሳል።  \n" +   
                "16 ፤ በቅዱስ ተራራዬ ላይ እንደ ጠጣችሁ እንዲሁ አሕዛብ ሁሉ ዘወትር ይጠጣሉ፤ አዎን ይጠጣሉ፥ ይጨልጡማል፥ እንዳልሆኑም ይሆናሉ።  \n" +   
                "17 ፤ ነገር ግን በጽዮን ተራራ ላይ የሚያመልጡ ይሆናሉ፥ እርሱም ቅዱስ ይሆናል፤ የያዕቆብም ቤት ሰዎች ርስታቸውን ይወርሳሉ።  \n" +   
                "18 ፤ እግዚአብሔርም ተናግሮአልና የያዕቆብ ቤት እሳት፥ የዮሴፍ ቤት ነበልባልም፥ የዔሳው ቤት ገለባ ይሆናሉ፤ እነርሱንም ያቃጥሉአቸዋል ይበሉአቸውማል፤ ከዔሳውም ቤት ቅሬታ የለውም።  \n" +   
                "19 ፤ የደቡብም ሰዎች የዔሳውን ተራራ፥ የቈላውም ሰዎች ፍልስጥዔማውያንን ይወርሳሉ፤ የኤፍሬምንም አገር የሰማርያንም አገር ይወርሳሉ፤ ብንያምም ገለዓድን ይወርሳል።  \n" +   
                "20 ፤ ይህም የእስራኤል ልጆች የጭፍራቸው ምርኮ የከነዓንን ስፍራ ሁሉ እስከ ሰራጵታ ድረስ ይወርሳል፤ በስፋራድም የሚኖሩ የኢየሩሳሌም ምርኮኞች የደቡብን ከተሞች ይወርሳሉ።  \n" +   
                "21 ፤ በዔሳውም ተራራ ላይ ይፈርዱ ዘንድ አዳኞች ወደ ጽዮን ተራራ ላይ ይወጣሉ፤ መንግሥቱም ለእግዚአብሔር ይሆናል።"));

        return new Chapter(1, verses);
    }
}
