package com.example.bibleapp.books.added;

import com.example.bibleapp.models.Book;
import com.example.bibleapp.models.Chapter;
import com.example.bibleapp.models.Verse;

import java.util.ArrayList;
import java.util.List;

public class TheBookofNehemiah {
    private Book TheBookofNehemiahBook;

    public TheBookofNehemiah() {
        List<Chapter> chapters = new ArrayList<>();
        chapters.add(chapterOne());
        chapters.add(chapterTwo());
        chapters.add(chapterThree());
        chapters.add(chapterFour());
        chapters.add(chapterFive());
        chapters.add(chapterSix());
        chapters.add(chapterSeven());
        chapters.add(chapterEight());
        chapters.add(chapterNine());
        chapters.add(chapterTen());
        chapters.add(chapterEleven());
        chapters.add(chapterTwelve());
        chapters.add(chapterThirteen());




        TheBookofNehemiahBook = new Book("መጽሐፈ ነህምያ።", chapters);
    }

    public Book getTheBookofNehemiahBook() {
        return TheBookofNehemiahBook;
    }

    private Chapter chapterOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ የሐካልያ ልጅ የነህምያ ቃል። በሀያኛው ዓመት በካሴሉ ወር እንዲህ ሆነ፤\n" +
                "2 ፤ እኔ በሱሳ ግንብ ሳለሁ፥ ከወንድሞቼ አንዱ አናኒ ከእርሱም ጋር ሌሎች ሰዎች ከይሁዳ መጡ፤ እኔም የዳኑትን ከምርኮ የተረፉትን የአይሁድን ነገር የኢየሩሳሌምንም ነገር ጠየቅኋቸው።\n" +
                "3 ፤ እነርሱም። በዚያ ስፍራ ያሉት ከምርኮ የተረፉት ቅሬታዎች በታላቅ መከራና ስድብ አሉ፤ የኢየሩሳሌምም ቅጥር ፈርሶአል፥ በሮችዋም በእሳት ተቃጥለዋል አሉኝ።\n" +
                "4 ፤ ይህንም ቃል በሰማሁ ጊዜ ተቀምጬ አለቀስሁ፥ አያሌ ቀንም አዝን ነበር፤ በሰማይም አምላክ ፊት እጾምና እጸልይ ነበር፥\n" +
                "5 ፤ እንዲህም አልሁ። አቤቱ የሰማይ አምላክ ሆይ፥ ለሚወድዱህና ትእዛዝህን ለሚያደርጉ ቃል ኪዳንንና ምሕረትን የምትጠብቅ፥ ታላቅና የተፈራህ አምላክ ሆይ፥\n" +
                "6 ፤ እኔ ባሪያህ ዛሬ በፊትህ ስለ ባሪያዎችህ ስለ እስራኤል ልጆች ሌሊትና ቀን የምጸልየውን ጸሎት ትሰማ ዘንድ ጆሮህ ያድምጥ፥ ዓይኖችህም ይከፈቱ፤ በአንተ ላይም ያደረግነውን የእስራኤልን ልጆች ኃጢአት እናዘዝልሃለሁ፤ እኔና የአባቴም ቤት በድለናል።\n" +
                "7 ፤ እኛም በአንተ ላይ እጅግ ክፉ ሠርተናል፤ ለባሪያህም ለሙሴ ያዘዝኸውን ትእዛዝና ሥርዓት ሕግም አልጠበቅንም።\n" +
                "8 ፤\n" +
                "9 ፤ አሁንም ብትተላለፉ በአሕዛብ መካከል እበትናችኋለሁ፤ ወደ እኔ ብትመለሱ ግን ትእዛዜንም ብትጠብቁ ብታደርጓትም፥ ከእናንተ ሰዎች እስከ ሰማይ ዳርቻ ድረስ ምንም ቢበተኑ ከዚያ እሰበስባቸዋለሁ፥ ስሜም ይኖርበት ዘንድ ወደ መረጥሁት ስፍራ አመጣቸዋለሁ ብለህ ለባሪያህ ለሙሴ ያዘዝኸውን ቃል እባክህ አስብ።\n" +
                "10 ፤ እነዚህም በታላቅ ኃይልህና በብርቱ እጅህ የተቤዠሃቸው ባሪያዎችህና ሕዝብህ ናቸው።\n" +
                "11 ፤ ጌታ ሆይ፥ ጆሮህ የባሪያህን ጸሎት፥ ስምህንም ይፈሩ ዘንድ የሚወድዱትን፥ የባሪያዎችህን ጸሎት ያድምጥ፤ ዛሬም ለባሪያህ አከናውንለት፥ በዚህም ሰው ፊት ምሕረትን ስጠው። እኔም ለንጉሡ ጠጅ አሳላፊው ነበርሁ።\n"));
        // Add more verses as needed
        return new Chapter(1, verses);
    }

    private Chapter chapterTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በንጉሡ በአርጤክስስ በሀያኛው ዓመት በኒሳን ወር የወይን ጠጅ በፊቱ በነበረ ጊዜ ጠጁን አንሥቼ ለንጉሡ ሰጠሁት። ቀድሞ ግን በፊቱ ያለ ኃዘን እኖር ነበር።\n" +
                "2 ፤ ንጉሡም። ሳትታመም ፊትህ ለምን አዘነ? ይህ የልብ ኅዘን ነው እንጂ ሌላ ነገር አይደለም አለኝ። እጅግም ብዙ አድርጌ ፈራሁ።\n" +
                "3 ፤ ንጉሡንም። ንጉሡ ሺህ ዓመት ይንገሥ፤ የአባቶቼ መቃብር ያለባት ከተማ ተፈትታለችና፥ በሮችዋም በእሳት ተቃጥለዋልና ፊቴ ስለ ምን አይዘን? አልሁት።\n" +
                "4 ፤ ንጉሡም። ምን ትለምነኛለህ? አለኝ። እኔም ወደ ሰማይ አምላክ ጸለይሁ።\n" +
                "5 ፤ ንጉሡንም። ንጉሡን ደስ ቢያሰኝህ፥ ባሪያህም በፊትህ ሞገስ ቢያገኝ፥ እሠራው ዘንድ ወደ ይሁዳ ወደ አባቶቼ መቃብር ከተማ ስደደኝ አልሁት።\n" +
                "6 ፤ ንግሥቲቱም በአጠገቡ ተቀምጣ ሳለች ንጉሡ። መንገድህ እስከ መቼ ድረስ ይሆናል? መቼስ ትመለሳለህ? አለኝ። ንጉሡም ይሰድደኝ ዘንድ ደስ አለው፤ እኔም ዘመኑን ቀጠርሁለት።\n" +
                "7 ፤ ንጉሡንም። ንጉሡ ደስ ቢለው፥ እስከ ይሁዳ አገር እንዲያደርሱኝ በወንዝ ማዶ ላሉት ገዦች ደብዳቤ ይሰጠኝ፤\n" +
                "8 ፤ በቤቱም አጠገብ ላለው ለግንብ በሮች፥ ለከተማውም ቅጥር፥ ለምገባበትም ቤት እንጨት እንዲሰጠኝ ለንጉሡ ዱር ጠባቂ ለአሳፍ ደብዳቤ ይሰጠኝ አልሁት። ንጉሡም በእኔ ላይ መልካም እንደ ሆነችው እንደ አምላኬ እጅ ሰጠኝ።\n" +
                "9 ፤ በወንዙም ማዶ ወዳሉት አለቆች መጥቼ የንጉሡን ደብዳቤ ሰጠኋቸው ንጉሡም ከእኔ ጋር የሠራዊቱን አለቆችና ፈረሰኞች ሰደደ።\n" +
                "10 ፤ ሖሮናዊውም ሰንባላጥና ባሪያው አሞናዊ ጦብያ ለእስራኤል ልጆች መልካምን ነገር የሚሻ ሰው እንደ መጣ በሰሙ ጊዜ እጅግ ተበሳጩ።\n" +
                "11 ፤ ወደ ኢየሩሳሌምም ደረስሁ፥ በዚያም ሦስት ቀን ያህል ተቀመጥሁ።\n" +
                "12 ፤ በሌሊትም ተነሣሁ፥ ከእኔም ጋር አያሌ ሰዎች ነበሩ፤ እግዚአብሔርም ለኢየሩሳሌም አደርገው ዘንድ በልቤ ያኖረውን ለማንም አላስታወቅሁም፤ ተቀምጬበት ከነበረው እንስሳ በቀር ከእኔ ጋር ምንም እንስሳ አልነበረም።\n" +
                "13 ፤ በሸለቆውም በር ወጣሁ፥ ወደ ዘንዶውም ምንጭና ወደ ጕድፍ መጣያው በር ሄድሁ፤ የፈረሰውንም የኢየሩሳሌምን ቅጥር፥ በእሳትም የተቃጠሉትን በሮችዋን ተመለከትሁ።\n" +
                "14 ፤ ወደ ምንጩም በርና ወደ ንጉሡ መዋኛ አለፍሁ፤ ተቀምጬበትም የነበረው እንስሳ የሚያልፍበት ስፍራ አልነበረም።\n" +
                "15 ፤ በሌሊትም በፈፋው በኩል ወጥቼ ቅጥሩን ተመለከትሁ፤ ዘወርም ብዬ በሸለቆው በር ገባሁ፥ እንዲሁም ተመለስሁ።\n" +
                "16 ፤ ሹማምቱ ግን ወዴት እንደ ሄድሁ፥ ምን እንዳደረግሁም አላወቁም ነበር፤ ለአይሁድና ለካህናቱ፥ ለታላላቆችና ለሹማምቱም፥ ሥራም ይሠሩ ለነበሩት ለሌሎች ገና አልተናገርሁም ነበር።\n" +
                "17 ፤ እኔም። እኛ ያለንበትን ጕስቍልና ኢየሩሳሌም እንደ ፈረሰች፥ በሮችዋም በእሳት እንደ ተቃጠሉ ታያላችሁ፤ አሁንም ከእንግዲህ ወዲህ መሳለቂያ እንዳንሆን ኑና የኢየሩሳሌምን ቅጥር እንሥራ አልኋቸው።\n" +
                "18 ፤ የአምላኬም እጅ በእኔ ላይ መልካም እንደሆነች፥ ንጉሡም የነገረኝን ቃል ነገርኋቸው። እነርሱም። እንነሣና እንሥራ አሉ። እጃቸውንም ለበጎ ሥራ አበረቱ።\n" +
                "19 ፤ ሖሮናዊውም ሰንባላጥ፥ ባሪያውም አሞናዊው ጦብያ፥ ዓረባዊውም ጌሳም በሰሙ ጊዜ በንቀት ሳቁብን፥ ቀላል አድርገውንም። ይህ የምታደርጉት ነገር ምንድር ነው? በውኑ በንጉሡ ላይ ትሸፍቱ ዘንድ ትወድዳላችሁን? አሉ።\n" +
                "20 ፤ እኔም መልሼ። የሰማይ አምላክ ያከናውንልናል፥ እኛም ባሪያዎቹ ተነሥተን እንሠራለን፤ እናንተ ግን በኢየሩሳሌም እድል ፈንታና መብት መታሰቢያም የላችሁም አልኋቸው።\n" ));
        // Add more verses as needed
        return new Chapter(2, verses);
    }

    private Chapter chapterThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ ታላቁም ካህን ኤልያሴብ ወንድሞቹም ካህናት ተነሥተው የበግ በር ሠሩ፤ ቀደሱትም፥ ሳንቃዎቹንም አቆሙ፤ እስከ ሃሜአ ግንብና እስከ ሐናንኤል ግንብ ድረስ ቀደሱት።\n" +
                "2 ፤ በአጠገቡ የኢያሪኮ ሰዎች ሠሩ፤ በአጠገባቸውም የአምሪ ልጅ ዘኩር ሠራ።\n" +
                "3 ፤ የሃስናአ ልጆችም የዓሣ በር ሠሩ፤ ሰረገሎቹን አኖሩ፥ ሳንቃዎቹንም አቆሙ፥ ቍልፎቹንና መወርወሪያዎቹንም አደረጉ።\n" +
                "4 ፤ በአጠገባቸውም የአቆስ ልጅ የኦርዮ ልጅ ሜሪሞት አደሰ። በአጠገባቸውም የሜሴዜቤል ልጅ የበራክያ ልጅ ሜሱላም አደሰ። በአጠገባቸውም የበዓና ልጅ ሳዶቅ አደሰ።\n" +
                "5 ፤ በአጠገባቸውም ቴቁሐውያን አደሱ፤ ታላላቆቻቸው ግን ለጌታቸው ሥራ አንገታቸውን አላዋረዱም።\n" +
                "6 ፤ የፋሴሐ ልጅ ዮዳሄና የበሶድያ ልጅ ሜሱላም አሮጌውን በር አደሱ፤ ሰረገሎቹን አኖሩ፥ ሳንቃዎቹንም አቆሙ፥ ቍልፎቹንና መወርወሪያዎቹንም አደረጉ።\n" +
                "7 ፤ በአጠገባቸውም ገባዖናዊው መልጥያና ሜሮኖታዊው ያዶን፥ የወንዙም ማዶ አለቃ ግዛት የሆኑ የገባዖንና የምጽጳ ሰዎች አደሱ።\n" +
                "8 ፤ በአጠገባቸውም ወርቅ አንጥረኛው የሐርሃያ ልጅ ዑዝኤል አደሰ። በአጠገቡም ከሽቱ ቀማሚዎች የነበረ ሐናንያ አደሰ፤ እስከ ሰፊው ቅጥር ድረስ ኢየሩሳሌምን ጠገኑ።\n" +
                "9 ፤ በአጠገባቸውም የኢየሩሳሌም ግዛት እኵሌታ አለቃ የሆር ልጅ ረፋያ አደሰ።\n" +
                "10 ፤ በአጠገባቸውም የኤርማፍ ልጅ ይዳያ በቤቱ አንጻር ያለውን አደሰ። በአጠገቡም የአሰበንያ ልጅ ሐጡስ አደሰ።\n" +
                "11 ፤ የካሪም ልጅ መልክያ፥ የፈሐት ሞዓብ ልጅም አሱብ ሌላውን ክፍልና የእቶኑን ግንብ አደሱ።\n" +
                "12 ፤ በአጠገባቸውም የኢየሩሳሌም ግዛት እኵሌታና የመንደሮችዋ አለቃ የአሎኤስ ልጅ ሰሎም አደሰ።\n" +
                "13 ፤ ሐኖንና የዛኖዋ ሰዎችም የሸለቆውን በር አደሱ፤ ሠሩት፥ ሳንቃዎቹንም አቆሙ፥ ቍልፎቹንና መወርወሪያዎቹንም አደረጉ፤ ደግሞም እስከ ጕድፍ መጣያው በር ድረስ አንድ ሺህ ክንድ የሚሆን ቅጥር ሠሩ።\n" +
                "14 ፤ የቤትሐካሪምም ግዛት አለቃ የሬካብ ልጅ መልክያ የጕድፍ መጣያውን በር አደሰ፤ ሠራው፥ ሳንቃዎቹንም አቆመ፥ ቍልፎቹንና መወርወሪያዎቹንም አደረገ።\n" +
                "15 ፤ የምጽጳም ግዛት አለቃ የኮልሖዜ ልጅ ሰሎም የምንጩን በር አደሰ፤ ሠራው፥ ከደነውም፥ ሳንቃዎቹንም አቆመ፥ ቍልፎቹንና መወርወሪያዎቹንም አደረገ፤ ከዳዊትም ከተማ እስከሚወርደው ደረጃ ድረስ በንጉሡ አትክልት አጠገብ ያለውን የሼላን መዋኛ ቅጥር ሠራ።\n" +
                "16 ፤ ከእርሱም በኋላ የቤትጹር ግዛት እኵሌታ አለቃ የዓዝቡቅ ልጅ ነህምያ በዳዊት መቃብር አንጻር እስካለው ስፍራ፥ እስከ ተሠራውም መዋኛ፥ እስከ ኃያላኑም ቤት ድረስ አደሰ።\n" +
                "17 ፤ ከእርሱም በኋላ ሌዋውያንና የባኒ ልጅ ሬሁም አደሱ። በአጠገባቸውም የቅዒላ ግዛት እኵሌታ አለቃ ሐሸብያ ስለ ግዛቱ አደሰ።\n" +
                "18 ፤ ከእርሱም በኋላ የቅዒላ ግዛት እኵሌታ አለቃ የኤንሐዳድ ልጅ በዋይ ወንድሞቹም አደሱ።\n" +
                "19 ፤ በአጠገቡም የምጽጳ አለቃ የኢያሱ ልጅ ኤጽር በማዕዘኑ አጠገብ በጦር መሣሪያ ቤት አንጻር ሌላውን ክፍል አደሰ።\n" +
                "20 ፤ ከእርሱም በኋላ የዘባይ ልጅ ባሮክ ከማዕዘኑ ጀምሮ እስከ ታላቁ ካህን እስከ ኤልያሴብ ቤት መግቢያ ድረስ ሌላውን ክፍል ተግቶ አደሰ።\n" +
                "21 ፤ ከእርሱም በኋላ የአቆስ ልጅ የኦርዮ ልጅ ሜሪሞት ከኤልያሴብ ቤት መግቢያ ጀምሮ እስከ ኤልያሴብ ቤት መጨረሻ ድረስ ሌላውን ክፍል አደሰ።\n" +
                "22 ፤ ከእርሱም በኋላ የቈላው ሰዎች ካህናቱ አደሱ።\n" +
                "23 ፤ ከእነርሱም በኋላ ብንያምና አሱብ በቤታቸው አንጻር ያለውን አደሱ። ከእነርሱም በኋላ የሐናንያ ልጅ የመዕሤያ ልጅ ዓዛርያስ በቤቱ አጠገብ ያለውን አደሰ።\n" +
                "24 ፤ ከእርሱም በኋላ የኤንሐደድ ልጅ ቢንዊ ከዓዛርያስ ቤት ጀምሮ እስከ ማዕዘኑ ድረስ ሌላውን ክፍል አደሰ።\n" +
                "25 ፤ የኡዛይ ልጅ ፋላል በማዕዘኑ አንጻር ያለውንና በዘበኞች አደባባይ አጠገብ ከላይኛው የንጉሡ ቤት ወጥቶ የቆመውን ግንብ ሠራ። ከእርሱም በኋላ የፋሮስ ልጅ ፈዳያ ሠራ።\n" +
                "26 ፤ ናታኒምም በዖፌል በውኃው በር አንጻር በምሥራቅ በኩል ወጥቶ በቆመው ግንብ አጠገብ እስካለው ስፍራ ድረስ ተቀመጡ።\n" +
                "27 ፤ ከእርሱም በኋላ ቴቁሐውያን ወጥቶ በቆመው በታላቁ ግንብ አንጻር ያለውን እስከ ዖፌል ቅጥር ድረስ ሌላውን ክፍል አደሱ።\n" +
                "28 ፤ ከፈረሱ በር በላይ ካህናቱ እያንዳንዳቸው በየቤታቸው አንጻር አደሱ።\n" +
                "29 ፤ ከዚያ በኋላ የኢሜር ልጅ ሳዶቅ በቤቱ አንጻር አደሰ። ከእርሱም በኋላ የምሥራቁን በር ጠባቂ የሴኬንያ ልጅ ሸማያ አደሰ።\n" +
                "30 ፤ ከእርሱ በኋላ የሰሌምያ ልጅ ሐናንያና የሴሌፍ ስድስተኛው ልጁ ሐኖን ሌላውን ክፍል አደሱ። ከዚያም በኋላ የበራክያ ልጅ ሜሱላም በጓዳው አንጻር ያለውን አደሰ።\n" +
                "31 ፤ ከእርሱም በኋላ ከወርቅ አንጥረኞቹ የነበረ መልክያ እስከ ናታኒምና እስከ ነጋዴዎቹ ቤት ድረስ በሐሚፍቃድ በር አንጻር ያለውን እስከ ማዕዘኑ መውጫ ድረስ አደሰ።\n" +
                "32 ፤ ከማዕዘኑም መውጫ ጀምረው እስከ በጉ በር ድረስ ወርቅ አንጥረኞችና ነጋዴዎች አደሱ።\n"));
        // Add more verses as needed
        return new Chapter(3, verses);
    }

    private Chapter chapterFour() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ሰንባላጥም ቅጥሩን እንደ ሠራን በሰማ ጊዜ እጅግ ተቈጣ፥ ተበሳጨም፥ በአይሁድም አላገጠ።\n" +
                "2 ፤ በወንድሞቹና በሰማርያ ሠራዊትም ፊት። እነዚህ ደካሞች አይሁድ የሚሠሩት ምንድር ነው? ይተዉላቸዋልን? ይሠዋሉን? በአንድ ቀንስ ይጨርሳሉን? የተቃጠለውንስ ድንጋይ ከፍርስራሹ መልሰው ያድኑታልን? ብሎ ተናገረ።\n" +
                "3 ፤ አሞናዊውም ጦብያ በአጠገቡ ቆሞ። በድንጋይ በሚሠሩት ቅጥራቸው ላይ ቀበሮ ቢመጣበት ያፈርሰዋል አለ።\n" +
                "4 ፤ አምላካችን ሆይ፥ ተንቀናልና ስማ፤ ስድባቸውን በራሳቸው ላይ መልስባቸው፤ በምርኮ አገር ለብዝበዛ አሳልፈህ ስጣቸው።\n" +
                "5 ፤ በደላቸውንም አትክደን፥ ኃጢአታቸውም ከፊትህ አይደምሰስ፤ በሠራተኞች ፊት አስቆጥተውሃልና።\n" +
                "6 ፤ ቅጥሩንም ሠራን፤ ቅጥሩም ሁሉ እስከ እኵሌታው ድረስ ተጋጠመ፤ የሕዝቡም ልብ ለሥራው ጨከነ።\n" +
                "7 ፤ ሰንባላጥና ጦብያም ዓረባውያንም አሞናውያንም አሽዶዳውያንም የኢየሩሳሌም ቅጥር እየታደሰ እንደ ሄደ፥ የፈረሰውም ሊጠገን እንደ ተጀመረ በሰሙ ጊዜ እጅግ ተቈጡ።\n" +
                "8 ፤ መጥተውም ኢየሩሳሌምን ይወጉና ያሸብሩ ዘንድ ሁሉም በአንድነት ተማማሉ።\n" +
                "9 ፤ ወደ አምላካችንም ጸለይን፥ ከእነርሱም የተነሣ በአንጻራቸው ተጠባባቂዎች በሌሊትና በቀን አደረግን።\n" +
                "10 ፤ ይሁዳም። የተሸካሚዎች ኃይል ደከመ፥ ፍርስራሹም ብዙ ነው፤ ቅጥሩንም እንሠራ ዘንድ አንችልም አሉ።\n" +
                "11 ፤ ጠላቶቻችንም። ወደ መካከላቸው እስክንመጣና እስክንገድላቸው ድረስ ሥራቸውንም እስክናስተጓጕል ድረስ አያውቁምና አያዩም አሉ።\n" +
                "12 ፤ በአጠገባቸውም የተቀመጡት አይሁድ መጥተው። ከስፍራው ሁሉ ይመጡብናል ብለው አሥር ጊዜ ነገሩን።\n" +
                "13 ፤ ከቅጥሩም በስተ ኋላ በኩል ባለው በታችኛው ስፍራ ሰይፋቸውን ጦራቸውንም ቀስታቸውንም አስይዤ ሕዝቡን በየወገናቸው አቆምኋቸው።\n" +
                "14 ፤ አይቼም ተነሣሁ፥ ታላላቆቹንና ሹማምቱንም የቀሩትንም ሕዝብ። አትፍሩአቸው፤ ታላቁንና የተፈራውን ጌታ አስቡ፥ ስለ ወንድሞቻችሁም ስለ ወንዶችና ስለ ሴቶች ልጆቻችሁም ስለ ሚስቶቻችሁም ስለ ቤቶቻችሁም ተዋጉ አልኋቸው።\n" +
                "15 ፤ ጠላቶቻችንም ይህ ነገር እንደ ደረሰልን፥ እግዚአብሔርም ምክራቸውን ከንቱ እንዳደረገው ሰሙ፤ እኛም ሁላችን ወደ ቅጥሩ እያንዳንዳችን ወደ ሥራችን ተመለስን።\n" +
                "16 ፤ ከዚያም ቀን ጀምሮ እኵሌቶቹ ብላቴኖቼ ሥራ ይሠሩ ነበር፥ እኵሌቶቹም ጋሻና ጦር ቀስትና ጥሩርም ይዘው ነበር፤ አለቆቹም ከይሁዳ ቤት ሁሉ በኋላ ይቆሙ ነበር።\n" +
                "17 ፤ ቅጥሩንም የሚሠሩትና ተሸካሚዎቹ በአንድ እጃቸው ይሠሩ ነበር፥ በአንድ እጃቸውም የጦር መሣሪያቸውን ይይዙ ነበር።\n" +
                "18 ፤ አናጢዎቹም ሁሉ እያንዳንዱ ሰይፉን በወገቡ ታጥቆ ይሠራ ነበር፤ ቀንደ መለከትም የሚነፋ በአጠገቤ ነበረ።\n" +
                "19 ፤ ታላላቆቹንና ሹማምቱን የቀሩትንም ሕዝብ። ሥራው ታላቅና ሰፊ ነው፥ እኛም በቅጥሩ ላይ ተበታትነናል፥ አንዱም ከሁለተኛው ርቆአል፤\n" +
                "20 ፤ የቀንደ መለከቱን ድምፅ ወደምትሰሙበት ስፍራ ወደዚያ ወደ እኛ ተሰብሰቡ፤ አምላካችን ስለ እኛ ይዋጋል አልኋቸው።\n" +
                "21 ፤ ሥራውንም ሠራን ከማለዳ ወገግታም ጀምሮ ከዋክብት እስኪወጡ ድረስ እኵሌቶቹ ጦር ይይዙ ነበር።\n" +
                "22 ፤ ደግሞም በዚያ ጊዜ ሕዝቡን። ሁላችሁ ከብላቴኖቻችሁ ጋር በኢየሩሳሌም ውስጥ እደሩ፤ በሌሊትም ጠባቂዎች ሁኑልን፥ በቀንም ሥሩ አልኋቸው።\n" +
                "23 ፤ እኔና ወንድሞቼም ብላቴኖቼም በኋላዬም የነበሩት ጠባቂዎች ልብሳችንን አናወልቅም ነበር።\n"));
        // Add more verses as needed
        return new Chapter(4, verses);
    }
    private Chapter chapterFive() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በወንድሞቻቸውም በአይሁድ ላይ ትልቅ የሕዝቡና የሚስቶቻቸው ጩኸት ሆነ።\n" +
                "2 ፤ አያሌዎቹም። ወንዶችና ሴቶች ልጆቻችን ብዙዎች ናቸው፤ በልተንም በሕይወት እንድንኖር እህልን እንሸምት ይሉ ነበር።\n" +
                "3 ፤ አያሌዎቹም። ከራብ የተነሣ እህልን እንሸምት ዘንድ እርሻችንና ወይናችንን ቤታችንንም አስይዘናል ይሉ ነበር።\n" +
                "4 ፤ ሌሎቹም። ለንጉሡ ግብር እርሻችንንና ወይናችንን አስይዘን ገንዘብ ተበድረናል፤\n" +
                "5 ፤ አሁንም ሥጋችን እንደ ወንድሞቻችን ሥጋ፥ ልጆቻችንም እንደ ልጆቻቸው ናቸው፤ እነሆም ወንዶችና ሴቶች ልጆቻችን ባሪያዎች ይሆኑ ዘንድ ሰጥተናል፥ ከሴቶችም ልጆቻችን ባሪያዎች ሆነው የሚኖሩ አሉ፤ ታላላቆችም እርሻችንና ወይናችንን ይዘዋልና ልናድናቸው አንችልም ይሉ ነበር።\n" +
                "6 ፤ እኔም ጩኸታቸውንና ይህን ቃል በሰማሁ ጊዜ እጅግ ተቈጣሁ።\n" +
                "7 ፤ በልቤም አሰብሁ፥ ታላላቆቹንና ሹማምቱንም። ሁላችሁ እያንዳንዳችሁ ወለድ ትወስዳላችሁ ብዬ ተጣላኋቸው፤ ትልቅም ጉባኤ ሰበሰብሁባቸው።\n" +
                "8 ፤ እኔም። ለአሕዛብ የተሸጡትን ወንድሞቻችንን አይሁድን በፈቃዳችን ተቤዠን፤ እናንተስ ወንድሞቻችሁን ትሸጣላችሁን? እነርሱስ ለእኛ የተሸጡ ይሆናሉን? አልኋቸው። እነርሱም ዝም አሉ፥ መልስም አላገኙም።\n" +
                "9 ፤ ደግሞም አልሁ። የምታደርጉት ነገር መልካም አይደለም፤ ጠላቶቻችን አሕዛብ እንዳይሰድቡን አምላካችንን በመፍራት ትሄዱ ዘንድ አይገባችሁምን?\n" +
                "10 ፤ እኔም ደግሞ ወንድሞቼም ብላቴኖቼም ገንዘብና እህል ለእነርሱ አበድረናል፤ እባካችሁ፥ ይህን ወለድ እንተውላቸው።\n" +
                "11 ፤ እርሻቸውንና ወይናቸውን ወይራቸውንና ቤታቸውንም ከእነርሱም የወሰዳችሁትን ገንዘቡንና እህሉን፥ ወይን ጠጁንና ዘይቱን ከመቶ እጅ አንድ እጅ እባካችሁ ዛሬ መልሱላቸው።\n" +
                "12 ፤ እነርሱም። እንመልስላቸዋለን፥ ከእነርሱም ምንም አንሻም፤ እንደ ተናገርህ እንዲሁ እናደርጋለን አሉ። ካህናቱንም ጠርቼ እንደዚህ ነገር ያደርጉ ዘንድ አማልኋቸው።\n" +
                "13 ፤ ደግሞም ልብሴን አራገፍሁና። ይህን ነገር የማያደርገውን ሰው ከቤቱና ከሥራው እንዲሁ እግዚአብሔር ያራግፈው፤ እንዲሁም የተራገፈና ባዶ ይሁን አልሁ። ጉባኤውም ሁሉ። አሜን አሉ፥ እግዚአብሔርንም አመሰገኑ፤ ሕዝቡም እንደዚህ ነገር አደረጉ።\n" +
                "14 ፤ ንጉሡም በይሁዳ ምድር ላይ አለቃ እሆን ዘንድ ካዘዘኝ ጊዜ ጀምሮ ከንጉሡ ከአርጤክስስ ከሀያኛው ዓመት እስከ ሠላሳ ሁለተኛው ዓመት ድረስ አሥራ ሁለት ዓመት ያህል እኔና ወንድሞቼ ለአለቃ የሚገባውን ስንቅ አልበላንም።\n" +
                "15 ፤ ከእኔ አስቀድመው የነበሩት አለቆች ግን በሕዝቡ ላይ አክብደው ነበር፤ ስለ እንጀራውና ስለ ወይኑ አርባ ሰቅል ብር ይወስዱ ነበር፤ ሎሌዎቻቸውም ደግሞ በሕዝቡ ላይ ይሠለጥኑ ነበር፤ እኔ ግን እግዚአብሔርን ስለ ፈራሁ እንዲህ አላደረግሁም።\n" +
                "16 ፤ ደግሞም አጥብቄ የቅጥሩን ሥራ ሠራሁ፥ እርሻም አልገዛንም፤ ብላቴኖቼም ሁሉ ወደዚያው ወደ ሥራው ተሰበሰቡ።\n" +
                "17 ፤ ደግሞም በዙሪያችን ካሉት አሕዛብ ወደ እኛ ከመጡት ሌላ ከአይሁድና ከሹማምቱ መቶ አምሳ ሰዎች በገበታዬ ነበሩ።\n" +
                "18 ፤ ከወፎችም በቀር ለአንድ ቀን አንድ በሬና ስድስት የሰቡ በጎች፥ በአሥር በአሥር ቀንም ብዙ ልዩ ልዩ ዓይነት ወይን ጠጅ ይዘጋጅልኝ ነበር፤ ነገር ግን አገዛዝ በሕዝቡ ላይ ከብዶ ነበርና ለአለቃ የሚገባውን ስንቅ አልሻም ነበር።\n" +
                "19 ፤ አምላኬ ሆይ፥ ለዚህ ሕዝብ ያደረግሁትን ሁሉ ለበጎነት አስብልኝ።\n"));

        return new Chapter(5, verses);
    }

    private Chapter chapterSix() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እንዲህም ሆነ፤ ቅጥሩን እንደ ሠራሁ፥ ከፍራሹም አንዳች እንዳልቀረበት ሰንባላጥና ጦብያ ዓረባዊውም ጌሳም የቀሩትም ጠላቶቻችን ሰሙ፤ ነገር ግን እስከዚያ ጊዜ ድረስ በበሮቹ ውስጥ ሳንቃዎቹን አላቆምሁም ነበር።\n" +
                "2 ፤ ሰንባላጥና ጌሳም። መጥተህ በኦኖ ቈላ ውስጥ ባሉት መንደሮች እንገናኝ ብለው ላኩብኝ፤ ነገር ግን ክፉ ያደርጉብኝ ዘንድ ያስቡ ነበር።\n" +
                "3 ፤ እኔም። ትልቅ ሥራ እሠራለሁ፥ እወርድም ዘንድ አይቻለኝም፤ ሥራውን ትቼ ወደ እናንተ በመውረዴ ስለ ምን ሥራው ይታጐላል? ብዬ መልእክተኞችን ላክሁባቸው።\n" +
                "4 ፤ እንዲህም ቃል አራት ጊዜ ላኩብኝ፤ እኔም እንደ ፊተኛው ቃል መለስሁላቸው።\n" +
                "5 ፤ ሰንባላጥም እንደ ፊተኛው ጊዜ ብላቴናውን አምስተኛ ጊዜ ላከብኝ፤\n" +
                "6 ፤ በእጁም ውስጥ። አንተና አይሁድ ዓመፅ እንድታስቡ፥ ስለዚህም ቅጥሩን እንድትሠራ፥ ንጉሣቸውም ትሆን ዘንድ እንድትወድድ በአሕዛብ ዘንድ ተሰምቶአል።\n" +
                "7 ፤ ደግሞም። ንጉሥ በይሁዳ አለ ብለው ስለ አንተ በኢየሩሳሌም ይናገሩ ዘንድ ነቢያትን አቁመሃል፤ አሁንም ለንጉሡ ይህን ቃል ያወሩለታል፤ እንግዲህ መጥተህ በአንድነት እንማከር የሚል ክፍት ደብዳቤ ነበረ።\n" +
                "8 ፤ እኔም። አንተ ከልብህ ፈጥረኸዋል እንጂ እንደ ተናገርኸው ነገር ምንም የለም ብዬ ላክሁበት።\n" +
                "9 ፤ እነርሱም ሁሉ ሥራው እንዳይፈጸም። እጃቸው ይደክማል ብለው ያስፈራሩን ዘንድ ወደዱ፤ አሁንም፥ አምላክ ሆይ፥ እጄን አበርታ።\n" +
                "10 ፤ እኔም ወደ መሔጣብኤል ልጅ ወደ ድላያ ልጅ ወደ ሸማያ ቤት ገባሁ፤ እርሱም ተዘግቶ ነበርና። በእግዚአብሔር ቤት በመቅደሱ ውስጥ እንገናኝ የመቅደሱንም ደጆች እንዝጋ፤ እነርሱ መጥተው ይገድሉሃልና፥ በሌሊትም ይገድሉህ ዘንድ ይመጣሉና አለ።\n" +
                "11 ፤ እኔም። እንደ እኔ ያለ ሰው የሸሸና፥ ነፍሱንስ ያድን ዘንድ ወደ መቅደስ የገባ ማን ነው? እኔስ አልገባም አልሁት።\n" +
                "12 ፤ እግዚአብሔርም ልኮት እንዳልነበረ፥ በእኔ ላይ ግን ትንቢት እንደ ተናገረ፥ እነሆ፥ አወቅሁ፤ ጦብያና ሰንባላጥም ገዝተውት ነበር።\n" +
                "13 ፤ ይህንም ነገር አደርግና እበድል ዘንድ፥ በእኔም ላይ ክፋት እንዲናገሩና እንዲያላግጡ ያስፈራራኝ ዘንድ ተገዝቶ ነበር።\n" +
                "14 ፤ አምላኬ ሆይ፥ ስለዚህ ሥራቸው ጦብያንና ሰንባላጥን ያስፈራሩኝም ዘንድ የወደዱትን ነቢይቱን ኖዓድያን የቀሩትንም ነቢያት አስብ።\n" +
                "15 ፤ ቅጥሩም በኤሉል ወር በሀያ አምስተኛው ቀን በአምሳ ሁለት ቀን ውስጥ ተጨረሰ።\n" +
                "16 ፤ ጠላቶቻችንም ሁሉ ይህን በሰሙ ጊዜ በዙሪያችን የነበሩ አሕዛብ ሁሉ ፈሩ፥ በራሳቸውም አሳብ እጅግ ተዋረዱ፥ ይህም ሥራ በእግዚአብሔር እንደ ተደረገ አወቁ።\n" +
                "17 ፤\n" +
                "18 ፤ ጦብያም የኤራ ልጅ የሴኬንያ አማች ስለ ነበረ፥ ልጁም ይሆሐናን የቤራክያን ልጅ የሜሱላምን ሴት ልጅ ስላገባ፥ በይሁዳ ብዙ ሰዎች ከእርሱ ጋር ተማምለው ነበርና በዚያ ወራት ብዙ የይሁዳ አለቆች ወደ ጦብያ ደብዳቤዎች ይልኩ ነበር፥ የጦብያም ደብዳቤዎች ወደ እነርሱ ይመጡ ነበር።\n" +
                "19 ፤ ደግሞም በፊቴ ስለ እርሱ መልካም ይናገሩ ነበር፥ ቃሌንም ያወሩለት ነበር፤ ጦብያም ሊያስፈራራኝ ደብዳቤዎችን ይልክ ነበር።\n" ));

        return new Chapter(6, verses);
    }

    private Chapter chapterSeven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እንዲህም ሆነ፤ ቅጥሩ ከተሠራ በኋላ፥ ሳንቃዎቹንም ካቆምሁ በኋላ፥ በረኞቹና መዘምራኑ ሌዋውያኑም ከተሾሙ በኋላ፥\n" +
                "2 ፤ ወንድሜን አናኒንና የግንቡን አለቃ ሐናንያን በኢየሩሳሌም ላይ ሾምኋቸው፤ እርሱም እውነተኛ ከሌሎቹም ይልቅ እግዚአብሔርን የሚፈራ ሰው ነበረ።\n" +
                "3 ፤ እኔም። ፀሐይ እስኪሞቅ ድረስ የኢየሩሳሌም በሮች አይከፈቱ፤ እነርሱም ቆመው ሳሉ ደጆቹን ይዝጉ፥ ይቈልፉም፤ ከኢየሩሳሌምም ሰዎች አንዳንዱን በየተራው አንዳንዱንም በየቤቱ አንጻር ጠባቆችን አስቀምጡ አልኋቸው።\n" +
                "4 ፤ ከተማይቱም ሰፊና ታላቅ ነበረች፤ በውስጥዋ የነበሩ ሕዝብ ግን ጥቂቶች ነበሩ፥ ቤቶቹም አልተሠሩም ነበር።\n" +
                "5 ፤ አምላኬም ታላቆቹንና ሹማምቱን ሕዝቡንም ሰብስቤ እቈጥራቸው ዘንድ በልቤ አደረገ፤ አስቀድመው የመጡትን ሰዎች የትውልድ መጽሐፋቸውን አገኘሁ፥ በእርሱም እንደዚህ ተጽፎ አገኘሁ።\n" +
                "6 ፤ የባቢሎን ንጉሥ ናቡከደነፆር ከማረካቸው ምርኮኞች ወደ ኢየሩሳሌምና ወደ ይሁዳ ወደ እየከተማቸው የተመለሱት የአገር ልጆች እነዚህ ናቸው።\n" +
                "7 ፤ ከዘሩባቤል፥ ከኢያሱ፥ ከነህምያ፥ ከአዛርያስ፥ ከረዓምያ፥ ከነሐማኒ፥ ከመርዶክዮስ፥ ከበላሳን፥ ከሚስጴሬት፥ ከበጉዋይ፥ ከነሑም፥ ከበዓና ጋር መጡ።\n" +
                "8 ፤ የእስራኤልም ሕዝብ ሰዎች ቍጥር ይህ ነው፤ የፋሮስ ልጆች፥ ሁለት ሺህ መቶ ሰባ ሁለት።\n" +
                "9 ፤ የሰፋጥያስ ልጆች ሦስት መቶ ሰባ ሁለት።\n" +
                "10 ፤ የኤራ ልጆች፥ ስድስት መቶ አምሳ ሁለት።\n" +
                "11 ፤ ከኢያሱና ከኢዮአብ ልጆች የሆኑ የፈሐት ሞዓብ ልጆች፥ ሁለት ሺህ ስምንት መቶ አሥራ ስምንት።\n" +
                "12 ፤ የኤላም ልጆች፥ ሺህ ሁለት መቶ አምሳ አራት።\n" +
                "13 ፤ የዛቱዕ ልጆች፥ ስምንት መቶ አርባ አምስት።\n" +
                "14 ፤ የዘካይ ልጆች፥ ሰባት መቶ ስድሳ።\n" +
                "15 ፤ የቢንዊ ልጆች፥ ስድስት መቶ አርባ ስምንት።\n" +
                "16 ፤ የቤባይ ልጆች፥ ስድስት መቶ ሀያ ስምንት።\n" +
                "17 ፤ የዓዝጋድ ልጆች፥ ሁለት ሺህ ሦስት መቶ ሀያ ሁለት።\n" +
                "18 ፤ የአዶኒቃም ልጆች፥ ስድስት መቶ ስድሳ ሰባት።\n" +
                "19 ፤ የበጉዋይ ልጆች፥ ሁለት ሺህ ስድሳ ሰባት።\n" +
                "20 ፤ የዓዲን ልጆች፥ ስድስት መቶ አምሳ አምስት።\n" +
                "21 ፤ የሕዝቅያስ ወገን የአጤር ልጆች፥ ዘጠና ስምንት።\n" +
                "22 ፤ የሐሱም ልጆች፥ ሦስት መቶ ሀያ ስምንት።\n" +
                "23 ፤ የቤሳይ ልጆች፥ ሦስት መቶ ሀያ አራት።\n" +
                "24 ፤ የሐሪፍ ልጆች፥ መቶ አሥራ ሁለት።\n" +
                "25 ፤ የገባዖን ልጆች፥ ዘጠና አምስት።\n" +
                "26 ፤ የቤተ ልሔምና የነጦፋ ሰዎች፥ መቶ ሰማንያ ስምንት።\n" +
                "27 ፤ የዓናቶች ሰዎች፥ መቶ ሀያ ስምንት።\n" +
                "28 ፤ የቤትዓዝሞት ሰዎች፥ አርባ ሁለት።\n" +
                "29 ፤ የቂርያትይዓሪምና የከፊራ የብኤሮትም ሰዎች፥ ሰባት መቶ አርባ ሦስት።\n" +
                "30 ፤ የራማና የጌባ ሰዎች፥ ስድስት መቶ ሀያ አንድ።\n" +
                "31 ፤ የማክማስ ሰዎች፥ መቶ ሀያ ሁለት።\n" +
                "32 ፤ የቤቴልና የጋይ ሰዎች፥ መቶ ሀያ ሦስት።\n" +
                "33 ፤ የሁለተኛው ናባው ሰዎች፥ አምሳ ሁለት።\n" +
                "34 ፤ የሁለተኛው ኤላም ልጆች፥ ሺህ ሁለት መቶ አምሳ አራት።\n" +
                "35 ፤ የካሪም ልጆች፥ ሦስት መቶ ሀያ።\n" +
                "36 ፤ የኢያሪኮ ልጆች፥ ሦስት መቶ አርባ አምስት\n" +
                "37 ፤ የሎድና የሐዲድ የኦኖም ልጆች፥ ሰባት መቶ ሀያ አንድ።\n" +
                "38 ፤ የሴናዓ ልጆች፥ ሦስት ሺህ ዘጠኝ መቶ ሠላሳ።\n" +
                "39 ፤ ካህናቱ፤ ከኢያሱ ወገን የዮዳኤ ልጆች፥ ዘጠኝ መቶ ሰባ ሦስት።\n" +
                "40 ፤ የኢሜር ልጆች፥ ሺህ አምሳ ሁለት።\n" +
                "41 ፤ የፋስኮር ልጆች፥ ሺህ ሁለት መቶ አርባ ሰባት።\n" +
                "42 ፤ የካሪም ልጆች፥ ሺህ አሥራ ሰባት።\n" +
                "43 ፤ ሌዋውያኑ፤ ከሆዳይዋ ወገን የኢያሱና የቀድምኤል ልጆች፥ ሰባ አራት።\n" +
                "44 ፤ መዘምራኑ፤ የአሳፍ ልጆች፥ መቶ አርባ ስምንት።\n" +
                "45 ፤ በረኞቹ፤ የሰሎም ልጆች፥ የአጤር ልጆች፥ የጤልሞን ልጆች፥ የዓቁብ ልጆች፥ የሐጢጣ ልጆች፥ የሶባይ ልጆች፥ መቶ ሠላሳ ስምንት።\n" +
                "46 ፤ ናታኒም፥ የሲሐ ልጆች፥ የሐሡፋ ልጆች፥\n" +
                "47 ፤ የጠብዖት ልጆች፥ የኬራስ ልጆች፥ የሲዓ ልጆች፥\n" +
                "48 ፤ የፋዶን ልጆች፥ የልባና ልጆች፥\n" +
                "49 ፤ የአጋባ ልጆች፥ የሰምላይ ልጆች፥ የሐናን ልጆች፥ የጌዴል ልጆች፥ የጋሐር ልጆች፥\n" +
                "50 ፤ የራያ ልጆች፥ የረአሶን ልጆች፥ የኔቆዳ ልጆች፥\n" +
                "51 ፤ የጋሴም ልጆች፥ የዖዛ ልጆች፥ የፋሴሐ ልጆች፥\n" +
                "52 ፤ የቤሳይ ልጆች፥ የምዑናውያን ልጆች፥\n" +
                "53 ፤ የንፉሰሲም ልጆች፥ የበቅቡቅ ልጆች፥ የሐቀፋ ልጆች፥ የሐርሑር ልጆች፥\n" +
                "54 ፤ የበስሎት ልጆች፥ የምሒዳ ልጆች፥ የሐርሻ ልጆች፥\n" +
                "55 ፤ የበርቆስ ልጆች፥ የሲሣራ ልጆች፥\n" +
                "56 ፤ የቴማ ልጆች፥ የንስያ ልጆች፥ የሐጢፋ ልጆች።\n" +
                "57 ፤ የሰሎሞን ባሪያዎች ልጆች፤ የሶጣይ ልጆች፥ የሶፌሬት ልጆች፥ የፍሩዳ ልጆች፥\n" +
                "58 ፤ የየዕላ ልጆች፥ የደርቆን ልጆች፥ የጌዴል ልጆች፥\n" +
                "59 ፤ የሰፋጥያስ ልጆች፥ የሐጢል ልጆች፥ የፈከራት ልጆች፥ የሐፂቦይም ልጆች፥ የአሞን ልጆች።\n" +
                "60 ፤ ናታኒም ሁሉና የሰሎሞን ባሪያዎች ልጆች ሦስት መቶ ዘጠና ሁለት ነበሩ።\n" +
                "61 ፤ ከቴልሜላ፥ ከቴላሬሳ፥ ከክሩብ፥ ከአዳን፥ ከኢሜር የወጡ እነዚህ ናቸው፤ ነገር ግን የአባቶቻቸውን ቤቶችና ዘራቸውን ወይም ከእስራኤል ወገን መሆናቸውን ያስታውቁ ዘንድ አልቻሉም፤\n" +
                "62 ፤ የዳላያ ልጆች፥ የጦብያ ልጆች፥ የኔቆዳ ልጆች፥ ስድስት መቶ አርባ ሁለት።\n" +
                "63 ፤ ከካህናቱም የኤብያ ልጆች፥ የአቆስ ልጆች፥ ከገለዓዳዊው ከቤርዜሊ ልጆች ሚስት ያገባ በስሙም የተጠራ የቤርዜሊ ልጆች።\n" +
                "64 ፤ እነዚህ በትውልድ መጽሐፍ ትውልዳቸውን ፈለጉ፥ ነገር ግን አልተገኘም፤ ከክህነትም ተከለከሉ።\n" +
                "65 ፤ ሐቴርሰታም። በኡሪምና በቱሚም የሚፈርድ ካህን እስኪነሣ ደረስ ከተቀደሰው ነገር አትበሉም አላቸው።\n" +
                "66 ፤\n" +
                "67 ፤ ሰባት ሺህ ሦስት መቶ ሠላሳ ሰባት ከነበሩ ከሎሌዎቻቸውና ከገረዶቻቸው ሌላ ጉባኤው ሁሉ አርባ ሁለት ሺህ ሦስት መቶ ስድሳ ነበሩ፤ ሁለቱ መቶም አርባ አምስት ወንዶችና ሴቶች መዘምራን ነበሩአቸው።\n" +
                "68 ፤ ፈረሶቻቸውም ሰባት መቶ ሠላሳ ስድስት፥ በቅሎቻቸውም ሁለት መቶ አርባ አምስት፥\n" +
                "69 ፤ ግመሎቻቸውም አራት መቶ ሠላሳ አምስት፥ አህዮቻቸውም ስድስት ሺህ ሰባት መቶ ሀያ ነበሩ።\n" +
                "70 ፤ ከአባቶች ቤቶች አለቆችም አያሌዎቹ ሰዎች ስለ ሥራው ስጦታ ሰጡ። ሐቴርሰታም አንድ ሺህ የወርቅ ዳሪክ፥ አምሳም ድስቶች፥ አምስት መቶ ሠላሳም የካህናት ልብስ በቤተ መዛግብት ውስጥ ሰጠ።\n" +
                "71 ፤ ከአባቶች ቤቶች አለቆችም አያሌዎቹ በሥራው ቤተ መዛግብት ውስጥ ሀያ ሺህ የወርቅ ዳሪክ፥ ሁለት ሺህ ሁለት መቶም ምናን ብር ሰጡ።\n" +
                "72 ፤ የቀሩትም ሕዝብ የሰጡት ሀያ ሺህ የወርቅ ዳሪክና ሁለት ሺህ ምናን ብር፥ ስድሳ ሰባትም የካህናት ልብስ ነበረ።\n" +
                "73 ፤ ካህናቱና ሌዋውያኑም፥ በረኞቹና መዘምራኑም ከሕዝቡም አያሌዎቹ፥ ናታኒምም፥ እስራኤልም ሁሉ በከተሞቻቸው ተቀመጡ።"));

        return new Chapter(7, verses);
    }

    private Chapter chapterEight() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ሰባተኛውም ወር በደረሰ ጊዜ የእስራኤል ልጆች በከተሞቻቸው ነበሩ። ሕዝቡም ሁሉ በውኃው በር ፊት ወዳለው አደባባይ እንደ አንድ ሰው ሆነው ተሰበሰቡ፤ እግዚአብሔርም ለእስራኤል ያዘዘውን የሙሴን ሕግ መጽሐፍ ያመጣ ዘንድ ጸሐፊውን ዕዝራን ተናገሩት።\n" +
                "2 ፤ ካህኑም ዕዝራ በሰባተኛው ወር በመጀመሪያው ቀን ሕጉን በማኅበሩ በወንዶችና በሴቶች አስተውለውም በሚሰሙት ሁሉ ፊት አመጣው።\n" +
                "3 ፤ በውኃውም በር ፊት ባለው አደባባይ ላይ ቆሞ፥ ወንዶችና ሴቶች የሚያስተውሉም ሲሰሙ፥ ከማለዳ ጀምሮ እስከ ቀትር ድረስ አነበበው፤ የሕዝቡም ሁሉ ጆሮ የሕጉን መጽሐፍ ለመስማት ያደምጥ ነበር።\n" +
                "4 ፤ ጸሐፊውም ዕዝራ ስለዚህ ነገር በተሠራ በእንጨት መረባርብ ላይ ቆሞ ነበር፤ በአጠገቡ መቲትያ፥ ሽማዕ፥ ዓናያ፥ ኦርዮ፥ ኬልቅያስ፥ መዕሤያ በቀኙ በኩል፥ ፈዳያ፥ ሚሳኤል፥ መልክያ፥ ሐሱም፥ ሐሽበዳና፥ ዘካርያስ፥ ሜሱላም በግራው በኩል ቆመው ነበር።\n" +
                "5 ፤ ዕዝራም በሕዝቡ ሁሉ ላይ ከፍ ብሎ ሕዝቡ ሁሉ እያዩ መጽሐፉን ገለጠ፤ በገለጠውም ጊዜ ሕዝቡ ሁሉ ቆሙ።\n" +
                "6 ፤ ዕዝራም ታላቁን አምላክ እግዚአብሔርን ባረከ፤ ሕዝቡም ሁሉ እጃቸውን እየዘረጉ። አሜን፥ አሜን ብለው መለሱ። ራሳቸውንም አዘነበሉ፥ በግምባራቸውም ተደፍተው ለእግዚአብሔር ሰገዱ።\n" +
                "7 ፤ ደግሞ ኢያሱና ባኒ፥ ሰራብያ፥ ያሚን፥ ዓቁብ፥ ሳባታይ፥ ሆዲያ፥ መዕሤያ፥ ቆሊጣስ፥ ዓዛርያስ፥ ዮዛባት፥ ሐናን፥ ፌልያ፥ ሌዋውያኑም ሕጉን ያስተውሉ ዘንድ ሕዝቡን ያስተምሩ ነበር፤ ሕዝቡም በየስፍራቸው ቆመው ነበር።\n" +
                "8 ፤ የእግዚአብሔርንም ሕግ መጽሐፍ አነበቡ፤ ዕዝራም እግዚአብሔርን ማወቅ ያስተምርና ያስታውቅ ነበር፥ ሕዝቡም የሚነበበውን ያስተውሉ ነበር።\n" +
                "9 ፤ ሐቴርሰታ ነህምያም ጸሐፊውም ካህኑ ዕዝራ ሕዝቡንም የሚያስተምሩ ሌዋውያን ሕዝቡን ሁሉ። ዛሬ ለአምላካችን ለእግዚአብሔር የተቀደሰ ቀን ነው፤ አታልቅሱ እንባም አታፍስሱ አሉአቸው፤ ሕዝቡ ሁሉ የሕጉን ቃል በሰሙ ጊዜ ያለቅሱ ነበርና።\n" +
                "10 ፤ እርሱም። ሂዱ፥ የሰባውንም ብሉ፥ ጣፋጩንም ጠጡ፥ ለእነዚያም ላልተዘጋጀላቸው እድል ፈንታቸውን ስደዱ፤ ዛሬ ለጌታችን የተቀደሰ ቀን ነው፤ የእግዚአብሔርም ደስታ ኃይላችሁ ነውና አትዘኑ አላቸው።\n" +
                "11 ፤ ሌዋውያንም። ቀኑ የተቀደሰ ነውና ዝም በሉ፥ አትዘኑም ብለው ሕዝቡን ሁሉ ጸጥ ያደርጉ ነበር።\n" +
                "12 ፤ ሕዝቡም ሁሉ የተነገረላቸውን ቃል አስተውለዋልና ሊበሉና ሊጠጡ እድል ፈንታም ሊሰድዱ ደስታም ሊያደርጉ ሄዱ።\n" +
                "13 ፤ በሁለተኛውም ቀን ከሕዝቡ ሁሉ የአባቶች ቤቶች አለቆች ካህናቱም ሌዋውያኑም የሕጉን ቃል ይተረጕምላቸው ዘንድ ወደ ጸሐፊው ወደ ዕዝራ ተሰበሰቡ።\n" +
                "14 ፤\n" +
                "15 ፤ በሰባተኛውም ወር ባለው በዓል የእስራኤል ልጆች በዳስ ይቀመጡ ዘንድ በከተሞቻቸውና በኢየሩሳሌምም። ወደ ተራራ ሂዱ፤ የዘይትና የበረሀ ወይራ የባርሰነትም የዘንባባም የለመለመውን ዛፍ ቅርንጫፍ አምጡ፥ እንደ ተጻፈውም ዳሶችን ሥሩ ብለው ይናገሩ ያውጁም ዘንድ እግዚአብሔር በሙሴ እጅ እንዳዘዘ በሕጉ ውስጥ ተጽፎ አገኙ።\n" +
                "16 ፤ ሕዝቡም ወጥተው አመጡ፤ እያንዳንዱም በቤቱ ሰገነት ላይ፥ በአደባባዩም ላይ፥ በእግዚአብሔርም ቤት አደባባዩ ላይ፥ በውኃውም በር አደባባይና በኤፍሬም በር አደባባይ ላይ ዳስ ሠራ።\n" +
                "17 ፤ ከምርኮም የተመለሱት ማኅበር ሁሉ ዳስ ሠሩ፥ በዳሱም ውስጥ ተቀመጡ። ከነዌም ልጅ ከኢያሱ ዘመን ጀምሮ እስከዚያ ቀን ድረስ የእስራኤል ልጆች እንዲህ ያለ አላደረጉም ነበር። እጅግም ታላቅ ደስታ ሆነ።\n" +
                "18 ፤ ከመጀመሪያውም ቀን ጀምሮ እስከ መጨረሻው ቀን ድረስ ዕለት ዕለት የእግዚአብሔርን ሕግ መጽሐፍ ያነብብ ነበር። በዓሉን ሰባት ቀን ያህል አደረጉ፤ በስምንተኛውም ቀን እንደ ሕጉ የተቀደሰ ጉባኤ ነበረ።\n"));

        return new Chapter(8, verses);
    }

    private Chapter chapterNine() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ በዚህም ወር በሀያ አራተኛው ቀን የእስራኤል ልጆች ጾመው፥ ማቅም ለብሰው፥ በላያቸውም ትቢያ ነስንሰው ተከማቹ።\n" +
                "2 ፤ የእስራኤልም ዘር ከእንግዶች ሁሉ ራሳቸውን ለዩ፥ ቆመውም ኃጢአታቸውንና የአባቶቻቸውን ኃጢአት ተናዘዙ።\n" +
                "3 ፤ በየስፍራቸውም ቆመው የአምላካቸውን የእግዚአብሔርን የሕግ መጽሐፍ የቀን ሩብ ያህል አነበቡ፤ ሦስት የቀን ሩብም ያህል ተናዘዙ፥ ለአምላካቸው ለእግዚአብሔርም ሰገዱ።\n" +
                "4 ፤ ሌዋውያኑም ኢያሱና ባኒ፥ ቀድምኤል፥ ሰበንያ፥ ቡኒ፥ ሰራብያ፥ ባኒ፥ ክናኒ በደረጃዎች ላይ ቆመው ወደ አምላካቸው ወደ እግዚአብሔር በታላቅ ድምፅ ጮኹ።\n" +
                "5 ፤ ሌዋውያኑም ኢያሱ፥ ቀድምኤል፥ ባኒ፥ አሰበንያ፥ ሰራብያ፥ ሆዲያ፥ ሰበንያ፥ ፈታያ እንዲህ አሉ። ቆማችሁ ከዘላለም እስከ ዘላለም አምላካችንን እግዚአብሔርን ባርኩ። እንዲህም በሉ። በበረከትና በምስጋና ሁሉ ላይ ከፍ ከፍ ያለው ክቡር ስምህ ይባረክ።\n" +
                "6 ፤ አንተ ብቻ እግዚአብሔር ነህ፤ ሰማዩንና የሰማያት ሰማይን ሠራዊታቸውንም ሁሉ፥ ምድሩንና በእርስዋ ላይ ያሉትን ሁሉ፥ ባሕሮቹንና በእነርሱ ውስጥ ያለውን ሁሉ፥ ፈጥረሃል፥ ሁሉንም ሕያው አድርገኸዋል፤ የሰማዩም ሠራዊት ለአንተ ይሰግዳሉ።\n" +
                "7 ፤ አንተ እግዚአብሔር አምላክ ነህ፤ አብራምን መረጥህ፥ ከዑር ከላውዴዎንም አወጣኸው፥ ስሙንም አብርሃም አልኸው፤\n" +
                "8 ፤ ልቡም በፊትህ የታመነ ሆኖ አገኘኸው፤ የከነዓናዊውንና የኬጢያዊውን የአሞራዊውንም የፌርዛዊውንም የኢያቡሳዊውንም የጌርጌሳዊውንም ምድር ለእርሱና ለዘሩ ትሰጥ ዘንድ ከእርሱ ጋር ቃል ኪዳን አደረግህ አንተም ጻድቅ ነህና ቃልህን ፈጸምህ።\n" +
                "9 ፤ በግብጽም ሳሉ የአባታችንን መከራ አየህ፥ በኤርትራ ባሕርም ሳሉ ጩኸታቸውን ሰማህ፤\n" +
                "10 ፤ እንደ ታበዩባቸውም አውቀህ ነበርና በፈርዖንና በባሪያዎቹ ሁሉ በምድሩም ሕዝብ ሁሉ ላይ ምልክትና ተአምራት አሳየህ፤ ዛሬም እንደ ሆነው ስምህን አስጠራህ።\n" +
                "11 ፤ ከፊታቸውም ባሕሩን ከፈልህ፥ በባሕሩም መካከል በደረቅ አልፉ፤ ጠላቶቻቸውን ግን ድንጋይ ለጥልቅ ውኃ እንዲጣል በቀላይ ውስጥ ጣልሃቸው።\n" +
                "12 ፤ የሚሄዱበትንም መንገድ ታበራላቸው ዘንድ በቀን በደመና ዓምድ፥ በሌሊትም በእሳት ዓምድ መራሃቸው።\n" +
                "13 ፤ ወደ ሲናም ተራራ ወረድህ፥ ከሰማይም ተናገርሃቸው፤ ቅኑን ፍርድና እውነቱን ሕግ መልካሙንም ሥርዓትና ትእዛዝ ሰጠሃቸው፤\n" +
                "14 ፤ የተቀደሰውንም ሰንበትህን አስታወቅሃቸው፥ ትእዛዝንና ሥርዓትን ሕግንም በባሪያህ በሙሴ እጅ አዘዝሃቸው።\n" +
                "15 ፤ ለራባቸውም ከሰማይ እንጀራ ሰጠሃቸው፥ ለጥማታቸውም ከዓለቱ ውኃ አመጣህላቸው፤ ወደ ማልህላቸውም ምድር ገብተው ይወርሱ ዘንድ አዘዝሃቸው።\n" +
                "16 ፤ ነገር ግን እነርሱና አባቶቻችን ታበዩ፥ አንገታቸውንም አደንደኑ፥ ትእዛዝህንም አልሰሙም፥\n" +
                "17 ፤ ለመስማትም እንቢ አሉ፥ ያደረግህላቸውንም ተአምራት አላሰቡም፤ አንገታቸውንም አደንደኑ፥ በዓመፃቸውም ወደ ባርነታቸው ይመለሱ ዘንድ አለቃ አደረጉ፤ አንተ ግን ይቅር ባይ፥ ቸርና መሐሪ አምላክ፥ ለቍጣም የምትዘገይ፥ ምሕረትንም የምታበዛ ነህ፥ አልተውሃቸውም።\n" +
                "18 ፤ ቀልጦ የተሠራውንም እምቦሳ አድርገው። ከግብጽ ያወጣህ አምላክህ ይህ ነው ባሉ ጊዜ፥ እጅግም ባስቈጡህ ጊዜ፥\n" +
                "19 ፤ አንተ በምሕረትህ ብዛት በምድረ በዳ አልተውሃቸውም፤ በመንገድም ይመራቸው ዘንድ የደመና ዓምድ በቀን፥ የሚሄዱበትንም መንገድ ያበራላቸው ዘንድ የእሳት ዓምድ በሌሊት ከእነርሱ አልራቀም።\n" +
                "20 ፤ ያስተምራቸውም ዘንድ መልካሙን መንፈስህን ሰጠሃቸው፥ መናህንም ከአፋቸው አልከለከልህም፥ ለጥማታቸውም ውኃ ሰጠሃቸው።\n" +
                "21 ፤ አርባ ዓመትም በምድረ በዳ መገብሃቸው፥ ምንም አላጡም፤ ልብሳቸውም አላረጅም፥ እግራቸውም አላበጠም።\n" +
                "22 ፤ መንግሥታትንና አሕዛብን ከፍለህ ሰጠሃቸው፤ የሐሴቦንን ንጉሥ የሴዎንን ምድር፥ የባሳንንም ንጉሥ የዐግን ምድር ወረሱ።\n" +
                "23 ፤ ልጆቻቸውንም እንደ ሰማይ ከዋክብት አበዛህ፤ ይገቡና ይወርሱ ዘንድ ለአባቶቻቸው ወደ ተናገርህላቸውም ምድር አገባሃቸው።\n" +
                "24 ፤ ልጆቹም ገብተው ምድሩን ወረሱ፥ የምድሩን ሰዎች ከነዓናውያንን በፊታቸው አዋረድህ፤ የሚወድዱትንም ነገር ያደረጉባቸው ዘንድ እነርሱንና ነገሥታቶቻቸውን የምድሩንም አሕዛብ በእጃቸው አሳልፈህ ሰጠሃቸው።\n" +
                "25 ፤ ምሽጎቹንም ከተሞች የሰባውንም ምድር ወሰዱ፤ መልካሙን ነገር የሞሉትን ቤቶች፥ የተማሱትንም ጕድጓዶች፥ ወይኖቹንና ወይራዎቹን ብዙዎቹንም የፍሬ ዛፎች ወረሱ፤ በሉም፥ ጠገቡም፥ ወፈሩም፥ በታላቅ በጎነትህም ደስ አላቸው።\n" +
                "26 ፤ ነገር ግን እንቢተኞች ነበሩ፥ ዐመፁብህም፥ ሕግህንም ወደ ኋላቸው ጣሉት፤ ወደ አንተም ይመለሱ ዘንድ የመሰከሩባቸውን ነቢያትህን ገደሉ፥ እጅግም አስቈጡህ።\n" +
                "27 ፤ ስለዚህ ለጠላቶቻቸው እጅ አሳልፈህ ሰጠሃቸው፥ አስጨነቁአቸውም፤ በመከራቸውም ጊዜ ወደ አንተ ጮኹ፥ ከሰማይም ሰማሃቸው፤ እንደ ምሕረትህም ብዛት ከጠላቶቻቸው እጅ ያዳኑአቸውን ታዳጊዎችን ሰጠሃቸው።\n" +
                "28 ፤ ባረፉም ጊዜ ተመልሰው በፊትህ ክፉ አደረጉ፤ በጠላቶቻቸው እጅ ተውሃቸው፥ ገዙአቸውም፤ ተመልሰውም ወደ አንተ በጮኹ ጊዜ ከሰማይ ሰማሃቸው፥ እንደ ምሕረትህም ብዛት ታደግሃቸው፤\n" +
                "29 ፤ ወደ ሕግህም ትመልሳቸው ዘንድ አስመሰከርህባቸው፤ ነገር ግን ታበዩ፥ ትእዛዝህንም አልሰሙም፥ ሰውም ባደረገው ጊዜ በሕይወት የሚኖርበትን ፍርድህን ተላለፉ፤ ትከሻቸውንም ሰጡ፥ አንገታቸውን አደነደኑ፥ አልሰሙምም።\n" +
                "30 ፤ ነገር ግን ብዙ ዓመታት ታገሥሃቸው፥ በነቢያትህም እጅ በመንፈስህ መሰከርህባቸው፤ አላደመጡም፥ ስለዚህም በምድር አሕዛብ እጅ አሳልፈህ ሰጠሃቸው።\n" +
                "31 ፤ ነገር ግን አንተ ቸርና መሐሪ አምላክ ነህና በምሕረትህ ብዛት ፈጽመህ አላጠፋሃቸውም፥ አልተውሃቸውምም።\n" +
                "32 ፤ አሁንም አምላካችን ሆይ፥ ቃል ኪዳንንና ምሕረትን የምትጠብቅ ታላቅና ኃያል የተፈራኸውም አምላክ ሆይ፥ ከአሦር ነገሥታት ዘመን ጀምሮ እስከ ዛሬ ድረስ በእኛና በነገሥታቶቻችን በአለቆቻችንም በካህናቶቻችንም በነቢያቶቻችንም በአባቶቻችንም በሕዝብህ ሁሉ ላይ የደረሰው መከራ ሁሉ በፊትህ ጥቂት መስሎ አይታይህ።\n" +
                "33 ፤ በደረሰብንም ነገር ሁሉ አንተ ጻድቅ ነህ፥ አንተ እውነት አድርገሃልና፥ እኛም ኃጢአት አድርገናል።\n" +
                "34 ፤ ነገሥታቶቻችንም አለቆቻችንም ካህናቶቻችንም አባቶቻችንም ሕግህን አልጠበቁም፥ የመሰከርህባቸውንም ትእዛዝህንና ምስክርህን አልሰሙህም።\n" +
                "35 ፤ በመንግሥታቸውም በሰጠሃቸውም ታላቅ በጎነትህ፥ በፊታቸውም በሰጠኸው በሰባው ምድር አላመለኩህም፥ ከክፉም ሥራቸው አልተመለሱም።\n" +
                "36 ፤ እነሆ፥ ዛሬ ባሪያዎች ነን፤ ፍሬዋንና በረከትዋን ይበሉ ዘንድ ለአባቶቻችን በሰጠሃት ምድር፥ እነሆ፥ በእርስዋ ባሪያዎች ነን፥\n" +
                "37 ፤ ስለ ኃጢአታችንም ለሾምህብን ነገሥታት በረከትዋን ታበዛለች፤ ሰውነታችንንም ይገዛሉ፥ በእንስሶቻችንም የሚወድዱትን ያደርጋሉ፥ እኛም በጽኑ መከራ ላይ ነን።\n" +
                "38 ፤ ስለዚህም ሁሉ የታመነውን ቃል ኪዳን አድርገን እንጽፋለን፤ አለቆቻችንም ሌዋውያኖቻችንም ካህናቶቻችንም ያትሙበታል።\n"));

        return new Chapter(9, verses);
    }

    private Chapter chapterTen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ያተሙትም እነዚህ ናቸው፤ የሐካልያ ልጅ ሐቴርሰታ ነህምያ፥\n" +
                "2 ፤ ሴዴቅያስ፥ ሠራያ፥\n" +
                "3 ፤ ዓዛርያስ፥ ኤርምያስ፥ ፋስኮር፥ አማርያ፥ መልክያ፥\n" +
                "4 ፤\n" +
                "5 ፤ ሐጡስ፥ ሰበንያ፥ መሉክ፥ ካሪም፥\n" +
                "6 ሜሪሞት፥ አብድዩ፥ ዳንኤል፥ ጌንቶን፥ ባሮክ፥\n" +
                "7 ፤\n" +
                "8 ፤ ሜሱላም፥ አብያ፥ ሚያሚን፥ መዓዝያ፥ ቤልጋል፥ ሸማያ፤ እነዚህ ካህናት ነበሩ።\n" +
                "9 ፤ ሌዋውያኑም፤ የአዛንያ ልጅ ኢያሱ፥ ከኤንሐዳድ ልጆች ቢንዊ፥ ቀድምኤል፤\n" +
                "10 ፤ ወንድሞቻቸውም ሰባንያ፥ ሆዲያ፥ ቆሊጣስ፥\n" +
                "11 ፤ ፌልያ፥ ሐናን፥ ሚካ፥ ረአብ፥ ሐሸብያ፥\n" +
                "12 ፤\n" +
                "13 ፤ ዘኩር፥ ሰራብያ፥ ሰበንያ፥ ሆዲያ፥ ባኒ፥ ብኒኑ።\n" +
                "14 ፤ የሕዝቡ አለቆች፤ ፋሮስ፥ ፈሐት ሞዓብ፥\n" +
                "15 ፤ ኤላም፥ ዛቱዕ፥ ባኒ፥ ቡኒ፥ ዓዝጋድ፥ ቤባይ፥\n" +
                "16 ፤\n" +
                "17 ፤ አዶንያስ፥ በጉዋይ፥ ዓዲን፥ አጤር፥ ሕዝቅያስ፥\n" +
                "18 ፤ ዓዙር፥ ሆዲያ፥ ሐሱም፥ ቤሳይ፥\n" +
                "19 ፤\n" +
                "20 ፤ ሐሪፍ፥ ዓናቶት፥ ኖባይ፥ መግጲዓስ፥ ሜሱላም\n" +
                "21 ፤\n" +
                "22 ፤ ኤዚር፥ ሜሴዜቤል፥ ሳዶቅ፥ ያዱአ፥ ፈላጥያ፥\n" +
                "23 ፤ ሐናን፥ ዓናያ፥ ሆሴዕ፥ ሐናንያ፥ አሱብ፥\n" +
                "24 ፤\n" +
                "25 ፤ አሎኤስ፥ ፈልሃ፥ ሶቤቅ፥ ሬሁም፥ ሐሰብና፥\n" +
                "26 ፤\n" +
                "27 ፤ መዕሤያ፥ አኪያ፥ ሐናን፥ ዓናን፥ መሉክ፥ ካሪም፥ በዓና።\n" +
                "28 ፤ የቀሩትም ሕዝብ፥ ካህናቱም፥ ሌዋውያኑም፥ በረኞቹም፥ መዘምራንም፥ ናታኒምም፥ ከምድርም አሕዛብ ወደ እግዚአብሔር ሕግ ራሳቸውን የለዩ ሁሉ፥ ሚስቶቻቸውም፥ ወንዶችና ሴቶች ልጆቻቸውም፥ የሚያውቁትና የሚያስተውሉትም ሁሉ ወደ ወንድሞቻቸው ወደ ታላላቆቻቸው ተጠጉ፤\n" +
                "29 ፤ በእግዚአብሔርም ባሪያ በሙሴ እጅ በተሰጠው በእግዚአብሔር ሕግ ይሄዱ ዘንድ፥ የጌታችንንም የእግዚአብሔርን ትእዛዝ ሁሉ ፍርዱንም ሥርዓቱንም ይጠብቁና ያደርጉ ዘንድ እርግማንና መሐላውን አደረጉ።\n" +
                "30 ፤ ሴቶች ልጆቻችንንም ለምድር አሕዛብ አንሰጥም፥ ሴቶች ልጆቻቸውንም ለልጆቻችን አንወስድም፤\n" +
                "31 ፤ የምድርን አሕዛብ ሸቀጥና ልዩ ልዩ እህል ሊገበዩ በሰንበት ቀን ቢያመጡ፥ በሰንበት ወይም በተቀደሰው ቀን ከእነርሱ አንገዛም፤ የሰባተኛውንም ዓመት ፍሬና ዕዳን ማስከፈል እንተዋለን ብለው ማሉ።\n" +
                "32 ፤\n" +
                "33 ፤ ስለ አምላካችንም ቤት አገልግሎት፥ ስለ ገጸ ኅብስትም፥ ዘወትርም በሰንበትና በመባቻ ስለ ማቅረብ ስለ እህሉ ቍርባንና ስለሚቃጠል መሥዋዕት፥ ስለ በዓላትም፥ ስለ ተቀደሱትም ነገሮች፥ ለእስራኤልም ስለሚያስተሰርየው ስለ ኃጢአት መሥዋዕት፥ ስለ አምላካችንም ቤት ሥራ ሁሉ በየዓመቱ የሰቅል ሢሶ እናመጣ ዘንድ ትእዛዝ በራሳችን ላይ አደረግን።\n" +
                "34 ፤ እኛም፥ ካህናቱና ሌዋውያኑ ሕዝቡም፥ እንደ አባቶቻችን ቤቶች በተወሰነ ጊዜ በየዓመቱ ወደ አምላካችን ቤት አምጥተን በሕጉ እንደ ተጻፈ በአምላካችን በእግዚአብሔር መሠዊያ ላይ ይቃጠል ዘንድ ስለ እንጨት ቍርባን ዕጣ ተጣጣልን፤\n" +
                "35 ፤ በየዓመቱም የመሬታችንን በኵራት የሁሉ ዓይነት ዛፍ የፍሬ ሁሉ በኵራት ሁሉ ወደ እግዚአብሔር ቤት እናመጣ ዘንድ፥\n" +
                "36 ፤ በሕጉም እንደ ተጻፈ የልጆቻችንና የእንስሶቻችንን በኵራት፥ የበሬዎቻችንንና የበጎቻችንን በኵራት በአምላካችን ቤት ወደሚያገለግሉት ካህናት ወደ አምላካችን ቤት እናመጣ ዘንድ፥\n" +
                "37 ፤ የእህላችንንም በኵራት፥ የእጅ ማንሣታችንን ቍርባን፥ የዛፍ ሁሉ ፍሬ፥ ወይኑንና ዘይቱንም ወደ ካህናቱ ወደ አምላካችን ቤት ጓዳዎች እናመጣ ዘንድ፥ ሌዋውያኑም ከከተሞቻችን እርሻ ሁሉ አሥራት ይቀበላሉና የመሬታችንን አሥራት ወደ ሌዋውያን እናመጣ ዘንድ ማልን።\n" +
                "38 ፤ ሌዋውያኑም አሥራቱን በተቀበሉ ጊዜ የአሮን ልጅ ካህኑ ከሌዋውያን ጋር ይሁን፤ ሌዋውያኑም የአሥራቱን አሥራት ወደ አምላካችን ቤት ወደ ጓዳዎች ወደ ዕቃ ቤት ያምጡት።\n" +
                "39 ፤ የእስራኤል ልጆችና የሌዊ ልጆችም የእህሉንና የወይኑን የዘይቱንም የማንሣት ቍርባንን የመቅደሱ ዕቃዎችና የሚያገለግሉት ካህናት በረኞቹና መዘምራኑ ወዳሉባቸው ጓዳዎች ያግቡት፤ እንዲሁም የአምላካችንን ቤት ከቶ አንተውም።\n"));

        return new Chapter(10, verses);
    }
    private Chapter chapterEleven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ የሕዝቡም አለቆች በኢየሩሳሌም ተቀመጡ፤ ከቀሩትም ሕዝብ ከአሥሩ ክፍል አንዱ በቅድስቲቱ ከተማ በኢየሩሳሌም፥ ዘጠኙም በሌሎች ከተሞች ይቀመጡ ዘንድ ዕጣ ተጣጣሉ።\n" +
                "2 ፤ ሕዝቡም በፈቃዳቸው በኢየሩሳሌም ለመቀመጥ የወደዱትን ሰዎች ሁሉ ባረኩ።\n" +
                "3 ፤ በኢየሩሳሌምም የተቀመጡት የአገሩ አለቆች እነዚህ ናቸው፤ እስራኤል ግን ካህናቱም ሌዋውያኑም ናታኒምም የሰሎሞንም ባሪያዎች ልጆች እያንዳንዳቸው በየርስታቸውና በየከተማቸው በይሁዳ ከተሞች ተቀመጡ።\n" +
                "4 ፤ ከይሁዳና ከብንያምም ልጆች እነዚህ በኢየሩሳሌም ተቀመጡ። ከይሁዳ ልጆች፤ ከፋሬስ ልጆች የመላልኤል ልጅ የሰፋጥያስ ልጅ የአማርያ ልጅ የዘካርያስ ልጅ የዖዝያ ልጅ አታያ፤\n" +
                "5 ፤ የሴሎናዊውም ልጅ የዘካርያስ ልጅ የዮያሪብ ልጅ የዓዳያ ልጅ የዖዛያ ልጅ የኮልሖዜ ልጅ የባሮክ ልጅ መዕሤያ።\n" +
                "6 ፤ በኢየሩሳሌም የተቀመጡት የፋሬስ ልጆች ሁሉ አራት መቶ ስድሳ ስምንት ጽኑዓን ነበሩ።\n" +
                "7 ፤ የብንያምም ልጆች እነዚህ ናቸው፤ የየሻያ ልጅ የኢቲኤል ልጅ የመዕሤያ ልጅ የቆላያ ልጅ የፈዳያ ልጅ የዮእድ ልጅ የሜሱላም ልጅ ሰሉ።\n" +
                "8 ፤ ከእርሱም በኋላ ጌቤና ሳላይ ዘጠኝ መቶም ሀያ ስምንት።\n" +
                "9 ፤ አለቃቸውም የዝክሪ ልጅ ኢዮኤል ነበረ፤ የሐስኑአም ልጅ ይሁዳ በከተማው ላይ ሁለተኛ ነበረ።\n" +
                "10 ፤ ከካህናቱ፤ የዮያሪብ ልጅ ዮዳኤ፥ ያኪን፥\n" +
                "11 ፤ የእግዚአብሔርም ቤት አለቃ የአኪጦብ ልጅ የመራዮት ልጅ የሳዶቅ ልጅ የሜሱላም ልጅ የኪልቅያስ ልጅ ሠራያ፥\n" +
                "12 ፤ የቤቱንም ሥራ የሠሩ ወንድሞቻቸው ስምንት መቶ ሀያ ሁለት፤ የመልክያ ልጅ የፋስኮር ልጅ የዘካርያስ ልጅ የአማሲ ልጅ የፈላልያ ልጅ የይሮሐም ልጅ ዓዳያ፥\n" +
                "13 ፤ ወንድሞቹም የአባቶቹ ቤቶች አለቆች ሁለት መቶ አርባ ሁለት፤ የኢሜር ልጅ የምሺሌሞት ልጅ የአሕዛይ ልጅ የኤዝርኤል ልጅ አማስያ፥\n" +
                "14 ፤ ወንድሞቻቸውም መቶ ሀያ ስምንት ጽኑዓን ኃያላን፤ አለቃቸውም የሐግዶሊም ልጅ ዘብድኤል ነበረ።\n" +
                "15 ፤ ከሌዋውያንም፤ የቡኒ ልጅ የአሳብያ ልጅ የዓዝሪቃም ልጅ የአሱብ ልጅ ሻማያ፤\n" +
                "16 ፤ ከእግዚአብሔርም ቤት በሜዳ በነበረው ሥራ ላይ የነበሩ የሌዋውያን አለቆች ሳባታይና ዮዛባት፤\n" +
                "17 ፤ በጸሎትም ጊዜ ምስጋናን የሚቀነቅኑ አለቃው የአሳፍ ልጅ የዘብዲ ልጅ የሚካ ልጅ መታንያ፥ በወንድሞቹም መካከል ሁለተኛ የነበረ በቅበቃር፥ የኤዶታምም ልጅ የጋላል ልጅ የሳሙስ ልጅ አብድያ።\n" +
                "18 ፤ በቅድስቲቱ ከተማ የነበሩ ሌዋውያን ሁሉ ሁለት መቶ ሰማንያ አራት ነበሩ።\n" +
                "19 ፤ በሮቹንም የሚጠብቁ በረኞቹ፥ ዓቁብና ጤልሞን ወንድሞቻቸውም፥ መቶ ሰባ ሁለት ነበሩ።\n" +
                "20 ፤ ከእስራኤልም የቀሩት ከካህናትና ከሌዋውያንም እያንዳንዳቸው በየርስታቸው በይሁዳ ከተሞች ሁሉ ውስጥ ነበሩ።\n" +
                "21 ፤ ናታኒምም በዖፌል ተቀምጠው ነበር፤ ሲሐና ጊሽጳ በናታኒም ላይ ነበሩ።\n" +
                "22 ፤ በእግዚአብሔርም ቤት ሥራ ላይ ከነበሩ መዘምራን ከአሳፍ ልጆች ወገን የሚካ ልጅ የመታንያ ልጅ የሐሸብያ ልጅ የባኒ ልጅ ኦዚ በኢየሩሳሌም የሌዋውያን አለቃ ነበረ።\n" +
                "23 ፤ ስለ እነርሱም የንጉሥ ትእዛዝ ነበረ፤ የመዘምራኑም ሥርዓት ለየዕለቱ የተሠራ ነበረ።\n" +
                "24 ፤ ከይሁዳም ልጅ ከዛራ ወገን የሜሴዜቤል ልጅ ፈታያ ስለ ሕዝቡ ነገር ሁሉ በንጉሡ አጠገብ ነበረ።\n" +
                "25 ፤ ስለ መንደሮቹና ስለ እርሾቻቸው፤ ከይሁዳ ልጆች አያሌዎች በቂርያትአርባቅና በመንደሮችዋ፥ በዲቦንና በመንደሮችዋም፥ በይቀብጽኤልና በመንደሮችዋም፥\n" +
                "26 ፤\n" +
                "27 ፤ በኢያሱ፥ በሞላዳ፥ በቤትጳሌጥ፥ በሐጸርሹዓል፥\n" +
                "28 ፤ በቤርሳቤህና በመንደሮችዋ፥ በጺቅላግ፥\n" +
                "29 ፤ በምኮናና በመንደሮችዋ፥ በዓይንሪሞን፥\n" +
                "30 ፤ በጾርዓ፥ በየርሙት፥ በዛኖዋ በዓዶላም በመንደሮቻቸውም፥ በለኪሶና በእርሻዎችዋ፥ በዓዜቃና በመንደሮችዋ ተቀመጡ። እንዲሁ ከቤርሳቤህ ጀምሮ እስከ ሄኖም ሸለቆ ድረስ ሰፈሩ።\n" +
                "31 ፤ የብንያምም ልጆች ከጌባ ጀምሮ በማክማስ፥ በጋያ፥\n" +
                "32 ፤ በቤቴልና በመንደሮችዋ፥ በዓናቶት፥ በኖብ፥\n" +
                "33 ፤\n" +
                "34 ፤ በሐናንያ፥ በሐጾር፥ በራማ፥ በጊቴም፥ በሐዲድ፥\n" +
                "35 ፤ በስቦይም፥ በንበላት፥ በሎድ፥ በኦኖ፥ በጌሐራሺም ተቀመጡ።\n" +
                "36 ፤ በይሁዳም ከነበሩ ሌዋውያን አያሌ ክፍሎች ወደ ብንያም ሆኑ።\n"));

        return new Chapter(11, verses);
    }
    private Chapter chapterTwelve() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ከሰላትያል ልጅ ከዘሩባቤልና ከኢያሱ ጋር የወጡት ካህናትና ሌዋውያን እነዚህ ነበሩ፤\n" +
                "2 ፤ ሠራያ፥ ኤርምያስ፥ ዕዝራ፥ አማርያ፥\n" +
                "3 ፤ መሉክ፥ ሐጡስ፥ ሴኬንያ፥ ሬሁም፥ ሜሪሞት፥\n" +
                "4 ፤\n" +
                "5 ፤ አዶ፥ ጌንቶን፥ አብያ፥ ሚያሚን\n" +
                "6 ፤ መዓድያ፥ ቢልጋ፥ ሸማያ፥ ዮያሪብ፥ ዮዳኤ፥\n" +
                "7 ፤ ሰሉ፥ ዓሞቅ፥ ኬልቅያስ፥ ዮዳኤ፤ እነዚህ በኢያሱ ዘመን የካህናቱና የወንድሞቻቸው አለቆች ነበሩ።\n" +
                "8 ፤ ሌዋውያኑም፤ ኢያሱ፥ ቢንዊ፥ ቀድምኤል፥ ሰራብያ፥ ይሁዳ፥ ከወንድሞቹም ጋር በመዘምራን ላይ የነበረ መታንያ።\n" +
                "9 ፤ ወንድሞቻቸውም በቅቡቅያና ዑኒ በየሰሞናቸው በአንጻራቸው ነበሩ።\n" +
                "10 ፤ ኢያሱም ዮአቂምን ወለደ፥ ዮአቂምም ኤልያሴብን ወለደ፥ ኤልያሴብም ዮአዳን ወለደ፥\n" +
                "11 ፤ ዮአዳም ዮናታንን ወለደ፥ ዮናታንም ያዱአን ወለደ።\n" +
                "12 ፤ በዮአቂምም ዘመን የአባቶች ቤቶች አለቆች እነዚህ ካህናቱ ነበሩ፤ ከሠራያ ምራያ፥\n" +
                "13 ፤ ከኤርምያስ ሐናንያ፥ ከዕዝራ ሜሱላም፥\n" +
                "14 ፤ ከአማርያ ይሆሐናን፥ ከመሉኪ ዮናታን፥\n" +
                "15 ፤ ከሰበንያ ዮሴፍ፥ ከካሪም ዓድና፥ ከመራዮት ሔልቃይ፥\n" +
                "16 ፤ ከአዶ ዘካርያስ፥ ከጌንቶን ሜሱላም፥\n" +
                "17 ፤ ከአብያ ዚክሪ፥ ከሚያሚን ሞዓድያ፥\n" +
                "18 ፤ ፈልጣይ፥ ከቢልጋ ሳሙስ፥ ከሸማያ ዮናታን፥\n" +
                "19 ፤ ከዮያሪብ መትናይ፥ ከዮዳኤ ኦዚ፥\n" +
                "20 ፤ ከሳላይ ቃላይ፥ ከዓሞቅ ዔቤር፥\n" +
                "21 ፤ ከኬልቅያስ ሐሸብያ፥ ከዮዳኤ ናትናኤል።\n" +
                "22 ፤ ከሌዋውያኑም በኤልያሴብና በዮአዳ፥ በዮሐናንና በያዱአ ዘመን የአባቶች ቤቶች አለቆች ተጻፉ፤ ካህናቱም በፋርሳዊው በዳርዮስ መንግሥት ዘመን ተጻፉ።\n" +
                "23 ፤ የሌዊ ልጆች የአባቶች ቤቶች አለቆች እስከ ኤልያሴብ ልጅ እስከ ዮሐናን ዘመን ድረስ በታሪክ መጽሐፍ ተጻፉ።\n" +
                "24 ፤ የሌዋውያኑም አለቆች፤ ሐሸብያ፥ ሰራብያ፥ የቀድምኤልም ልጅ ኢያሱ እንደ እግዚአብሔር ሰው እንደ ዳዊት ትእዛዝ በየሰሞናቸው በወንድሞቻቸው ፊት ለፊት ያከብሩና ያመሰግኑ ነበር።\n" +
                "25 ፤ መታንያ፥ በቅቡቅያ፥ አብድዮ፥ ሜሱላም፥ ጤልሞን፥ ዓቁብ በበሮች አጠገብ የሚገኙትን ዕቃ ቤቶች ለመጠበቅ በረኞች ነበሩ።\n" +
                "26 ፤ እነዚህ በኢዮሴዴቅ ልጅ በኢያሱ ልጅ በዮአቂም በአለቃውም በነህምያ በጸሐፊውም በካህኑ በዕዝራ ዘመን ነበሩ።\n" +
                "27 ፤ የኢየሩሳሌምንም ቅጥር በቀደሱ ጊዜ ቅዳሴውን በደስታና በምስጋና በመዝሙርም በጸናጽልም በበገናም በመሰንቆም ለማድረግ ወደ ኢየሩሳሌም ያመጡአቸው ዘንድ ሌዋውያኑን በየስፍራቸው ሁሉ ፈለጉ።\n" +
                "28 ፤\n" +
                "29 ፤ መዘምራኑም በኢየሩሳሌም ዙሪያ መንደሮች ሠርተው ነበርና የመዘምራኑ ልጆች ከኢየሩሳሌም ዙሪያና ከነጦፋውያን መንደሮች፥ ከቤትጌልገላም፥ ከጌባና ከዓዝሞት እርሻዎች ተሰበሰቡ።\n" +
                "30 ፤ ካህናቱና ሌዋውያኑም ራሳቸውን አነጹ፤ ሕዝቡንም በሮቹንም ቅጥሩንም አነጹ።\n" +
                "31 ፤ የይሁዳንም አለቆች ወደ ቅጥሩ ላይ አወጣኋቸው፤ አመስጋኞቹንም በሁለት ታላላቅ ተርታ አቆምኋቸው፤ አንዱም ወደ ቀኝ በቅጥሩ ላይ ወደ ጕድፍ መጣያው በር ሄደ።\n" +
                "32 ፤ ከእነርሱም በኋላ ሆሻያ፥ የይሁዳም አለቆች እኵሌታ፥\n" +
                "33 ፤ ዓዛርያስ፥ ዕዝራ፥\n" +
                "34 ፤ ሜሱላም፥ ይሁዳ፥ ብንያም፥ ሸማያ፥ ኤርምያስ፥\n" +
                "35 ፤ መለከትም ይዘው ከካህናቱ ልጆች አያሌዎች፥ የአሳፍም ልጅ የዘኩር ልጅ የሚካያ ልጅ የመታንያ ልጅ የሸማያ ልጅ የዮናታን ልጅ ዘካርያስ፥\n" +
                "36 ፤ ወንድሞቹም ሸማያ፥ ኤዝርኤል፥ ሚላላይ፥ ጊላላይ፥ መዓይ፥ ናትናኤል፥ ይሁዳ፥ አናኒ የእግዚአብሔርን ሰው የዳዊትን የዜማውን ዕቃ ይዘው ሄዱ፤ ጸሐፊውም ዕዝራ በፊታቸው ነበረ።\n" +
                "37 ፤ በምንጭም በር አቅንተው ሄዱ፤ በዳዊትም ከተማ ደረጃ፥ በቅጥሩም መውጫ፥ ከዳዊትም ቤት በላይ እስከ ውኃው በር ድረስ በምሥራቅ በኩል ሄዱ።\n" +
                "38 ፤ ሁለተኛውም የአመስጋኞቹ ተርታ ወደ ግራ ሄደ፤ እኔና የሕዝቡም እኵሌታ በስተኋላቸው ነበርን፤ በቅጥሩም ላይ፥ በእቶኑ ግንብ በላይ እስከ ሰፊው ቅጥር ድረስ፥ ከኤፍሬምም በር በላይ፥\n" +
                "39 ፤ በአሮጌው በርና በዓሣ በር በሐናንኤልም ግንብ፥ በሃሜአ ግንብ እስከ በጎች በር ድረስ ሄዱ፤ በዘበኞችም በር አጠገብ ቆሙ።\n" +
                "40 ፤ እንዲሁ ሁለቱ የአመስጋኞች ተርታዎች በእግዚአብሔር ቤት ቆሙ፤ ከእነርሱም ጋር እኔና የአለቆች እኵሌታ፥\n" +
                "41 ፤ ካህናቱም ኤልያቄም፥ መዕሤያ፥ ሚንያሚን፥ ሚካያ፥ ኤልዮዔናይ፥\n" +
                "42 ፤ ዘካርያስ፥ ሐናንያ መለከት ይዘው፥ መዕሤያ፥ ሸማያ፥ አልዓዛር፥ ኦዚ፥ ይሆሐናን፥ መልክያ፥ ኤላም፥ ኤጽር ቆምን። መዘምራኑም በታላቅ ድምፅ ዘመሩ፥ አለቃቸውም ይዝረሕያ ነበረ።\n" +
                "43 ፤ እግዚአብሔርም በታላቅ ደስታ ደስ አሰኝቶአቸዋልና በዚያ ቀን ትልቅ መሥዋዕት አቀረቡ፥ ደስም አላቸው፤ ሴቶቹና ልጆቹም ደግሞ ደስ አላቸው፤ የኢየሩሳሌምም ደስታ ከሩቅ ተሰማ።\n" +
                "44 ፤ ይሁዳም በአገልጋዮቹ ካህናትና ሌዋውያን ደስ ስላላቸው፥ የካህናቱንና የሌዋውያኑን እድል ፈንታ እንደ ሕጉ ከከተሞች እርሻዎች ያከማቹ ዘንድ ለእጅ ማንሣት ቍርባንና ለበኵራት ለአሥራትም በየዕቃ ቤቶቹ ላይ በዚያ ቀን ሰዎች ተሾሙ።\n" +
                "45 ፤ እነርሱም መዘምራኑና በረኞቹም የአምላካቸውን ሥርዓት የመንጻታቸውንም ሥርዓት እንደ ዳዊትና እንደ ልጁ እንደ ሰሎሞን ትእዛዝ ጠበቁ።\n" +
                "46 ፤ አስቀድሞም በዳዊትና በአሳፍ ዘመን እግዚአብሔርን በዜማ ለማመስገንና ለማክበር የመዘምራን አለቆች ነበሩ።\n" +
                "47 ፤ እስራኤልም ሁሉ በዘሩባቤልና በነህምያ ዘመን ለመዘምራኑና ለበረኞቹ እድል ፈንታቸውን በየዕለቱ ይሰጡ ነበር፤ የተቀደሰውንም ነገር ለሌዋውያን ሰጡ፥ ሌዋውያኑም ከተቀደሰው ነገር ለአሮን ልጆች ሰጡ።\n"));

        return new Chapter(12, verses);
    }
    private Chapter chapterThirteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በዚያም ቀን የሙሴን መጽሐፍ በሕዝቡ ጆሮ አነበቡ፤ አሞናውያንና ሞዓባውያንም ወደ እግዚአብሔር ጉባኤ ለዘላለም እንዳይገቡ የሚል በዚያ ተገኘ።\n" +
                "2 ፤ የእስራኤልን ልጆች በእንጀራና በውኃ ስላልተቀበሉአቸውና ይረግማቸው ዘንድ በለዓምን ስለ ገዙባቸው ነው፤ ነገር ግን አምላካችን እርግማኑን ወደ በረከት መለሰው።\n" +
                "3 ፤ ሕጉንም በሰሙ ጊዜ ድብልቁን ሕዝብ ሁሉ ከእስራኤል ለዩ።\n" +
                "4 ፤ ከዚህም አስቀድሞ በአምላካችን ቤት ጓዳዎች ላይ ተሾሞ የነበረው ካህኑ ኤልያሴብ ከጦቢያ ጋር ተወዳጅቶ፥\n" +
                "5 ፤ ለሌዋውያን፥ ለመዘምራን፥ ለበረኞቹ እንደ ሕጉ የተሰጣቸውን የእህሉን ቍርባንና ዕጣኑን፥ ዕቃዎቹንም፥ የእህሉንና የወይኑን የዘይቱንም አሥራት፥ ለካህናቱም የሆነውን የማንሣት ቍርባን አስቀድሞ ያስቀመጡበትን ታላቁን ጓዳ አዘጋጅቶለት ነበር።\n" +
                "6 ፤ እኔ ግን በባቢሎን ንጉሥ በአርጤክስስ በሠላሳ ሁለተኛው ዓመት ወደ ንጉሡ ሄጄ ነበርና በዚህ ጊዜ በኢየሩሳሌም አልነበርሁም። ከጥቂት ዘመንም በኋላ የንጉሡን ፈቃድ ለመንሁ፤\n" +
                "7 ፤ ወደ ኢየሩሳሌምም መጣሁ፤ ኤልያሴብም በእግዚአብሔር ቤት አደባባይ ለጦብያ ጓዳውን በማዘጋጀት ያደረገውን ክፉ ነገር አስተዋልሁ።\n" +
                "8 ፤ እጅግም አስከፋኝ፤ የጦብያንም የቤቱን ዕቃ ሁሉ ከጓዳ ወደ ውጪ ጣልሁ።\n" +
                "9 ፤ ጓዳዎቹንም እንዲያነጹ አዘዝሁ፤ የእግዚአብሔርንም ቤት ዕቃዎች የእህሉንም ቍርባን ዕጣኑንም መልሼ በዚያ አገባሁ።\n" +
                "10 ፤ ለሌዋውያንም እድል ፈንታቸው እንዳልተሰጠ፥ የሚያገለግሉትም ሌዋውያንና መዘምራን እያንዳንዱ ወደ እርሻው እንደ ሄዱ ተመለከትሁ።\n" +
                "11 ፤ እኔም። የእግዚአብሔር ቤት ስለ ምን ተተወ? ብዬ ከአለቆቹ ጋር ተከራከርሁ። ሰበሰብኋቸውም፥ በየስፍራቸውም አቆምኋቸው።\n" +
                "12 ፤ ይሁዳም ሁሉ የእህሉንና የወይኑን የዘይቱንም አሥራት ወደ ዕቃ ቤቶች አመጡ።\n" +
                "13 ፤ በዕቃ ቤቶችም ላይ ካህኑን ሰሌምያን፥ ጸሐፊውንም ሳዶቅን፥ ከሌዋውያኑም ፈዳያን ሾምሁ፤ ከእነርሱም ጋር የመታንያ ልጅ የዘኩር ልጅ ሐናን ነበረ፤ እነርሱም የታመኑ ሆነው ተገኙ፥ ሥራቸውም ለወንድሞቻቸው ማከፋፈል ነበረ።\n" +
                "14 ፤ አምላኬ ሆይ፥ ስለዚህ አስበኝ፤ ለአምላኬም ቤት ያደረግሁትን ወረታዬን አታጥፋ።\n" +
                "15 ፤ በዚያም ወራት በይሁዳ በሰንበት ቀን የወይን መጥመቂያን የሚረግጡትን፥ ነዶም የሚከመሩትን፥ የወይኑን ጠጅና የወይኑን ዘለላ በለሱንም ልዩ ልዩም ዓይነት ሸክም በአህዮች ላይ የሚጭኑትን፥ በሰንበትም ቀን ወደ ኢየሩሳሌም የሚያስገቡትን አየሁ፤ ገበያ ባደረጉበትም ቀን አስመሰከርሁባቸው።\n" +
                "16 ፤ ደግሞም በእርስዋ የተቀመጡ የጢሮስ ሰዎች ነበሩ፤ እነርሱም ዓሣዎችን ልዩ ልዩም ዓይነት ሸቀጥ አምጥተው በሰንበት ቀን በኢየሩሳሌም ለይሁዳ ልጆች ይሸጡ ነበር።\n" +
                "17 ፤ ከይሁዳም ታላላቆች ጋር ተከራከርሁና። ይህ የምታደርጉት ክፉ ነገር ምንድር ነው? የሰንበትንስ ቀን ታረክሳላችሁን?\n" +
                "18 ፤ አባቶቻችሁ እንደዚህ አድርገው አልነበረምን? አምላካችንስ ይህን ክፉ ነገር ሁሉ በእኛና በዚህ ከተማ ላይ አምጥቶ አልነበረምን? እናንተም ሰንበትን በማርከሳችሁ በእስራኤል ላይ መዓትን ትጨምራላችሁ አልኋቸው።\n" +
                "19 ፤ ከዚህ በኋላ ከሰንበት በፊት በኢየሩሳሌም በሮች ድንግዝግዝታ በሆነ ጊዜ በሮችዋ እንዲዘጉ፥ ሰንበትም እስኪያልፍ ድረስ እንዳይከፈቱ አዘዝሁ። በሰንበትም ቀን ሸክም እንዳይገባ ከብላቴኖቼ በአያሌዎቹ በሮችዋን አስጠበቅሁ።\n" +
                "20 ፤ ሁሉም አንድ ወይም ሁለት ጊዜ በኢየሩሳሌም ውጭ አድረው ገበያ አድርገው ነበር።\n" +
                "21 ፤ እኔም አስመሰከርሁባቸውና። በቅጥሩ ውጭ ለምን ታድራላችሁ? እንደ ገና ብታደርጉት እጆቼን አነሣባችኋለሁ አልኋቸው። ከዚያም ወዲያ በሰንበት ቀን እንደ ገና አልመጡም።\n" +
                "22 ፤ ሌዋውያኑንም ራሳቸውን እንዲያነጹ፥ መጥተውም በሮቹን እንዲጠብቁ፥ የሰንበትንም ቀን እንዲቀድሱ ነገርኋቸው። አምላኬ ሆይ፥ ስለዚህ ደግሞ አስበኝ፥ እንደ ምሕረትህም ብዛት ራራልኝ።\n" +
                "23 ፤ ደግሞም በዚያ ወራት የአዛጦንና የአሞንን የሞዓብንም ሴቶች ያገቡትን አይሁድ አየሁ።\n" +
                "24 ፤ ከልጆቻቸውም እኵሌቶቹ በአዛጦን ቋንቋ ይናገሩ ነበር፥ በአይሁድም ቋንቋ መናገር አያውቁም ነበር።\n" +
                "25 ፤ ከእነርሱም ጋር ተከራከርሁ፥ ረገምኋቸውም፤ ከእነርሱም አያሌዎቹን መታሁ፥ ጠጉራቸውንም ነጨሁ፥ እንዲህም ብዬ በእግዚአብሔር አማልኋቸው። ሴቶች ልጆቻችሁን ለወንዶች ልጆቻቸው አትስጡ፥ ሴቶች ልጆቻቸውንም ለእናንተና ለልጆቻችሁ አትውሰዱ።\n" +
                "26 ፤ የእስራኤል ንጉሥ ሰሎሞን በዚህ ነገር ኃጢአት አድርጎ የለምን? በብዙ አሕዛብም መካከል እንደ እርሱ ያለ ንጉሥ አልነበረም፥ በአምላኩም ዘንድ የተወደደ ነበረ፥ እግዚአብሔርም በእስራኤል ሁሉ ላይ አንግሦት ነበር፤ እርሱንም እንኳ እንግዶች ሴቶች አሳቱት።\n" +
                "27 ፤ በውኑ ይህን ሁሉ ታላቅ ክፋት እንሠራ፥ እንግዶችንም ሴቶች በማግባት አምላካችን እንበድል ዘንድ እናንተን እንስማ?\n" +
                "28 ፤ ከዋነኛውም ካህን ከኤልያሴብ ልጅ ከዮአዳ ልጆች አንዱ ለሖሮናዊው ለሰንባላጥ አማች ነበረ፤ ከእኔም ዘንድ አባረርሁት።\n" +
                "29 ፤ አምላኬ ሆይ፥ ክህነትን የክህነትንና የሌዋውያንንም ቃል ኪዳን ስላፈረሱ አስባቸው።\n" +
                "30 ፤ ከእንግዳ ነገርም ሁሉ አነጻኋቸው፤ ለካህናቱና ለሌዋውያኑም እያንዳንዳቸው በየሰሞናቸው፥\n" +
                "31 ፤ በየጊዜያቸውም ለእንጨት ቍርባን ለበኵራቱም ሥርዓት አደረግሁ። አምላኬ ሆይ፥ በመልካም አስበኝ።\n"));

        return new Chapter(13, verses);
    }
}