package com.example.bibleapp.books.added;

import com.example.bibleapp.models.Book;
import com.example.bibleapp.models.Chapter;
import com.example.bibleapp.models.Verse;

import java.util.ArrayList;
import java.util.List;

public class TheBookofProverbs {
    private Book TheBookofProverbsBook;

    public TheBookofProverbs() {
        List<Chapter> chapters = new ArrayList<>();
        chapters.add(chapterOne());
        chapters.add(chapterTwo());
        chapters.add(chapterThree());
        chapters.add(chapterFour());
        chapters.add(chapterFive());
        chapters.add(chapterSix());
        chapters.add(chapterSeven());
        chapters.add(chapterEight());
        chapters.add(chapterNine());
        chapters.add(chapterTen());
        chapters.add(chapterEleven());
        chapters.add(chapterTwelve());
        chapters.add(chapterThirteen());
        chapters.add(chapterFourteen());
        chapters.add(chapterFifteen());
        chapters.add(chapterSixteen());
        chapters.add(chapterSeventeen());
        chapters.add(chapterEighteen());
        chapters.add(chapterNineteen());
        chapters.add(chapterTwenty());
        chapters.add(chapterTwentyOne());
        chapters.add(chapterTwentyTwo());
        chapters.add(chapterTwentyThree());
        chapters.add(chapterTwentyFour());
        chapters.add(chapterTwentyFive());
        chapters.add(chapterTwentySix());
        chapters.add(chapterTwentySeven());
        chapters.add(chapterTwentyEight());
        chapters.add(chapterTwentyNine());
        chapters.add(chapterThirty());
        chapters.add(chapterThirtyOne());



        TheBookofProverbsBook = new Book("መጽሐፈ ምሳሌ።", chapters);
    }

    public Book getTheBookofProverbsBook() {
        return TheBookofProverbsBook;
    }

    private Chapter chapterOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ የእስራኤል ንጉሥ የዳዊት ልጅ የሰሎሞን ምሳሌዎች፤\n" +
                "2 ጥበብንና ተግሣጽን ለማወቅ፥ የእውቀትንም ቃል ለማስተዋል፥\n" +
                "3 የጥበብን ትምህርት ጽድቅንና ፍርድን ቅንነትንም ለመቀበል፥\n" +
                "4 ብልሃትን ለአላዋቂዎች ይሰጥ ዘንድ ለጐበዛዝትም እውቀትንና ጥንቃቄን፥\n" +
                "5 ጠቢብ እነዚህን ከመስማት ጥበብን ይጨምራል፥ አስተዋይም መልካም ምክርን ገንዘቡ ያደርጋል።\n" +
                "6 ምሳሌንና ትርጓሜን የጠቢባንና ቃልና የተሸሸገውን ነገር ለማስተዋል።\n" +
                "7 የጥበብ መጀመሪያ እግዚአብሔርን መፍራት ነው፤ ሰነፎች ግን ጥበብንና ተግሣጽን ይንቃሉ።\n" +
                "8 ልጄ ሆይ፥ የአባትህን ምክር ስማ፥ የእናንትህንም ሕግ አትተው፤\n" +
                "9 ለራስህ የሞገስ ዘውድ ለአንገትህም ድሪ ይሆንልሃልና።\n" +
                "10 ልጄ ሆይ፥ ኃጢአተኞች ቢያባብሉህ እሺ አትበል።\n" +
                "11 ደምን ለማፍሰስ ለእኛ ጋር ና እናድባ፥ ለንጹሕም ያለ ምክንያት ወጥመድን እንሸምቅበት ቢሉ፤\n" +
                "12 በሕይወታቸው ሳሉ እንደ ሲኦል ሆነን እንዋጣቸው፥ በሙሉም ወደ ጕድጓድ እንደሚወድቁ ይሁኑ፤\n" +
                "13 መልካሙን ሀብት ሁሉ እናገኛለን፥ ከምርኮውም ቤታችንን እንሞላለን፤\n" +
                "14 ዕጣህን ከእኛ ጋር ጣል፤ ለሁላችንም አንድ ከረጢት ይሁን ቢሉ፤\n" +
                "15 ልጄ ሆይ፥ ከእነርሱ ጋር በመንገድ አትሂድ፥ ከጎዳናቸውም እግርህን ፈቀቅ አድርግ፤\n" +
                "16 እግሮቻቸው ወደ ክፋት ይሮጣሉና፥ ደም ለማፍሰስም ይፈጥናሉና።\n" +
                "17 መርበብ በወፎች ዓይን ፊት በከንቱ ትተከላለችና።\n" +
                "18 እነርሱም በደማቸው ላይ ያደባሉ፥ በነፍሳቸውም ላይ ይሸምቃሉ።\n" +
                "19 እንዲሁ ይህ መንገድ ትርፍን ለማግኘት የሚሳሳ ሁሉ ነው። የባለቤቱን ነፍስ ይነጥቃል።\n" +
                "20 ጥበብ በጎዳና ትጮኻለች፤ በአደባባይ ድምፅዋን ከፍ ታደርጋለች፤\n" +
                "21 በአደባባይ ትጣራለች፤ በከተማይቱ መግቢያ በር ቃልን ትናገራለች።\n" +
                "22 እናንተ አላዋቂዎች፥ እስከ መቼ አላዋቂነት ትወድዳላችሁ? ፌዘኞችም ፌዝን ይፈቅዳሉ? ሰነፎችም እውቀትን ይጠላሉ?\n" +
                "23 ወደ ዘለፋዬ ተመለሱ፤ እነሆ፥ መንፈሴን አፈስስላችኋለሁ፤ ቃሌን አስተምራችኋለሁ።\n" +
                "24 በጠራሁ ጊዜ እምቢ ስላላችሁ፥ እጄን በዘረጋሁ ጊዜ ማንም ስላላስተዋለ፥\n" +
                "25 ምክሬን ሁሉ ግን ቸል ስላላችሁ፥ ዘለፋዬንም ስላልፈቀዳችሁ፤\n" +
                "26 እኔም ስለዚህ በጥፋታችሁ እስቃለሁ፤ ጥፋታችሁም በመጣ ጊዜ አላግጥባችvሁ።\n" +
                "27 ድንጋጤ እንደ ጐርፍ በደረሰባችሁ ጊዜ፥ ጥፋታችሁም እንደ ዐውሎ ነፋስ በመጣ ጊዜ፥ ጭንቅና መከራ በወረደባችሁ ጊዜ።\n" +
                "28 የዚያን ጊዜ ይጠሩኛል፥ እኔ ግን አልመልስም፤ ተግተው ይሹኛል፥ ነገር ግን አያገኙኝም።\n" +
                "29 እውቀትን ጠልተዋልና፥ እግዚአብሔርንም መፍራት አልመረጡምና፤\n" +
                "30 ምክሬን አልፈቀዱምና፥ ዘለፋዬንም ሁሉ ንቀዋልና፤\n" +
                "31 ስለዚህ የመንገዳቸውን ፍሬ ይበላሉ፥ ከራሳቸው ምክር ይጠግባሉ።\n" +
                "32 አላዋቂዎችን ከጥበብ መራቅ ይገድላቸዋልና፥ ሰነፎችንም ቸልተኛ መሆን ያጠፋቸዋልና።\n" +
                "33 የሚሰማኝ ግን በእርጋታ ይቀመጣል፥ ከመከራም ሥጋት ያርፋል።\n"));
        // Add more verses as needed
        return new Chapter(1, verses);
    }

    private Chapter chapterTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ልጄ ሆይ፥ ቃሌን ብትቀበል፥ ትእዛዜንም በአንተ ዘንድ ሸሽገህ ብትይዛት፥\n" +
                "2 ጆሮህ ጥበብን እንዲያደምጥ ታደርጋለህ፥ ልብህንም ወደ ማስተዋል ታዘነብላለህ።\n" +
                "3 ረቂቅ እውቀትን ብትጠራት፥ ለማስተዋልም ድምፅህን ብታነሣ፥\n" +
                "4 እርስዋንም እንደ ብር ብትፈላልጋት፥ እርስዋንም እንደ ተቀበረ ገንዘብ ብትሻት፤\n" +
                "5 የዚያን ጊዜ እግዚአብሔርን መፍራት ታውቃለህ፥ የአምላክንም እውቀት ታገኛለህ።\n" +
                "6 እግዚአብሔር ጥበብን ይሰጣልና፤ ከአፉም እውቀትና ማስተዋል ይወጣሉ፤\n" +
                "7 እርሱ ለቅኖች ደኅንነትን ያከማቻል፤ ያለ ነውር ለሚሄዱትም ጋሻ ነው፤\n" +
                "8 የፍርድን ጎዳና ይጠብቃል፤ የቅዱሳኑንም መንገድ ያጸናል።\n" +
                "9 የዚያን ጊዜ ጽድቅንና ፍርድን ቅንነትንና መልካም መንገድን ሁሉ ታስተውላለህ።\n" +
                "10 ጥበብ ወደ ልብህ ትገባለችና፥ እውቀትም ነፍስህን ደስ ታሰኛለችና፤\n" +
                "11 ጥንቃቄ ይጠብቅሃል፥ ማስተዋልም ይጋርድሃል፥\n" +
                "12 ከክፉ መንገድ አንተን ለማዳን፥ ጠማማ ነገርን ከሚናገሩም ሰዎች፤\n" +
                "13 እነርሱም በጨለማ መንገድ ይሄዱ ዘንድ የቀናውን ጎዳና የሚተው፥\n" +
                "14 ክፉ በመሥራት ደስ የሚላቸው በጠማማነትም ደስታን የሚያደርጉ፥\n" +
                "15 መንገዳቸውን የሚጠመዝዙ አካሄዳቸውንም የሚያጣምሙ ናቸው፤\n" +
                "16 ከጋለሞታ ሴት አንተን ለመታደግ፥ ቃልዋን ከምታለዝብ ከሌላዪቱም ሴት፤\n" +
                "17 የሕፃንነት ወዳጅዋን የምትተው የአምላክዋንም ቃል ኪዳን የምትረሳ፤\n" +
                "18 ቤትዋ ወደ ሞት ያዘነበለ ነው፥ አካሄድዋም ወደ ሙታን ጥላ።\n" +
                "19 ወደ እርስዋ የሚገቡ ሁሉ አይመለሱም፥ የሕይወትንም ጎዳና አያገኙም፤\n" +
                "20 አንተም በደጋግ ሰዎች መንገድ እንድትሄድ የጻድቃንንም ጎዳና እንድትጠብቅ።\n" +
                "21 ቅኖች በምድር ላይ ይቀመጣሉና፥ ፍጹማንም በእርስዋ ይኖራሉና፤\n" +
                "22 ኃጥኣን ግን ከምድር ይጠፋሉ፥ ዓመፀኞችም ከእርስዋ ይነጠቃሉ።\n" ));
        // Add more verses as needed
        return new Chapter(2, verses);
    }

    private Chapter chapterThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ ልጄ ሆይ፥ ሕጌን አትርሳ፥ ልብህም ትእዛዛቴን ይጠብቅ።\n" +
                "2 ብዙ ዘመናትና ረጅም ዕድሜ ሰላምም ይጨምሩልሃልና።\n" +
                "3 ምሕረትና እውነት ከአንተ አይራቁ፤ በአንገትህ እሰራቸው፤ በልብህ ጽላት ጻፋቸው።\n" +
                "4 በእግዚአብሔርና በሰው ፊትም ሞገስንና መልካም ዝናን ታገኛለህ።\n" +
                "5 በፍጹም ልብህ በእግዚአብሔር ታመን፥ በራስህም ማስተዋል አትደገፍ፤\n" +
                "6 በመንገድህ ሁሉ እርሱን እወቅ፥ እርሱም ጎዳናህን ያቀናልሃል።\n" +
                "7 በራስህ አስተያየት ጠቢብ አትሁን፤ እግዚአብሔርን ፍራ፥ ከክፋትም ራቅ፤\n" +
                "8 ይህም ለሥጋህ ፈውስ ይሆንልሃል፥ ለአጥንትህም ጠገን።\n" +
                "9 እግዚአብሔርን ከሀብትህ አክብር፥ ከፍሬህም ሁሉ በኵራት፤\n" +
                "10 ጐተራህም እህልን ይሞላል፥ መጥመቂያህም በወይን ጠጅ ሞልታ ትትረፈረፋለች።\n" +
                "11 ልጄ ሆይ፥ የእግዚአብሔርን ተግሣጽ አትናቅ፥ በገሠጸህም ጊዜ አትመረር።\n" +
                "12 እግዚአብሔር የወደደውን ይገሥጻልና፥ አባት የሚወድደውን ልጁን እንደሚገሥጽ።\n" +
                "13 ጥበብን የሚያገኝ ሰው ምስጉን ነው፥ ማስተዋልንም ገንዘቡ የሚያደርግ፤\n" +
                "14 በወርቅና በብር ከመነገድ ይልቅ በእርስዋ መነገድ ይሻላልና።\n" +
                "15 ከቀይ ዕንቍም ትከብራለች፥ የተከበረም ነገር ሁሉ አይተካከላትም።\n" +
                "16 በቀኝዋ ረጅም ዘመን ነው፥ በግራዋም ባለጠግነትና ክብር።\n" +
                "17 መንገድዋ የደስታ መንገድ ነው፥ ጎዳናዋም ሁሉ ሰላም ነው።\n" +
                "18 እርስዋ ለሚይዙአት የሕይወት ዛፍ ናት፥ የተመረኰዘባትም ሁሉ ምስጉን ነው።\n" +
                "19 እግዚአብሔር በጥበብ ምድርን መሠረተ፥ በማስተዋልም ሰማያትን አጸና።\n" +
                "20 በእውቀቱ ቀላያት ተቀደዱ፥ ደመናትም ጠልን ያንጠባጥባሉ።\n" +
                "21 ልጄ ሆይ፥ እነዚህ ከዓይኖችህ አይራቁ፤ መልካም ጥበብንና ጥንቃቄን ጠብቅ።\n" +
                "22 ለነፍስህም ሕይወት ይሆናሉ፥ ለአንገትህም ሞገስ።\n" +
                "23 የዚያን ጊዜ መንገድህን ተማምነህ ትሄዳለህ፥ እግርህም አይሰነካከልም።\n" +
                "24 በተኛህ ጊዜ አትፈራም፤ ትተኛለህ፥ እንቅልፍህም የጣፈጠ ይሆንልሃል።\n" +
                "25 ድንገት ከሚያስፈራ ነገር፥ ከሚመጣውም ከኃጥኣን ጥፋት አትፈራም፤\n" +
                "26 እግዚአብሔር መታመኛህ ይሆናልና፥ እግርህም እንዳይጠመድ ይጠብቅሃልና።\n" +
                "27 ለተቸገረው ሰው በጎ ነገርን ማድረግ አትከልክል፥ ልታደርግለት የሚቻልህ ሲሆን።\n" +
                "28 ወዳጅህን። ሂድና ተመለስ፤ ነገ እሰጥሃለሁ አትበለው። በጎ ነገርን ማድረግ ሲቻልህ።\n" +
                "29 በወዳጅህ ላይ ክፉ አትሥራ፥ እርሱ ተማምኖ ከአንተ ጋር ተቀምጦ ሳለ።\n" +
                "30 ከሰው ጋር በከንቱ አትጣላ፥ እርሱ ክፉ ካልሠራብህ።\n" +
                "31 በግፈኛ ሰው አትቅና፥ መንገዱንም ሁሉ አትምረጥ።\n" +
                "32 ጠማማ ሁሉ በእግዚአብሔር ፊት ርኩስ ነውና፤ ወዳጅነቱ ግን ከቅኖች ጋር ነው።\n" +
                "33 የእግዚአብሔር መርገም በኃጥእ ቤት ነው፥ የጻድቃን ቤት ግን ይባረካል።\n" +
                "34 በፌዘኞች እርሱ ያፌዛል፥ ለትሑታን ግን ሞገስን ይሰጣል።\n" +
                "35 ጠቢባን ክብርን ይወርሳሉ፤ የሰነፎች ከፍታቸው ግን መዋረድ ነው።\n"));
        // Add more verses as needed
        return new Chapter(3, verses);
    }

    private Chapter chapterFour() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እናንተ ልጆች፥ የአባትን ተግሣጽ ስሙ፥ ማስተዋልንም ታውቁ ዘንድ አድምጡ፤\n" +
                "2 መልካም ትምህርትን እሰጣችኋለሁና፤ ሕጌን አትተዉ።\n" +
                "3 እኔም አባቴን የምሰማ ልጅ ነበርሁና፥ በእናቴም ዘንድ እወደድ ነበር።\n" +
                "4 ያስተምረኝም ነበር እንዲህም ይለኝ ነበር። ልብህ ቃሌን ይቀበል፤ ትእዛዜን ጠብቅ በሕይወትም ትኖራለህ።\n" +
                "5 ጥበብን አግኝ፤ ማስተዋልን አግኝ፤ አትርሳም፥ ከአፌም ቃል ፈቀቅ አትበል።\n" +
                "6 አትተዋት፥ ትደግፍህማለች፤ ውደዳት፥ ትጠብቅህማለች።\n" +
                "7 ጥበብ ዓይነተኛ ነገር ናትና ጥበብን አግኝ፤ ከሀብትህም ሁሉ ማስተዋልን አትርፍ።\n" +
                "8 ከፍ ከፍ አድርጋት፥ እርስዋም ከፍ ከፍ ታደርግሃለች፤ ብታቅፋትም ታከብርሃለች።\n" +
                "9 ለራስህ የሞገስ አክሊልን ትሰጥሃለች፥ የተዋበ ዘውድንም ታበረክትሃለች።\n" +
                "10 ልጄ ሆይ፥ ስማ፥ ንግግሬንም ተቀበል፤ የሕይወትህም ዘመን ትበዛልሃለች።\n" +
                "11 የጥበብን መንገድ አስተማርሁህ፤ በቀናች ጎዳና መራሁህ።\n" +
                "12 በሄድህ ጊዜ እርምጃህ አይጠብብም፤ በሮጥህም ጊዜ አትሰናከልም።\n" +
                "13 ተግሣጽን ያዝ፥ አትተውም፤ ጠብቀው፥ እርሱ ሕይወትህ ነውና።\n" +
                "14 በኃጥኣን መንገድ አትግባ፥ በክፉ ሰዎችም ጎዳና አትሂድ።\n" +
                "15 ከእርስዋ ራቅ፥ አትሂድባትም፤ ፈቀቅ በል ተዋትም።\n" +
                "16 ክፉ ካላደረጉ አይተኙምና፥ ካላሰናከሉም እንቅልፋቸው ይወገዳልና።\n" +
                "17 የኃጢአትን እንጀራ ይበላሉና፥ የግፍንም ወይን ጠጅ ይጠጣሉና።\n" +
                "18 የጻድቃን መንገድ ግን እንደ ንጋት ብርሃን ነው፥ ሙሉ ቀን እስኪሆንም ድረስ እየተጨመረ ይበራል።\n" +
                "19 የኃጥኣን መንገድ እንደ ጨለማ ነው፥ እንዴት እንደሚሰናከሉም አያውቁም።\n" +
                "20 ልጄ ሆይ፥ ንግግሬን አድምጥ ወደ ቃሌም ጆሮህን አዘንብል።\n" +
                "21 ከዓይንህ አታርቃት፥ በልብህም ውስጥ ጠብቃት።\n" +
                "22 ለሚያገኙአት ሕይወት፥ ለሥጋቸውም ሁሉ ፈውስ ነውና።\n" +
                "23 አጥብቀህ ልብህን ጠብቅ፥ የሕይወት መውጫ ከእርሱ ነውና።\n" +
                "24 የአፍህን ጠማማነት ከአንተ አውጣ፥ ሐሰተኞቹን ከንፈሮችም ከአንተ አርቅ።\n" +
                "25 ዓይኖችህ አቅንተው ይዩ፥ ሽፋሽፍቶችህም በቀጥታ ይመልከቱ።\n" +
                "26 የእግርህን መንገድ አቅና፥ አካሄድህም ሁሉ ይጽና።\n" +
                "27 ወደ ቀኝም ወደ ግራም አትበል፤ እግርህንም ከክፉ መልስ።\n"));
        // Add more verses as needed
        return new Chapter(4, verses);
    }
    private Chapter chapterFive() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ልጄ ሆይ፥ ወደ ጥበቤ አድምጥ፤ ጆሮህን ወደ ትምህርቴ መልስ፥\n" +
                "2 ጥንቃቄን ትጠብቅ ዘንድ ከንፈሮችህም እውቀትን እንዲጠብቁ።\n" +
                "3 ከጋለሞታ ሴት ከንፈር ማር ይንጠባጠባልና፥ አፍዋም ከቅቤ የለሰለሰ ነውና፤\n" +
                "4 ፍጻሜዋ ግን እንደ እሬት የመረረ ነው፥ ሁለት አፍ እንዳለው ሰይፍም የተሳለ ነው።\n" +
                "5 እግሮችዋ ወደ ሞት ይወርዳሉ፥ አረማመድዋም ወደ ሲኦል ነው፤\n" +
                "6 የቀና የሕይወትን መንገድ አታገኝም፤ በአካሄድዋ የተቅበዘበዘች ናት፥ የሚታወቅም አይደለም።\n" +
                "7 አሁንም ልጆቼ ሆይ፥ ስሙኝ፥ ከአፌም ቃል አትራቁ።\n" +
                "8 መንገድህን ከእርስዋ አርቅ፥ ወደ ቤትዋም ደጅ አትቅረብ፥\n" +
                "9 ክብርህ ለሌላ እንዳትሰጥ፥ ዕድሜህም ለጨካኝ፤\n" +
                "10 ሌሎች ከሀብትህ እንዳይጠግቡ፥ ድካምህም በባዕድ ሰው ቤት እንዳይሆን።\n" +
                "11 በመጨረሻም ሥጋህና ሰውነትህ በጠፋ ጊዜ ታለቅሳለህ፥\n" +
                "12 ትላለህም። እንዴት ትምህርትን ጠላሁ፥ ልቤም ዘለፋን ናቀ!\n" +
                "13 የአስተማሪዎቼንም ቃል አልሰማሁም፥ ጆሮቼንም ወደ አስተማሪዎቼ አላዘነበልሁም።\n" +
                "14 በማኅበርና በጉባኤ መካከል ወደ ክፉ ሁሉ ለመድረስ ጥቂት ቀረኝ።\n" +
                "15 ከጕድጓድህ ውኃ፥ ከምንጭህም የሚፈልቀውን ውኃ ጠጣ።\n" +
                "16 ምንጮችህ ወደ ሜዳ፥ ወንዞችህ ወደ አደባባይ፥ ይፈስሳሉን?\n" +
                "17 ለአንተ ብቻ ይሁኑ፥ ከአንተ ጋር ላሉ እንግዶችም አይሁኑ።\n" +
                "18 ምንጭህ ቡሩክ ይሁን፤ ከጕብዝናህም ሚስት ጋር ደስ ይበልህ።\n" +
                "19 እንደ ተወደደች ዋላ እንደ ተዋበችም ሚዳቋ፥ ጡትዋ ሁልጊዜ ታርካህ፥ በፍቅርዋም ሁልጊዜ ጥገብ።\n" +
                "20 ልጄ ሆይ፥ ስለ ምን ጋለሞታ ሴት ትወድዳለህ? የሌላይቱንስ ብብት ለምን ታቅፋለህ?\n" +
                "21 የሰው መንገድ በእግዚአብሔር ፊት ነውና፥ አካሄዱንም ሁሉ እርሱ ይመለከታልና።\n" +
                "22 ኃጥኣንን ኃጢአቱ ታጠምደዋለች፥ በኃጢአቱም ገመድ ይታሰራል።\n" +
                "23 አልተቀጣምና እርሱ ይሞታል፤ በስንፍናውም ብዛት ይስታል።\n"));

        return new Chapter(5, verses);
    }

    private Chapter chapterSix() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ልጄ ሆይ፥ ለጎረቤትህ ዋስ ብትሆን፥ ስለ ሌላ ሰው እጅህን አጋና ብትመታ፥\n" +
                "2 በአፍህ ቃል ተጠመድህ፤ በአፍህ ቃል ተያዝህ።\n" +
                "3 ልጄ ሆይ፥ ይህን አድርግ ራስህንም አድን፥ በጎረቤትህ እጅ ወድቀሃልና፤ ፈጥነህ ሂድ፥ ጎረቤትህንም ነዝንዘው።\n" +
                "4 ለዓይንህ እንቅልፍን ለሽፋሽፍቶችህም እንጕልቻን አትስጥ፥\n" +
                "5 እንደ ሚዳቋ ከአዳኝ እጅ፥ እንደ ወፍም ከአጥማጅ እጅ ትድን ዘንድ።\n" +
                "6 አንተ ታካች፥ ወደ ገብረ ጕንዳን ሂድ፥ መንገድዋንም ተመልክተህ ጠቢብ ሁን።\n" +
                "7 አለቃና አዛዥ ገዢም ሳይኖራት\n" +
                "8 መብልዋን በበጋ ታሰናዳለች፥ መኖዋንም በመከር ትሰበስባለች።\n" +
                "9 አንተ ታካች፥ እስከ መቼ ትተኛለህ? ከእንቅልፍህስ መቼ ትነሣለህ?\n" +
                "10 ጥቂት ትተኛለህ፥ ጥቂት ታንቀላፋለህ፥ ትተኛም ዘንድ ጥቂት እጅህን ታጥፋለህ፤\n" +
                "11 እንግዲህ ድህነትህ እንደ ወንበዴ፥ ችጋርህም ሰይፍ እንደ ታጠቀ ሰው ይመጣብሃል።\n" +
                "12 ምናምንቴ ሰው የበደለኛም ልጅ በጠማማ አፍ ይሄዳል፤\n" +
                "13 በዓይኑ ይጠቅሳል፥ በእግሩ ይናገራል፥ በጣቱ ያስተምራል፤\n" +
                "14 ጠማማነት በልቡ አለ፥ ሁልጊዜም ክፋትን ያስባል፤ ጠብንም ይዘራል።\n" +
                "15 ስለዚህ ጥፋቱ ድንገት ይደርስበታል፤ ድንገት ይደቅቃል፥ ፈውስም ከቶ የለውም።\n" +
                "16 እግዚአብሔር የሚጠላቸው ስድስት ነገሮች ናቸው፥ ሰባትንም ነፍሱ አጥብቃ ትጸየፈዋለች፤\n" +
                "17 ትዕቢተኛ ዓይን፥ ሐሰተኛ ምላስ፥ ንጹሕን ደም የምታፈስስ እጅ፥\n" +
                "18 ክፉ አሳብን የሚያበቅል ልብ፥ ወደ ክፉ የምትሮጥ እግር፥\n" +
                "19 በሐሰት የሚናገር ሐሰተኛ ምስክር በወንድማማች መካከልም ጠብን የሚዘራ።\n" +
                "20 ልጄ ሆይ፥ የአባትህን ትእዛዝ ጠብቅ፥ የእናትህንም ሕግ አትተው፤\n" +
                "21 ሁልጊዜም በልብህ አኑረው፥ በአንገትህም እሰረው።\n" +
                "22 ስትሄድም ይመራሃል፤ ስትተኛ ይጠብቅሃል፤ ስትነሣ ያነጋግርሃል።\n" +
                "23 ትእዛዝ መብራት፥ ሕግም ብርሃን ነውና፥ የተግሣጽም ዘለፋ የሕይወት መንገድ ነውና፥\n" +
                "24 ከክፉ ሴት ትጠብቅህ ዘንድ፥ ከሌላይቱም ሴት ምላስ ጥፍጥነት።\n" +
                "25 ውበትዋን በልብህ አትመኘው፤ ሽፋሽፍትዋም አያጥምድህ።\n" +
                "26 የጋለሞታ ዋጋ እስከ አንዲት እንጀራ ነው፤ አመንዝራም ሴት የሰውን ሕይወት ታጠምዳለች።\n" +
                "27 በጉያው እሳትን የሚታቀፍ፥ ልብሶቹስ የማይቃጠሉ ማን ነው?\n" +
                "28 በፍም ላይ የሚሄድ እግሮቹስ የማይቃጠሉ ማን ነው?\n" +
                "29 ወደ ሰው ሚስት የሚገባም እንዲሁ ነው፤ የሚነካትም ሁሉ ሳይቀጣ አይቀርም።\n" +
                "30 ሌባ በተራበ ጊዜ ነፍሱን ሊያጠግብ ቢሰርቅ ሰዎች አይንቁትም፤\n" +
                "31 ቢያዝም ሰባት እጥፍ ይከፍላል፥ በቤቱም ያለውን ሁሉ ይሰጣል።\n" +
                "32 ከሴት ጋር የሚያመነዝር ግን አእምሮው የጐደለ ነው፤ እንዲሁም የሚያደርግ ነፍሱን ያጠፋል።\n" +
                "33 ቍስልንና ውርደትን ያገኛል፥ ስድቡም አይደመሰስም።\n" +
                "34 ቅንዓት ለሰው የቍጣ ትኵሳት ነውና፥ በበቀል ቀን አይራራለትምና።\n" +
                "35 እርሱም ምንም ካሣ አይቀበልም፥ ስጦታም ብታበዛለት አይታረቅም።\n" ));

        return new Chapter(6, verses);
    }

    private Chapter chapterSeven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ልጄ ሆይ፥ ቃሌን ጠብቅ ትእዛዜንም በአንተ ዘንድ ሸሽግ።\n" +
                "2 ትእዛዜን ጠብቅ በሕይወትም ትኖራለህ፤ ሕጌንም እንደ ዓይንህ ብሌን ጠብቅ፤\n" +
                "3 በጣቶችህ እሰራቸው፤ በልብህ ጽላት ጻፋቸው።\n" +
                "4 ጥበብን። አንቺ እኅቴ ነሽ በላት፥ ማስተማውልንም። ወዳጄ ብለህ ጥራት፥\n" +
                "5 ከጋለሞታ ሴት ትጠብቅህ ዘንድ ቃልዋን ካለዘበች ከሌላይቱ ሴት።\n" +
                "6 በቤቴ መስኮት ሆኜ ወደ አደባባይ ተመለከትሁ፤\n" +
                "7 ከአላዋቂዎች መካከል አስተዋልሁ፤ ከጐበዛዝትም መካከል ብላቴናውን አእምሮ ጐድሎት አየሁ፥\n" +
                "8 በአደባባይ ሲሄድ በቤትዋም አቅራቢያ ሲያልፍ፤ የቤትዋን መንገድ ይዞ ወደ እርስዋ አቀና፥\n" +
                "9 ማታ ሲመሽ፥ ውድቅትም ሲሆን፥ በሌሊትም በጽኑ ጨለማ።\n" +
                "10 እነሆ፥ ሴት ተገናኘችው የጋለሞታ ልብስ የለበሰች፥ ነፍሳትን ለማጥመድ የተዘጋጀች።\n" +
                "11 ሁከተኛና አባያ ናት፥ እግሮችዋም በቤትዋ አይቀመጡም፤\n" +
                "12 አንድ ጊዜ በጎዳና፥ አንድ ጊዜ በአደባባይ፥ በማዕዘኑም ሁሉ ታደባለች።\n" +
                "13 ያዘችውም ሳመችውም፤ ፊትዋም ያለ እፍረት ሆኖ እንዲህ አለችው።\n" +
                "14 መሥዋዕትንና የደኅንነት ቍርባንን ማቅረብ ነበረብኝ፤ ዛሬ ስእለቴን ፈጸምሁ።\n" +
                "15 ስለዚህ እንድገናኝህ፥ ፊትህንም በትጋት ለመሻት ወጥቻለሁ፥ አግኝቼሃለሁም።\n" +
                "16 በአልጋዬ ላይ ማለፊያ ሰርፍ ዘርግቼበታለሁ፥ የግብጽንም ሽመልመሌ ለሀፍ።\n" +
                "17 በመኝታዬ ከርቤንና ዓልሙን ቀረፋም ረጭቼበታለሁ።\n" +
                "18 ና፥ እስኪነጋ ድረስ በፍቅር እንርካ፥ በተወደደ መተቃቀፍም ደስ ይበለን።\n" +
                "19 ባለቤቴ በቤቱ የለምና፥ ወደ ሩቅ መንገድ ሄዶአልና፤\n" +
                "20 በእጁም የብር ከረጢት ወስዶአል፤ ሙሉ ጨረቃ በሆነች ጊዜ ወደ ቤቱ ይመለሳል።\n" +
                "21 በብዙ ጨዋታዋ እንዲስት ታደርገዋለች፤ በከንፈርዋ ልዝብነት ትጐትተዋለች።\n" +
                "22 እርሱ እንዲህ ስቶ ይከተላታል፥ በሬ ለመታረድ እንዲነዳ፥ ውሻም ወደ እስራት እንዲሄድ፥\n" +
                "23 ወፍ ወደ ወጥመድ እንደሚቸኩል፥ ለነፍሱ ጥፋት እንደሚሆን ሳያውቅ፥ ፍላጻ ጕበቱን እስኪሰነጥቀው ድረስ።\n" +
                "24 ልጆቼ ሆይ፥ አሁን እንግዲህ ስሙኝ ወደ አፌም ቃል አድምጡኝ።\n" +
                "25 ልብህ ወደ መንገድዋ አያዘንብል በጎዳናዋ አትሳት።\n" +
                "26 ወግታ የጣለቻቸው ብዙ ናቸውና፤ እርስዋም የገደለቻቸው እጅግ ብዙ ናቸው።\n" +
                "27 ቤትዋ የሲኦል መንገድ ነው፤ ወደ ሞት ማጀት የሚወርድ ነው።\n"));

        return new Chapter(7, verses);
    }

    private Chapter chapterEight() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በውኑ ጥበብ አትጮኽምን? ማስተዋልስ ድምፅዋን አትሰጥምን?\n" +
                "2 በኮረብታ ላይ በመንገድ አጠገብ በጎዳና መካከል ትቆማለች።\n" +
                "3 በበሩ አጠገብ በከተማይቱም መግቢያ፥ በደጁ መግቢያ ትጮኻለች።\n" +
                "4 እናንተ ሰዎች፥ እናንተን እጠራለሁ፥ ድምፄም ወደ ሰዎች ልጆች ነው።\n" +
                "5 እናንተ አላዋቂዎች፥ ብልሃትን አስተውሉ፤ እናንተም ሰነፎች ጥበብን በልባችሁ ያዙ።\n" +
                "6 የከበረች ነገርን እናገራለሁና ስሙ፤ ከንፈሮቼም ቅን ነገርን ለመናገር ይከፈታሉ።\n" +
                "7 አፌ እውነትን ይናገራልና፥ ከንፈሮቼም ክፋትን ይጸየፋሉ።\n" +
                "8 የአፌ ቃላት ሁሉ ጽድቅ ናቸው፤ ጠማማ ዘወርዋራም አይደሉም።\n" +
                "9 እነርሱ በሚያስተውሉ ዘንድ የቀኑ ናቸው፥ እውቀትንም ካገኙአት ሰዎች ጋር የተስማሙ ናቸው።\n" +
                "10 ተግሣጼን እንጂ ብርን አትቀበሉ፥ ከምዝምዝ ወርቅም ይልቅ እውቀትን ተቀበሉ።\n" +
                "11 ጥበብ ከቀይ ዕንቍ ትበልጣለችና የከበረ ነገር ሁሉ አይተካከላትም።\n" +
                "12 እኔ ጥበብ በብልሃት ተቀምጫለሁ፥ እውቀትንም ጥንቃቄንም አግኝቻለሁ።\n" +
                "13 እግዚአብሔርን መፍራት ክፋትን ይጠላል፤ ትዕቢትንና እብሪትን ክፉንም መንገድ ጠማማውንም አፍ እጠላለሁ።\n" +
                "14 ምክርና መልካም ጥበብ የእኔ ነው፤ ማስተዋል እኔ ነኝ፥ ብርታትም አለኝ።\n" +
                "15 ነገሥታት በእኔ ይነግሣሉ፥ ሹማምቶችም የቀናውን ነገር ይደነግጋሉ።\n" +
                "16 አለቆች በእኔ ያዝዛሉ፥ ክቡራንና የምድር ፈራጆችም ሁሉ።\n" +
                "17 እኔ የሚወድዱኝን እወድዳለሁ፥ ተግተው የሚሹኝም ያገኙኛል።\n" +
                "18 ብልጥግናና ክብር በእኔ ዘንድ ነው፥ ብዙ ሀብትና ጽድቅም።\n" +
                "19 ፍሬዬም ከምዝምዝ ወርቅ ይሻላል፥ ቡቃያዬም ከተመረጠች ብር።\n" +
                "20 እኔ በጽድቅ መንገድ እሄዳለሁ፥ በፍርድም ጎዳና መካከል፥\n" +
                "21 ለሚወድዱኝ ርስት አወርሳቸው ዘንድ ቤተ መዛግብታቸውንም እሞላ ዘንድ።\n" +
                "22 እግዚአብሔር የመንገዱ መጀመሪያ አደረገኝ፥ በቀድሞ ሥራው መጀመሪያ።\n" +
                "23 ከጥንቱ ከዘላለም ጀምሮ ተሾምሁ፤ ምድር ከመፈጠርዋ አስቀድሞ።\n" +
                "24 ቀላያት ገና ሳይኖሩ እኔ ተወለድሁ፥ የውኃ ምንጮች ገና ሳይፈልቁ።\n" +
                "25 ተራሮች ገና ሳይመሠረቱ፥ ከኮረብቶች በፊት እኔ ተወለድሁ፥\n" +
                "26 ምድሪቱንና ሜዳውን ገና ሳይፈጥር፤ የመጀመሪያውን የዓለም አፈር።\n" +
                "27 ሰማዮችን በዘረጋ ጊዜ አብሬ ነበርሁ፥ በቀላያት ፊት ክበብን በደነገገ ጊዜ፥\n" +
                "28 ደመናትን በላይ ባዘጋጀ ጊዜ፥ የቀላይን ምንጮች ባጸና ጊዜ፥\n" +
                "29 ለባሕርም ዳርቻን በወሰነ ጊዜ ውኃ ከትእዛዙ እንዳያልፍ፥ የምድርን መሠረት በመሠረተ ጊዜ፥\n" +
                "30 የዚያን ጊዜ እኔ በእርሱ ዘንድ ዋና ሠራተኛ ነበርሁ፤ ዕለት ዕለት ደስ አሰኘው ነበርሁ፥ በፊቱም ሁልጊዜ ደስ ይለኝ ነበርሁ፥\n" +
                "31 ደስታዬም በምድሩ ተድላዬም በሰው ልጆች ነበረ።\n" +
                "32 አሁንም ልጆቼ ሆይ፥ ስሙኝ፤ መንገዴንም የሚጠብቁ ምስጉኖች ናቸው።\n" +
                "33 ትምህርቴን ስሙ፥ ጠቢባንም ሁኑ፥ ቸል አትበሉትም።\n" +
                "34 የሚሰማኝ ሰው ምስጉን ነው ዕለት ዕለት በቤቴ መግቢያ የሚተጋ፥ የደጄንም መድረክ የሚጠብቅ።\n" +
                "35 እኔን ያገኘ ሕይወትን ያገኛልና። ከእግዚአብሔርም ሞገስን ያገኛልና።\n" +
                "36 እኔን ያጣ ግን ራሱን ይጐዳል፤ የሚጠሉኝ ሁሉ ሞትን ይወድዳሉ።\n"));

        return new Chapter(8, verses);
    }

    private Chapter chapterNine() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ ጥበብ ቤትዋን ሠራች፥ ሰባቱንም ምሰሶችዋን አቆመች።\n" +
                "2 ፍሪዳዋን አረደች፥ የወይን ጠጅዋን ደባለቀች፥ ማዕድዋን አዘጋጀች።\n" +
                "3 ባሪያዎችዋን ልካ በከተማይቱ ከፍተኛ ስፍራ ላይ ጠራች።\n" +
                "4 አላዋቂ የሆነ ወደዚህ ፈቀቅ ይበል፤ አእምሮ የጐደላቸውንም እንዲህ አለች።\n" +
                "5 ኑ፥ እንጀራዬን ብሉ፥ የደባለቅሁትንም የወይን ጠጅ ጠጡ።\n" +
                "6 አላዋቂነትን ትታችሁ በሕይወት ኑሩ፥ በማስተዋልም መንገድ ሂዱ።\n" +
                "7 ፌዘኛን የሚገሥጽ ለራሱ ስድብን ይቀበላል፥ ኅጥአንም የሚዘልፍ ነውርን ያገኛል።\n" +
                "8 ፌዘኛን አትገሥጽ እንዳይጠላህ፤ ጠቢብን ገሥጽ ይወድድህማል።\n" +
                "9 ለጠቢብ ሰው ትምህርትን ስጠው፥ ጥበብንም ያበዛል፤ ጽድቅንም አስተምረው፥ እውቀትንም ያበዛል።\n" +
                "10 የጥበብ መጀመሪያ እግዚአብሔርን መፍራት ነው፤ ቅዱሱንም ማወቅ ማስተዋል ነው።\n" +
                "11 ዘመንህ በእኔ ይበዛልና፥ የሕይወትህም ዕድሜ ይጨመርልሃልና።\n" +
                "12 ጠቢብ ብትሆን ለራስህ ጠቢብ ትሆናለህ፥ ፌዘኛም ብትሆን ፌዘኛነትህን ለብቻህ ትሸከማለህ። ፍን [የሚቀጥለው ከግሪክ የተጨመረ ነው።] ልጄ ለራስህ አዋቂ ብትሆን ለባልንጀራህም አዋቂ ትሆናለህ፤ ለራስህ ክፉ ብትሆን ግን ክፋትህን ትማራለህ። ሐሰትን የሚያዘጋጅ ሰው ነፋሳትን እንደሚያዘጋጅ ሰው ነው፤ የሚበርር ወፍንም እንደሚከተል ይመስላል። የወይኑ ቦታ መንገዱን ተወ፤ የሚሠማራባትን መንገድ ዘነጋ፤ ወደ ምድረ በዳ ይሄዳል ለጥም ወደ ተሠራች አገር ይሄዳል፤ የማያፈራ የማይጠቅም ገንዘብንም በእጁ ይሰበስባል።\n" +
                "13 ሰነፍ ሴት ሁከተኛ ናት፤ አሳብ የላትም፥ አንዳችም አታውቅም።\n" +
                "14 በቤትዋ ደጅ በከተማይቱ ከፍተኛ ስፍራ በወንበር ላይ ትቀመጣለች፥\n" +
                "15 በመንገድ የሚያልፉትን አካሄዳቸውንም ያቀኑትን ለመጥራት።\n" +
                "16 አላዋቂ የሆነ ወደዚህ ፈቀቅ ይበል፤ አእምሮ የጐደለውንም እንዲህ አለች።\n" +
                "17 የስርቆት ውኃ ይጣፍጣል፥ የተሸሸገም እንጀራ ደስ ያሰኛል።\n" +
                "18 ነገር ግን እርሱ ሙታን ከዚያ እንዳሉ፥ እድምተኞችዋም በሲኦል ጥልቀት እንዳሉ አያውቅም።\n"));

        return new Chapter(9, verses);
    }

    private Chapter chapterTen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ የሰሎሞን ምሳሌዎች። ጠቢብ ልጅ አባቱን ደስ ያሰኛል፤ ሰነፍ ልጅ ግን ለእናቱ ኀዘን ነው።\n" +
                "2 በኃጢአት የተገኘ መዝገብ ጥቅም የለውም፤ ጽድቅ ግን ከሞት ያድናል።\n" +
                "3 እግዚአብሔር የጻድቁን ነፍስ አያስርብም፤ የኅጥኣንን ምኞት ግን ይገለብጣል።\n" +
                "4 የታካች እጅ ችግረኛ ታደርጋለች፤ የትጉ እጅ ግን ባለጠጋ ታደርጋለች።\n" +
                "5 በበጋ የሚያከማች ልጅ አስተዋይ ነው፤ በመከር የሚተኛ ግን እርሱ ራሱን ያስነውራል።\n" +
                "6 በረከት በጻድቅ ራስ ላይ ነው፤ የኅጥኣንን አፍ ግን ግፍ ይከድነዋል።\n" +
                "7 የጻድቅ መታሰቢያ ለበረከት ነው፤ የኅጥኣን ስም ግን ይጠፋል።\n" +
                "8 በልቡ ጠቢብ የሆነ ትእዛዝን ይቀበላል፤ በከንፈሩ የሚሰንፍ ግን ይወድቃል።\n" +
                "9 ያለ ነውር የሚሄድ ተማምኖ ይሄዳል፤ መንገዱን የሚያጣምም ግን ይታወቃል።\n" +
                "10 በዓይኑ የሚጠቅስ መከራን ያመጣል፤ ደፍሮ የሚገሥጽ ግን ሰላምን ያደርጋል።\n" +
                "11 የጻድቅ አፍ የሕይወት ምንጭ ናት፤ የኃጥኣንን አፍ ግን ግፍ ይከድነዋል።\n" +
                "12 ጥል ክርክርን ታስነሣለች፤ ፍቅር ግን ኃጢአትን ሁሉ ትከድናለች።\n" +
                "13 በብልሃተኛ ከንፈር ጥበብ ትገኛለች፤ በትር ግን አእምሮ ለጐደለው ሰው ጀርባ ነው።\n" +
                "14 ጠቢባን እውቀትን ይሸሽጋሉ፤ የሰነፍ አፍ ግን ለጥፋት ይቀርባል።\n" +
                "15 የባለጠጋ ሀብት ለእርሱ የጸናች ከተማ ናት፤ የድሆች ጥፋት ድህነታቸው ነው።\n" +
                "16 የጻድቅ ደመወዝ ለሕይወት ነው፤ የኃጥእ ፍሬ ግን ለኃጢአት ነው።\n" +
                "17 ተግሣጽን የሚጠብቅ በሕይወት መንገድ ይሄዳል፤ ዘለፋን የሚተው ግን ይስታል።\n" +
                "18 ጥልን የሚከድን ሐሰተኛ ከንፈር አለው፤ ሐሜትንም የሚገልጥ ሰነፍ ነው።\n" +
                "19 በቃል ብዛት ውስጥ ኃጢአት ሳይኖር አይቀርም፤ ከንፈሩን የሚገታ ግን አስተዋይ ነው።\n" +
                "20 የጻድቅ ምላስ የተፈተነ ብር ነው፤ የኅጥኣን ልብ ግን ምናምን ነው።\n" +
                "21 የጻድቅ ከንፈሮች ብዙ ሰዎችን ይመግባሉ፤ ሰነፎች ግን ከልባቸው ጕድለት የተነሣ ይሞታሉ።\n" +
                "22 የእግዚአብሔር በረከት ባለጠጋ ታደርጋለች፥ ኀዘንንም ከእርስዋ ጋር አይጨምርም።\n" +
                "23 ክፉ ነገር ማድረግ ለሰነፍ ሰው ጨዋታ ነው፤ እንዲሁም ጥበብ ለአስተዋይ ነው።\n" +
                "24 የኀጥእ ሰው ፍርሃት በላዩ ይመጣበታል፥ ለጻድቃንም ምኞታቸው ትሰጣቸዋለች።\n" +
                "25 ዐውሎ ነፋስ ሲያልፍ ኃጥእ አይገኝም፤ ጻድቅ ግን የዘላለም መሠረት ነው።\n" +
                "26 ሆምጣጤ ጥርስን፥ ጢስም ዓይንን እንደሚጐዳ፥ እንዲሁም ታካች ለላኩት።\n" +
                "27 እግዚአብሔርን መፍራት ዘመንን ታረዝማለች፤ የኀጥኣን ዕድሜ ግን ታጥራለች።\n" +
                "28 የጻድቃን አለኝታ ደስታ ነው፤ የኀጥኣን ተስፋ ግን ይጠፋል።\n" +
                "29 የእግዚአብሔር መንገድ ያለ ነውር ለሚሄድ አምባ ነው፥ ጥፋት ግን ክፋትን ለሚያደርጉ።\n" +
                "30 ጻድቃን ለዘላለም አይናወጡም፤ ኅጥኣን ግን በምድር ላይ አይቀመጡም።\n" +
                "31 የጻድቅ አፍ ጥበብን ይናገራል፤ ጠማማ ምላስ ግን ትቈረጣለች።\n" +
                "32 የጻድቅ ከንፈሮች ደስ የሚያሰኝ ነገርን ያውቃሉ፤ የኀጥኣን አፍ ግን ጠማማ ነው።\n"));

        return new Chapter(10, verses);
    }
    private Chapter chapterEleven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ አባይ ሚዛን በእግዚአብሔር ፊት አስጸያፊ ነው፤ እውነተኛ ሚዛን ግን ደስ ያሰኘዋል።\n" +
                "2 ትዕቢት ከመጣች ውርደት ትመጣለች፤ በትሑታን ዘንድ ግን ጥበብ ትገኛለች።\n" +
                "3 ቅኖች ቅንነታቸው ትመራቸዋለች፤ ወስላቶችን ግን ጠማማነታቸው ታጠፋቸዋለች።\n" +
                "4 በቍጣ ቀን ሀብት አትረባም፤ ጽድቅ ግን ከሞት ታድናለች።\n" +
                "5 የፍጹም ሰው ጽድቁ መንገዱን ያቀናለታል፤ ኃጥእ ግን በኃጢአቱ ይወድቃል።\n" +
                "6 ቅኖችን ጽድቃቸው ይታደጋቸዋል፤ ወስላቶች ግን በምኞታቸው ይጠመዳሉ።\n" +
                "7 ኀጥእ በሞተ ጊዜ ተስፋው ይቈረጣል፥ የኃያል አለኝታም ይጠፋል።\n" +
                "8 ጻድቅ ከጭንቀት ይድናል፥ ኀጥእም በእርሱ ፋንታ ይመጣል።\n" +
                "9 ዝንጉ ሰው በአፉ ባልንጀራውን ያጠፋል፤ ጻድቃን ግን በእውቀት ይድናሉ።\n" +
                "10 በጻድቃን ልማት ከተማ ደስ ይላታል፥ በኀጥኣንም ጥፋት እልል ትላለች።\n" +
                "11 በቅኖች በረከት ከተማ ከፍ ከፍ ትላለች፤ በኀጥኣን አፍ ግን ትገለበጣለች።\n" +
                "12 ወዳጁን የሚንቅ እርሱ አእምሮ የጐደለው ነው፤ አስተዋይ ግን ዝም ይላል።\n" +
                "13 ለሐሜት የሚሄድ ምሥጢሩን ይገልጣል፤ በመንፈስ የታመነ ግን ነገሩን ይሰውራል።\n" +
                "14 መልካም ምክር ከሌለ ዘንድ ሕዝብ ይወድቃል፤ በመካሮች ብዛት ግን ደኅንነት ይሆናል።\n" +
                "15 ለማያውቅ የሚዋስ ክፉ መከራን ይቀበላል፤ ዋስነትን የሚጠላ ግን ይድናል።\n" +
                "16 ሞገስ ያላት ሴት ክብርን ታገኛለች፥ ሀኬተኖችም ሀብትን ያገኛሉ።\n" +
                "17 ቸር ሰው ለራሱ መልካም ያደርጋል፤ ጨካኝ ግን ሥጋውን ይጐዳል።\n" +
                "18 የኀጥእ ሰው ሞያ ሐሰተኛ ነው፤ ጽድቅን የሚዘራ ግን የታመነ ዋጋ አለው።\n" +
                "19 በጽድቅ የሚጸና በሕይወት ይኖራል፤ ክፋትን የሚከተል ግን ለሞቱ ነው።\n" +
                "20 ልበ ጠማሞች በእግዚአብሔር ዘንድ አስጸያፊዎች ናቸው፤ በመንገዳቸው ፍጹማን የሆኑ ግን የተወደዱ ናቸው።\n" +
                "21 ክፉ ሰው እጅ በእጅ ሳይቀጣ አይቀርም፤ የጻድቃን ዘር ግን ይድናል።\n" +
                "22 የወርቅ ቀለበት በእርያ አፍንጫ እንደ ሆነ፥ ከጥበብ የተለየች ቆንጆ ሴትም እንዲሁ ናት።\n" +
                "23 የጻድቃን ምኞት በጎ ብቻ ነው፤ የኀጥኣን ተስፋ ግን መቅሠፍት ነው።\n" +
                "24 ያለውን የሚበትን ሰው አለ፥ ይጨመርለታልም፤ ያለ ቅጥ የሚነፍግ ሰውም አለ፥ ይደኸያልም።\n" +
                "25 የምትባረክ ነፍስ ትጠግባለች፥ የረካም እርሱ ደግሞ ይረካል።\n" +
                "26 እህልን የሚያስቀር ሰው በሕዝብ ዘንድ ይረገማል፤ በረከት ግን በሚሸጠው ራስ ላይ ነው።\n" +
                "27 መልካምን ተግቶ የሚሻ ደስታን ይፈልጋል፤ ክፉን በሚፈልግ ግን ክፉ ይመጣበታል።\n" +
                "28 በባለጠግነቱ የሚተማመን ሰው ይወድቃል ጻድቃን ግን እንደ ቅጠል ይለመልማሉ።\n" +
                "29 ቤቱን የሚያውክ ሰው ነፋስን ይወርሳል፥ ሰነፍም ለጠቢብ ተገዥ ይሆናል።\n" +
                "30 የጻድቅ ፍሬ የሕይወት ዛፍ ናት፥ ነፍሶችንም የሚሰበስብ እርሱ ጠቢብ ነው።\n" +
                "31 እነሆ፥ ጻድቅ በምድር ላይ ፍዳውን የሚቀበል ከሆነ፥ ይልቁንስ ኀጥእና ዓመፀኛ እንዴት ይሆናሉ!\n"));
        // Add more verses as needed
        return new Chapter(11, verses);
    }

    private Chapter chapterTwelve() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ተግሣጽን የሚወድድ እውቀትን ይወድዳል፤ ዘለፋን የሚጠላ ግን ደንቆሮ ነው።\n" +
                "2 ደኅና ሰው ከእግዚአብሔር ዘንድ ሞገስን ያገኛል፤ ተንኰለኛውን ሰው ግን ይቀሥፈዋል።\n" +
                "3 ሰውን ዓመፃ አያጸናውም፤ የጻድቃን ሥር ግን አይንቀሳቀስም።\n" +
                "4 ልባም ሴት ለባልዋ ዘውድ ናት፤ አሳፋሪ ሴት ግን በአጥንቱ ውስጥ እንደ ቅንቅን ናት።\n" +
                "5 የጻድቃን አሳብ ቅን ነው፤ የኃጥኣን ምክር ግን ተንኰል ነው።\n" +
                "6 የኃጥኣን ቃል ደምን ለማፍሰስ ትሸምቃለች፤ የቅኖች አፍ ግን ይታደጋቸዋል።\n" +
                "7 ኀጥኣን ይገለበጣሉ፥ ደግሞም አይገኙም፤ የጻድቃን ቤት ግን ጸንቶ ይኖራል።\n" +
                "8 ሰው በጥበቡ ይመሰገናል፤ ልቡ ጠማማ የሆነ ሰው ግን ይናቃል።\n" +
                "9 ለራሱ ባሪያ ሆኖ የተጠቃ ሰው እንጀራ ጐድሎት ራሱን ካከበረው ሰው ይሻላል።\n" +
                "10 ጻድቅ ሰው ለእንስሳው ነፍስ ይራራል፤ የኀጥኣን ምሕረት ግን ጨካኝ ነው።\n" +
                "11 ምድሩን የሚሠራ ሰው እንጀራ ይጠግባል፤ ለከንቱ ነገር የሚሮጥ ግን አእምሮ የጐደለው ነው።\n" +
                "12 የኅጥኣን ፈቃድ የክፉዎች ወጥመድ ናት፤ የጻድቃን ሥር ግን ፍሬን ያፈራል።\n" +
                "13 ክፉ ሰው በከንፈሩ ኃጢአት ይጠመዳል፤ ጻድቅ ግን ከመከራ ያመልጣል።\n" +
                "14 የሰው ነፍስ ከአፉ ፍሬ መልካም ነገርን ትጠግባለች፥ ሰውም እንደ እጁ ሥራ ዋጋውን ይቀበላል።\n" +
                "15 የሰነፍ መንገድ በዓይኑ የቀናች ናት፤ ጠቢብ ግን ምክርን ይሰማል።\n" +
                "16 የሰነፍ ቍጣ ቶሎ ይታወቃል፤ ብልህ ሰው ግን ነውርን ይሰውራል።\n" +
                "17 እውነተኛን ነገር የሚናገር ቅን ነገርን ያወራል፤ የሐሰት ምስክር ግን ተንኰልን ያወራል።\n" +
                "18 እንደሚዋጋ ሰይፍ የሚለፈልፍ ሰው አለ፤ የጠቢባን ምላስ ግን ጤና ነው።\n" +
                "19 የእውነት ከንፈር ለዘላለም ትቆማለች፤ ውሸተኛ ምላስ ግን ለቅጽበት ነው።\n" +
                "20 ክፉን በሚያስቡ ልብ ውስጥ ተንኰል አለ፤ በሰላም ለሚመክሩ ግን ደስታ አላቸው።\n" +
                "21 ጻድቅን መከራ አያገኘውም፤ ኀጥኣን ግን ክፋትን የተሞሉ ናቸው።\n" +
                "22 ውሸተኛ ከንፈር በእግዚአብሔር ዘንድ አሰጸያፊ ነው፤ እውነትን የሚያደርጉ ግን በእርሱ ዘንድ የተወደዱ ናቸው።\n" +
                "23 ብልህ ሰው እውቀትን ይሸሽጋል፤ የሰነፎች ልብ ግን ስንፍናን ያወራል።\n" +
                "24 የትጉ እጅ ትገዛለች፤ የታካች እጅ ግን ትገብራለች።\n" +
                "25 ሰውን የልቡ ኀዘን ያዋርደዋል፤ መልካም ቃል ግን ደስ ያሰኘዋል።\n" +
                "26 ጻድቅ ለባልንጀራው መንገዱን ያሳያል፤ የኀጥኣን መንገድ ግን ታስታቸዋለች።\n" +
                "27 ታካች ሰው አደን ምንም አያድንም፤ ለሰው የከበረ ሀብት ትጋት ነው።\n" +
                "28 በጽድቅ መንገድ ላይ ሕይወት አለ በጎዳናዋም ሞት የለም።\n" ));
        // Add more verses as needed
        return new Chapter(12, verses);
    }

    private Chapter chapterThirteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("13", "1 ፤ ባለ አእምሮ ልጅ የአባቱን ተግሣጽ ይሰማል። ፌዘኛ ግን ተግሣጽን አይሰማም።\n" +
                "2 ሰው ከአፉ ፍሬ መልካምን ይበላል፤ የዓመፀኞች ነፍስ ግን ግፍን ትሻለች።\n" +
                "3 አፉን የሚጠብቅ ነፍሱን ይጠብቃል፤ ከንፈሩን የሚያሞጠሙጥ ግን ጥፋትን ያገኘዋል።\n" +
                "4 የታካች ሰው ነፍስ ትመኛለች፤ አንዳችም አታገኝም፤ የትጉ ነፍስ ግን ትጠግባለች።\n" +
                "5 ጻድቅ ሐሰትን ይጠላል፤ ኀጥእ ግን ያሳፍራል ያስነውራልም።\n" +
                "6 በመንገዱ ያለ ነውር የሚሄደውን ጽድቅ ይጠብቀዋል፤ ኃጢአት ግን ኃጢአተኛውን ይጥለዋል።\n" +
                "7 ራሱን ባለጠጋ የሚያስመስል ሰው አለ፥ ነገር ግን አንዳች የለውም፤ ራሱን ድሀ የሚያስመስል አለ፥ ነገር ግን እጅግ ባለጠግነት አለው።\n" +
                "8 ለሰው ነፍስ ቤዛው ሀብቱ ነው፤ ድሀ ግን ተግሣጽን አይሰማም።\n" +
                "9 ሁልጊዜ ለጻድቃን ብርሃን ነው፤ የኀጥኣን መብራት ግን ይጠፋል።\n" +
                "10 በትዕቢት ጠብ ብቻ ይሆናል፤ ጥበብ ግን ምክርን በሚቀበሉ ዘንድ ናት።\n" +
                "11 በችኰላ የምትከማች ሀብት ትጐድላለች፤ ጥቂት በጥቂት የተከማቸች ግን ትበዛለች።\n" +
                "12 የምትዘገይ ተስፋ ልብን ታሳዝናለች፤ የተገኘች ፈቃድ ግን የሕይወት ዛፍ ናት።\n" +
                "13 ትእዛዝን የሚያቃልል በትእዛዝ ተይዞ ይጠፋል፤ ትእዛዝን የሚፈራ ግን በደኅንነት ይኖራል።\n" +
                "14 ሰው ከሞት ወጥመድ ያመልጥ ዘንድ የጠቢብ ሰው ትምህርት የሕይወት ምንጭ ነው።\n" +
                "15 መልካም እውቀት ሞገስን ይሰጣል፤ የወስላቶች መንገድ ግን ሸካራ ናት።\n" +
                "16 ብልህ ሁሉ በእውቀት ይሠራል፤ ሰነፍ ግን ስንፍናውን ይገልጣል።\n" +
                "17 መጥፎ መልእክተኛ በክፉ ላይ ይወድቃል፤ የታመነ መልእክተኛ ግን ፈውስ ነው።\n" +
                "18 ድህነትና ነውር ተግሣጽን ቸል ለሚሉ ነው፤ ዘለፋን የሚሰማ ግን ይከብራል።\n" +
                "19 የተፈጸመች ፈቃድ ሰውነትን ደስ ታሰኛለች፤ ሰነፎች ግን ከክፉ መራቅን ይጸየፋሉ።\n" +
                "20 ከጠቢባን ጋር የሚሄዱ ጠቢብ ይሆናል፤ የሰነፎች ባልንጀራ ግን ክፉ መከራን ይቀበላል።\n" +
                "21 ክፉ ነገር ኃጢአተኞችን ያሳድዳቸዋል፤ ጻድቃን ግን መልካሙን ዋጋ ይቀበላሉ።\n" +
                "22 ጻድቅ ሰው ለልጅ ልጆቹ ያወርሳል፤ የኃጢአተኛ ብልጥግና ግን ለጻድቅ ትጠበቃለች።\n" +
                "23 በድሆች እርሻ ላይ ብዙ ሲሳይ አለ፤ ከፍርድ መጕደል የተነሣ ግን ይጠፋል።\n" +
                "24 በበትር ከመምታት የሚራራ ሰው ልጁን ይጠላል፤ ልጁን የሚወድድ ግን ተግቶ ይገሥጻዋል።\n" +
                "25 ጻድቅ ሰውነቱ እስክትጠግብ ድረስ ይበላል፤ የኀጥኣን ሆድ ግን ይራባል።\n"));
        // Add more verses as needed
        return new Chapter(3, verses);
    }

    private Chapter chapterFourteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ብልሃተኛ ሴት ቤትዋን ትሠራለች፤ ሰነፍ ሴት ግን በእጅዋ ታፈርሰዋለች።\n" +
                "2 በቅን የሚሄድ ሰው እግዚአብሔርን ይፈራል፤ መንገዱን የሚያጣምም ግን ይንቀዋል።\n" +
                "3 በሰነፍ አፍ የትዕቢት በትር አለ፤ የጠቢባን ከንፈር ግን ትጠብቃቸዋለች።\n" +
                "4 በሬ በሌለበት ስፍራ እህል አይገኝም፤ ብዙ ሲሳይ ግን በበሬዎች ኃይል ነው።\n" +
                "5 የታመነ ምስክር አይዋሽም፤ የሐሰት ምስክር ግን በሐሰት ይናገራል።\n" +
                "6 ፌዘኛ ሰው ጥበብን ይፈልጋል አያገኛትም፤ ለአስተዋይ ግን እውቀትን ማግኘት አያስቸግረውም።\n" +
                "7 ከሰነፍ ሰው ፊት ራቅ፥ በእርሱ ዘንድ የእውቀትን ከንፈር አታገኝምና።\n" +
                "8 የብልህ ሰው ጥበብ መንገዱን ያስተውል ዘንድ ነው፤ የሰነፎች ስንፍና ግን ሽንገላ ነው።\n" +
                "9 ሰነፉ በኃጢአት ያፌዛል፤ በቅኖች መካከል ግን ቸርነት አለች።\n" +
                "10 የራሱን ኀዘን ልብ ያውቃል፤ ከደስታውም ጋር ሌላ ሰው አይገናኝም።\n" +
                "11 የኅጥኣን ቤት ይፈርሳል፤ የቅኖች ማደሪያ ግን ያብባል።\n" +
                "12 ለሰው ቅን የምትመስል መንገድ አለች ፍጻሜዋ ግን የሞት መንገድ ነው።\n" +
                "13 በሳቅ ደግሞ ልብ ያዝናል፥ የደስታም ፍጻሜ ልቅሶ ነው።\n" +
                "14 ልቡን ከጽድቅ የሚመልስ ሰው ከመንገዱ ፍሬ ይጠግባል፥ ጻድቅም ሰው ደግሞ በራሱ።\n" +
                "15 የዋህ ቃልን ሁሉ ያምናል፤ ብልህ ግን አካሄዱን ይመለከታል።\n" +
                "16 ጠቢብ ሰው ይፈራል ከክፉም ይሸሻል፤ ሰነፍ ግን ራሱን ታምኖ ይኰራል።\n" +
                "17 ቍጡ ሰው በስንፍና ይሠራል፤ አስተዋይ ግን ይታገሣል።\n" +
                "18 አላዋቂዎች ሰዎች ስንፍናን ይወርሳሉ፤ ብልሆች ግን እውቀትን እንደ ዘውድ ይጭናሉ።\n" +
                "19 ኃጢአተኞች በደጎች ፊት ይጐነበሳሉ፥ ኀጥኣንም በጻድቃን በር።\n" +
                "20 ድሀ በባልንጀራው ዘንድ የተጠላ ነው የባለጠጋ ወዳጆች ግን ብዙዎች ናቸው።\n" +
                "21 ባልንጀራውን የሚንቅ ይበድላል ለድሀ ግን የሚራራ ምስጉ ነው።\n" +
                "22 ክፉ የሚያደርጉ ይስታሉ፤ ምሕረትና እውነት ግን መልካምን ለሚያደርጉ ናቸው።\n" +
                "23 በድካም ሁሉ ልምላሜ ይገኛል፤ ብዙ ነገር በሚናገር ከንፈር ግን ድህነት ብቻ አለ።\n" +
                "24 የጠቢባን ዘውድ ባለጠግነታቸው ነው፤ የሰነፎች ስንፍና ግን ስንፍና ነው።\n" +
                "25 እውነተኛ ምስክር ነፍሶችን ያድናል፤ በሐሰት የሚናገር ግን ሸንጋይ ነው።\n" +
                "26 እግዚአብሔርን ለሚፈራ ጠንካራ መታመን አለው፥ ለልጆቹም መጠጊያ ይኖራል።\n" +
                "27 ሰው ከሞት ወጥመድ ያመልጥ ዘድን እግዚአብሔርን መፍራት የሕይወት ምንጭ ነው።\n" +
                "28 የንጉሥ ክብር በሕዝብ ብዛት ነው፤ በሰው ጥቂትነት ግን የገዥ ጥፋት አለ።\n" +
                "29 ለትግሥተኛ ሰው ብዙ ማስተዋል አለው፤ ቍጡ ግን ስንፍናውን ከፍ ከፍ ያደርጋል።\n" +
                "30 ትሑት ልብ የሥጋ ሕይወት ነው፤ ቅንዓት ግን አጥንትን ያነቅዛል።\n" +
                "31 ድሀን የሚያስጨንቅ ፈጣሪውን ይሰድባል፤ ለድሀ ምሕረትን የሚያደርግ ግን ያከብረዋል።\n" +
                "32 ኀጥእ በክፋቱ ይደፋል፤ ጻድቅ ግን በእውነቱ ይታመናል።\n" +
                "33 በአዋቂ ልብ ጥበብ ትቀመጣለች፤ በሰነፎች ውስጥ ግን አትታወቅም።\n" +
                "34 ጽድቅ ሕዝብን ከፍ ከፍ ታደርጋለች፤ ኃጢአት ግን ሕዝብን ታስነውራለች።\n" +
                "35 አስተዋይ አገልጋይ በንጉሥ ዘንድ ይወደዳል፤ በሚያሳፍር ላይ ግን ቍጣው ይሆናል።\n"));
        // Add more verses as needed
        return new Chapter(14, verses);
    }
    private Chapter chapterFifteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ የለዘበች መልስ ቍጣን ትመልሳለች ሸካራ ቃል ግን ቍጣን ታስነሣለች።\n" +
                "2 የጠቢባን ምላስ እውቀትን ያሳምራል፤ የሰነፎች አፍ ግን ስንፍናን ያፈልቃል።\n" +
                "3 የእግዚአብሔር ዓይኖች በስፍራ ሁሉ ናቸው፤ ክፉዎችንና ደጎችን ይመለከታሉ።\n" +
                "4 ፈዋሽ ምላስ የሕይወት ዛፍ ነው፤ የጠማማ ምላስ ግን ነፍስን ይሰብራል።\n" +
                "5 ሰነፍ የአባቱን ተግሣጽ ይንቃል፤ ዘለፋን የሚቀበል ግን አእምሮው የበዛ ነው።\n" +
                "6 በጻድቅ ሰው ቤት ብዙ ኃይል አለ፤ የኃጥእ ሰው መዝገብ ግን ሁከት ነው።\n" +
                "7 የጠቢባን ከንፈር እውቀትን ትዘራለች፤ የሰነፎች ልብ ግን እንዲህ አይደለም።\n" +
                "8 የኅጥኣን መሥዋዕት በእግዚአብሔር ዘንድ አስጸያፊ ነው፤ የቅኖች ጸሎት ግን በእርሱ ዘንድ የተወደደ ነው።\n" +
                "9 የኅጥኣን መንገድ በእግዚአብሔር ዘንድ አስጸያፊ ነው፤ እርሱ ግን ጽድቅን የሚከተል ይወድዳል።\n" +
                "10 ክፉ መቅሠፍት መንገድን በተወ ሰው ላይ ይመጣል፥ ዘለፋንም የሚጠላ ይሞታል።\n" +
                "11 ሲኦልና ጥፋት በእግዚአብሔር ፊት የታወቁ ናቸው፤ ይልቁንም የሰዎች ልብ የታወቀ ነው።\n" +
                "12 ፌዘኛ ሰው የሚዘልፈውን አይወድድም፥ ወደ ጠቢባንም አይሄድም።\n" +
                "13 ደስ ያለው ልብ ፊትን ያበራል፤ በልብ ኀዘን ግን ነፍስ ትሰበራለች።\n" +
                "14 የአዋቂ ልብ እውቀትን ይፈልጋል፤ የሰነፎች አፍ ግን በስንፍና ይሰማራል።\n" +
                "15 ልቡ የሚያዝን ሰው ዘመኑ ሁሉ የከፋች ናት፤ የልብ ደስታ ግን ሁልጊዜ እንደ ግብዣ ነው።\n" +
                "16 እግዚአብሔርን ከመፍራት ጋር ያለ ጥቂት ነገር ሁከት ካለበት ከብዙ መዝገብ ይሻላል።\n" +
                "17 የጐመን ወጥ በፍቅር መብላት የሰባ ፍሪዳን ጥል ባለበት ዘንድ ከመብላት ይሻላል።\n" +
                "18 ቍጡ ሰው ጠብን ያነሣሣል፤ ትዕግሥተኛ ሰው ግን ጸጥ ያሰኘዋል።\n" +
                "19 የታካች መንገድ እንደ እሾህ አጥር ናት፤ የጻድቃን መንገድ ግን የተደላደለች ናት።\n" +
                "20 ጠቢብ ልጅ አባቱን ደስ ያሰኛል፤ ሰነፍ ልጅ ግን እናቱን ይንቃል።\n" +
                "21 ልብ ለሌለው ሰው ስንፍና ደስታ ናት፤ አስተዋይ ግን አካሄዱን ያቀናል።\n" +
                "22 ምክር ከሌለች ዘንድ የታሰበው ሳይሳካ ይቀራል፤ መካሮች በበዙበት ዘንድ ግን ይጸናል።\n" +
                "23 ሰው በአፉ መልስ ደስ ይለዋል፤ ቃልም በጊዜው ምንኛ መልካም ነው!\n" +
                "24 በታች ካለው ከሲኦል ያመልጥ ዘንድ የሕይወት መንገድ አስተዋዩን ሰው ወደ ላይ ይወስደዋል።\n" +
                "25 እግዚአብሔር የትዕቢተኞች ቤት ይነቅላል፤ የባልቴትን ዳርቻ ግን ያጸናል።\n" +
                "26 የበደለኛ አሳብ በእግዚአብሔር ዘንድ አስጸያፊ ናት፤ ያማረ ቃል ግን ጥሩ ነው።\n" +
                "27 ትርፍ ለማግኘት የሚሳሳ ሰው የራሱን ቤት ያውካል፤ መማለጃን የሚጠላ ግን በሕይወት ይኖራል።\n" +
                "28 የጻድቅ ልብ መልሱን ያስባል የኅጥኣን አፍ ግን ክፋትን ያፈልቃል።\n" +
                "29 እግዚአብሔር ከኅጥኣን ይርቃል፤ የጻድቃንን ጸሎት ግን ይሰማል።\n" +
                "30 የዓይን ብርሃን ልብን ደስ ያሰኛል፥ መልካም ወሬም አጥንትን ያለመልማል።\n" +
                "31 የሕይወትን ተግሣጽ የሚሰማ ጆሮ በጠቢባን መካከል ይኖራል።\n" +
                "32 ተግሣጽን ቸል የሚል የራሱን ነፍስ ይንቃል፤ ዘለፋን የሚሰማ ግን አእምሮ ያገኛል።\n" +
                "33 እግዚአብሔርን መፍራት የጥበብ ትምህርት ነው፤ ትሕትናም ክብረትን ትቀድማለች።\n"));

        return new Chapter(15, verses);
    }

    private Chapter chapterSixteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ የልብ መዘጋጀት ከሰው ነው፤ የምላስ መልስ ግን ከእግዚአብሔር ዘንድ ነው።\n" +
                "2 የሰው መንገድ ሁሉ በዓይኖቹ ፊት ንጹሕ ነው፤ እግዚአብሔር ግን መንፈስን ይመዝናል።\n" +
                "3 ሥራህን ለእግዚአብሔር አደራ ስጥ፥ አሳብህም ትጸናለች።\n" +
                "4 እግዚአብሔር ሁሉን ለእርሱ ለራሱ ፈጠረ፥ ኀጥእን ደግሞ ለክፉ ቀን።\n" +
                "5 በልቡ የታበየ ሁሉ በእግዚአብሔር ዘንድ ርኩስ ነው፥ እጅ በእጅም ሳይቀጣ አይቀርም።\n" +
                "6 በምሕረትና በእውነት ኃጢአት ትሰረያለች፥ እግዚአብሔርንም በመፍራት ሰው ከክፋት ይመለሳል።\n" +
                "7 የሰው አካሄድ እግዚአብሔርን ደስ ያሰኘው እንደ ሆነ፤ በእርሱና በጠላቶቹ መካከል ስንኳ ሰላምን ያደርጋል።\n" +
                "8 በጽድቅ የሚገኝ ጥቂት ነገር በዓመፅ ከሚገኝ ከብዙ ትርፍ ይሻላል።\n" +
                "9 የሰው ልብ መንገዱ ያዘጋጃል፤ እግዚአብሔር ግን አካሄዱን ያቀናለታል።\n" +
                "10 የእግዚአብሔር ብይን በንጉሥ አፍ ነው፥ አፉም በፍርድ አይስትም።\n" +
                "11 እውነተኛ ሚዛንና መመዘኛ የእግዚአብሔር ናቸው፤ የከረጢት መመዘኛዎች ሁሉ የእርሱ ሥራ ናቸው።\n" +
                "12 ግፍን መሥራት በንጉሥ ዘንድ ጸያፍ ነገር ነው፥ ዙፋን በጽድቅ ይጸናልና።\n" +
                "13 የጽድቅ ከንፈር የነገሥታት ደስታ ናት፥ በቅን የሚናገር እርሱንም ይወድዱታል።\n" +
                "14 የንጉሥ ቍጣ እንደ ሞት መልእክተኛ ነው፤ ጠቢብ ሰው ግን ያቈላምጠዋል።\n" +
                "15 በንጉሥ ፊት ብርሃን ዘንድ ሕይወት አለ፥ መልካም ፈቃዱም እንደ በልግ ዝናብ ደመና ነው።\n" +
                "16 ጥበብን ማግኘት ምንኛ ከወርቅ ይሻላል! ማስተዋልንም ማግኘት ከብር ይልቅ የሚመረጥ ነው።\n" +
                "17 የቅኖች መንገድ ከክፋት መራቅ ነው፤ መንገዱን የሚጠብቅ ነፍሱን ይጠብቃታል።\n" +
                "18 ትዕቢት ጥፋትን፥ ኵሩ መንፈስም ውድቀትን ይቀድማል።\n" +
                "19 ከዕቡያን ጋር ምርኮ ከመካፈል ከትሑታን ጋር በተዋረደ መንፈስ መሆን ይሻላል።\n" +
                "20 ቃልን የሚያዳምጥ መልካም ነገርን ያገኛል፤ በእግዚአብሔር የታመነ ምስጉን ነው።\n" +
                "21 ልቡ ጠቢብ የሆነ አስተዋይ ይባላል፥ በከንፈሩም ጣፋጭ የሆነ ትምህርትን ያበዛል።\n" +
                "22 ገንዘብ ላደረገው ሰው እውቀት የሕይወት ምንጭ ነው፤ ስንፍና ግን የሰነፎች ቅጣት ነው።\n" +
                "23 የጠቢብ ልብ አፉን ያስተምራል፥ ለከንፈሩም ትምህርትን ይጨምራል።\n" +
                "24 ያማረ ቃል የማር ወለላ ነው፤ ለነፍስ ጣፋጭ ለአጥንትም ጤና ነው።\n" +
                "25 ለሰው ቅን የምትመስል መንገድ አለች፤ ፍጻሜዋ ግን የሞት መንገድ ነው።\n" +
                "26 የሠራተኛ ራብ ለእርሱ ይሠራል፥ አፉ ይጐተጕተዋልና።\n" +
                "27 ምናምንቴ ሰው ክፋትን ይምሳል፥ በከንፈሩም የሚቃጠል እሳት አለ።\n" +
                "28 ጠማማ ሰው ጥልን ይዘራል፤ ጆሮ ጠቢ ሰው የተማመኑትን ወዳጆች ይለያያል።\n" +
                "29 ግፈኛ ሰው ወዳጁን ያባብላል፥ መልካምም ወዳይደለ መንገድ ይመራዋል።\n" +
                "30 ዓይኑን የሚዘጋ ጠማማ አሳብን ያስባል፤ ከንፈሩን የሚነክስ ክፋትን ይፈጽማል።\n" +
                "31 የሸበተ ጠጕር የክብር ዘውድ ነው፥ እርሱም በጽድቅ መንገድ ይገኛል።\n" +
                "32 ትዕግሥተኛ ሰው ከኃያል ሰው ይሻላል፥ በመንፈሱም ላይ የሚገዛ ከተማ ከሚወስዱ ይበልጣል።\n" +
                "33 ዕጣ በጕያ ይጣላል፤ መደብዋ ሁሉ ግን ከእግዚአብሔር ዘንድ ነው።\n" ));

        return new Chapter(16, verses);
    }

    private Chapter chapterSeventeen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ጥል ባለበት ዘንድ እርድ ከሞላበት ቤት በጸጥታ ደረቅ ቍራሽ ይሻላል።\n" +
                "2 አስተዋይ ባሪያ ነውረኛውን ልጅ ይገዛል፥ በወንድማማች መካከልም ርስትን ይካፈላል።\n" +
                "3 ማቅለጫ ለብር፥ ከውር ለወርቅ ነው፤ እግዚአብሔር ግን ልብን ይፈትናል።\n" +
                "4 ክፉ ሰው የበደለኛን ከንፈር ይሰማል፤ ሐሰተኛም ወደ ተንኰለኛ ምላስ ያደምጣል።\n" +
                "5 በድሀ የሚያላግጥ ፈጣሪውን ይሰድባል፤ በጥፋትም ደስ የሚለው ሳይቀጣ አይቀርም።\n" +
                "6 የሽማግሌዎች አክሊል የልጅ ልጆች ናቸው፤ የልጆችም ክብር አባቶቻቸው ናቸው።\n" +
                "7 ለሰነፍ የኵራት አነጋገር አይገባውም፤ ይልቁንም ሐሰተኛ ከንፈር ለመኰንን አይገባውም።\n" +
                "8 ገንዘብ ባደረገው ፊት መማለጃ እንደ ተዋበ ዕንቍ ነው፥ ወደ ዞረበትም ስፍራ ሁሉ ሥራውን ያቀናል።\n" +
                "9 ኃጢአትን የሚከድን ሰው ፍቅርን ይሻል፤ ነገርን የሚደጋግም ግን የተማመኑትን ወዳጆቹን ይለያያል።\n" +
                "10 መቶ ግርፋት በሰነፍ ጠልቆ ከሚገባ ይልቅ ተግሣጽ በአስተዋይ ሰው ጠልቆ ወደ ልቡ ይገባል።\n" +
                "11 ክፉ ሰው ዓመፃን ብቻ ይሻል፤ ስለዚህ ጨካኝ መልአክ ይላክበታል።\n" +
                "12 ሰነፍን በስንፍናው ከመገናኘት ልጆችዋ የተነጠቁባትን ድብ መገናኘት ይሻላል።\n" +
                "13 በመልካም ፋንታ ክፉን የሚመልስ፥ ክፉ ነገር ከቤቱ አትርቅም።\n" +
                "14 የጠብ መጀመሪያ እንደ ውኃ አፈሳሰስ ነው፤ ስለዚህ ጠብ ሳይበረታ አንተ ክርክርን ተው።\n" +
                "15 ኀጥኡን የሚያጸድቅና በጻድቁ ላይ የሚፈርድ፥ ሁለቱ በእግዚአብሔር ዘንድ አስጸያፊዎች ናቸው።\n" +
                "16 በሰነፍ እጅ የጥበብ መግዣ ገንዘብ መኖሩ ስለ ምንድር ነው? ጥበብን ይገዛ ዘንድ አእምሮ የለውምና።\n" +
                "17 ወዳጅ በዘመኑ ሁሉ ይወድዳል፤ ወንድምም ለመከራ ይወለዳል።\n" +
                "18 አእምሮ የጐደለው ሰው አጋና ይመታል፥ በባልንጀራውም ፊት ይዋሳል።\n" +
                "19 ዓመፃን የሚወድድ ክርክርን ይወድዳል፤ ደጁንም ዘለግ የሚያደርግ ውድቀትን ይሻል።\n" +
                "20 ጠማማ ልብ ያለው መልካምን አያገኝም፥ ምላሱንም የሚገለብጥ በክፉ ላይ ይወድቃል።\n" +
                "21 ሰነፍን የሚወልድ ኀዘን ይሆንበታል፥ የደንቆሮ ልጅም አባት ደስ አይለውም።\n" +
                "22 ደስ ያላት ልብ መልካም መድኃኒት ናት፤ ያዘነች ነፍስ ግን አጥንትን ታደርቃለች።\n" +
                "23 ኀጥእ የፍርድን መንገድ ለማጥመም ከብብት መማለጃን ይወስዳል።\n" +
                "24 በአስተዋይ ፊት ጥበብ ትኖራለች፤ የሰነፍ ዓይን ግን በምድር ዳርቻ ነው።\n" +
                "25 ሰነፍ ልጅ ለአባቱ ፀፀት ነው፥ ለወለደችውም ምሬት ነው።\n" +
                "26 ጻድቅን መቅጣት፥ ጨዋ ሰውንም በጻድቅነቱ መምታት መልካም አይደለም።\n" +
                "27 ጥቂት ቃልን የሚናገር አዋቂ ነው፥ መንፈሱም ቀዝቃዛ የሆነ አስተዋይ ነው።\n" +
                "28 ሰነፍ ዝም ቢል ጠቢብ ሆኖ ይቈጠራል፥ ከንፈሩንም የሚቈልፍ። ባለ አእምሮ ነው ይባላል።\n"));

        return new Chapter(17, verses);
    }

    private Chapter chapterEighteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ መለየት የሚወድድ ምኞቱን ይከተላል፥ መልካሙንም ጥበብ ሁሉ ይቃወማል።\n" +
                "2 ሰነፍ የጥበብን ነገር አይወድድም፤ በልቡ ያለውን ሁሉ መግለጥ ብቻ ይወድዳል እንጂ።\n" +
                "3 ኀጥእ በመጣ ጊዜ ንቀት ደግሞ ይመጣል፥ ነውርም ከስድብ ጋር።\n" +
                "4 የሰው አፍ ቃል የጠለቀ ውኃ ነው፥ የጥበብም ምንጭ ፈሳሽ ወንዝ ነው።\n" +
                "5 የጻድቅ ፍርድ ይጠምም ዘንድ፥ ለኀጥእም ማድላት መልካም አይደለም።\n" +
                "6 የሰነፍ ከንፈር በጥል ውስጥ ትገባለች፥ አፉም በትርን ትጠራለች።\n" +
                "7 የሰነፍ አፍ ለራሱ ጥፋት ነው፥ ከንፈሩም ለነፍሱ ወጥመድ ነው።\n" +
                "8 የጆሮ ጠቢ ቃል እንደ ጣፋጭ መብል ነው፥ እርሱም እስከ ሆድ ጕርጆች ድረስ ይወርዳል።\n" +
                "9 በሥራው ታካች የሚሆን የሀብት አጥፊ ወንድም ነው።\n" +
                "10 የእግዚአብሔር ስም የጸና ግምብ ነው፤ ጻድቅ ወደ እርሱ ሮጦ ከፍ ከፍ ይላል።\n" +
                "11 ለባለጠጋ ሰው ሀብቱ እንደ ጸናች ከተማ ናት፥ በአሳቡም እንደ ረጅም ቅጥር።\n" +
                "12 ሰው ሳይወድቅ በፊት ልቡ ከፍ ከፍ ይላል፥ ትሕትናም ክብረትን ትቀድማለች።\n" +
                "13 ሳይሰማ ነገርን በሚመልስ ስንፍናና እፍረት ይሆንበታል።\n" +
                "14 የሰው ነፍስ ሕመሙን ይታገሣል፤ የተቀጠቀጠን መንፈስ ግን ማን ያጠንክረዋል?\n" +
                "15 የአስተዋይ ልብ እውቀትን ያገኛል፥ የጠቢባንም ጆሮ እውቀትን ትፈልጋለች።\n" +
                "16 የሰው ስጦታ መንገዱን ታሰፋለታለች፥ በታላላቆችም ፊት ታገባዋለች።\n" +
                "17 ወደ ፍርድ አስቀድሞ የገባ ጻድቅ ይመስላል፤ ባልንጀራው ግን መጥቶ ይመረምረዋል።\n" +
                "18 ዕጣ ክርክርን ትከለክላለች፥ በኃያላንም መካከል ትበይናለች።\n" +
                "19 የተበደለ ወንድም እንደ ጸናች ከተማ ጽኑ ነው፤ ክርክራቸውም እንደ ግንብ ብረት ነው።\n" +
                "20 የሰው ሆድ ከአፉ ፍሬ ይሞላል ከንፈሩም ከሚያፈራው ይጠግባል።\n" +
                "21 ሞትና ሕይወት በምላስ እጅ ናቸው፤ የሚወድዱአትም ፍሬዋን ይበላሉ።\n" +
                "22 ሚስት ያገኘ በረከትን አገኘ፥ ከእግዚአብሔርም ሞገስን ይቀበላል።\n" +
                "23 ድሀ በትሕትና እየለመነ ይናገራል፤ ባለጠጋ ግን በድፍረት ይመልሳል።\n" +
                "24 ብዙ ወዳጆች ያሉት ሰው ይጠፋል፤ ነገር ግን ከወንድም አብልጦ የሚጠጋጋ ወዳጅ አለ።\n"));

        return new Chapter(18, verses);
    }

    private Chapter chapterNineteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ በከንፈሩ ከሚወሳልት ሰነፍ ይልቅ ያለ ነውር የሚሄድ ድሀ ይሻላል።\n" +
                "2 ነፍስ እውቀት የሌለባት ትሆን ዘንድ መልካም አይደለም፤ እግሩንም የሚያፈጥን ከመንገድ ይስታል።\n" +
                "3 የሰው ስንፍና መንገዱን ታጣምምበታለች፤ ልቡም በእግዚአብሔር ላይ ይቈጣል።\n" +
                "4 ባለጠግነት ብዙ ወዳጆች ይጨምራል፤ የድሀ ወዳጅ ግን ከእርሱ ይርቃል።\n" +
                "5 ሐሰተኛ ምስክር ሳይቀጣ አይቀርም፥ በሐሰትም የሚናገር አያመልጥም።\n" +
                "6 ብዙ ሰዎች ለጋሱን ያቈላምጣሉ፥ ስጦታ ለሚሰጥም ሁሉ ወዳጅ ነው።\n" +
                "7 ድሀን ሰው ወንድሞቹ ሁሉ ይጠሉታል፤ ይልቁንም ወዳጆቹ ከእርሱ ይርቃሉ። እነርሱንም በቃል ቢከተላቸው አንዳች አይረቡትም።\n" +
                "8 ጥበብን የሚያገኝ ነፍሱን ይወድዳል፥ ማስተዋልንም የሚጠብቅ መልካም ነገርን ያገኛል።\n" +
                "9 ሐሰተኛ ምስክር ሳይቀጣ አይቀርም፤ በሐሰትም የሚናገር ይጠፋል።\n" +
                "10 ለሰነፍ ቅምጥልነት አይገባውም፥ ይልቁንም ባሪያ በአለቆች ላይ ይገዛ ዘንድ።\n" +
                "11 ሰውን ጠቢብ አእምሮው ከቍጣ ያዘገየዋል፥ ለበደለኛውም ይቅር ይል ዘንድ ክብር ይሆንለታል።\n" +
                "12 እንደ አንበሳ ግሣት የንጉሥ ቍጣ ነው፥ ሞገሱም በመስክ ላይ እንዳለ ጠል ነው።\n" +
                "13 ሰነፍ ልጅ ለአባቱ ኀዘን ነው፥ ጠበኛም ሚስት እንደማያቋርጥ ነጠብጣብ ናት።\n" +
                "14 ቤትና ባለጠግነት ከአባቶች ዘንድ ይወረሳሉ፤ አስተዋይ ሚስት ግን ከእግዚአብሔር ዘንድ ናት።\n" +
                "15 ተግባር መፍታት እንቅልፍን ታመጣለች፥ የታካችም ነፍስ ትራባለች።\n" +
                "16 ትእዛዝን የሚጠብቅ ነፍሱን ይጠብቃል፤ መንገዱን ቸል የሚል ግን ይጠፋል።\n" +
                "17 ለድሀ ቸርነትን የሚያደርግ ለእግዚአብሔር ያበድራል፥ በጎነቱንም መልሶ ይከፍለዋል።\n" +
                "18 ተስፋ ገና ሳለች ልጅህን ገሥጽ፥ መሞቱንም አትሻ።\n" +
                "19 ንዴተኛ ሰው መቀጮ ይከፍላል፤ ብታድነውም ደግሞ ትጨምራለህ።\n" +
                "20 ምክርን ስማ፥ ተግሣጽንም ተቀበል በፍጻሜህ ጠቢብ ትሆን ዘንድ።\n" +
                "21 በሰው ልብ ብዙ አሳብ አለ፤ የእግዚአብሔር ምክር ግን እርሱ ይጸናል።\n" +
                "22 የሰው ቸርነት የእርሱ ፍሬ ነው፤ ከሐሰተኛ ባለጠጋም እውነተኛ ድሀ ይሻላል።\n" +
                "23 እግዚአብሔርን መፍራት ወደ ሕይወት ይመራል፤ የሚፈራውም ጠግቦ ይኖራል፥ ክፉ ነገርም አያገኘውም።\n" +
                "24 ታካች ሰው እጁን በወጭቱ ያጠልቃታል፥ ወደ አፉ ስንኳ አይመልሳትም።\n" +
                "25 ፌዘኛ ብትገርፈው አላዋቂ ብልሃተኛ ይሆናል፤ አስተዋይን ሰው ብትገሥጸው እውቀትን ያገኛል።\n" +
                "26 አባቱን የሚያስከፋ እናቱንም የሚያሳድድ የሚያሳፍርና ጐስቋላ ልጅ ነው።\n" +
                "27 ልጅ ሆይ፥ ተግሣጽን ከሰማህ በኋላ ከእውቀት ቃል መሳሳትን ተው።\n" +
                "28 ወስላታ ምስክር በፍርድ ያፌዛል፥ የኀጥኣንም አፍ ክፋትን ይውጣል።\n" +
                "29 ለሚያፌዙ ሰዎች ፍርድ ተዘጋጅታለች፥ ለሰነፎችም ጀርባ በትር።\n"));

        return new Chapter(19, verses);
    }

    private Chapter chapterTwenty() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ የወይን ጠጅ ፌዘኛ ያደርጋል፥ ብርቱ መጠጥም ጠበኛ ያደርጋል፤ በዚህም የሳተ ሁሉ ጠቢብ አይደለም።\n" +
                "2 የንጉሥ ቍጣ እንደ አንበሳ ግሣት ነው፤ የሚያስቈጣውም ሰው የራሱን ነፍስ ይበድላል።\n" +
                "3 ከክርክር ይርቅ ዘንድ ለሰው ክብሩ ነው፤ ሰነፍ ሁሉ ግን እንዲህ ባለ ነገር ይጣመራል።\n" +
                "4 ታካች ሰው በብርድ ምክንያት አያርስም፤ ስለዚህ በመከር ይለምናል፥ ምንም አያገኝም።\n" +
                "5 ምክር በሰው ልብ እንደ ጠሊቅ ውኃ ነው፤ አእምሮ ያለው ሰው ግን ይቀዳዋል።\n" +
                "6 ብዙ ሰዎች ቸርነታቸውን ያወራሉ፤ የታመነውን ሰው ግን ማን ያገኘዋል?\n" +
                "7 ጻድቅ ያለ ነውር ይሄዳል፥ ልጆቹም ከእርሱ በኋላ ምስጉኖች ናቸው።\n" +
                "8 በፍርድ ወንበር የተቀመጠ ንጉሥ ክፉውን ሁሉ በዓይኖቹ ይበትናል።\n" +
                "9 ልቤን አነጻሁ፥ ከኃጢአትም ጠራሁ የሚል ማን ነው?\n" +
                "10 ሁለት ዓይነት ሚዛንና ሁለት ዓይነት መስፈሪያ፥ ሁለቱ በእግዚአብሔር ፊት ርኩሳን ናቸው።\n" +
                "11 ሕፃን ቅንና ንጹሕ መሆኑ በሚያደርገው ሥራ ይታወቃል።\n" +
                "12 የሚሰማ ጆሮንና የሚያይ ዓይንን፥ ሁለቱን እግዚአብሔር ፈጠራቸው።\n" +
                "13 ድሀ እንዳትሆን እንቅልፍን አትውደድ፤ ዓይንህን ክፈት፥ እንጀራም ትጠግባለህ።\n" +
                "14 የሚገዛ ሰው። ክፉ ነው ክፉ ነው ይላል፤ በሄደ ጊዜ ግን ይመካል።\n" +
                "15 ወርቅና ብዙ ቀይ ዕንቍ ይገኛል፤ የእውቀት ከንፈር ግን የከበረች ጌጥ ናት።\n" +
                "16 ለማያውቀው ከተዋሰ ሰው ልብሱን ውሰድ፥ ለእንግዳ የተዋሰውንም እርሱን አግተው።\n" +
                "17 የሐሰት እንጀራ ለሰው የጣፈጠ ነው፤ ከዚያ በኋላ ግን አፉ ጭንጫ ይሞላል።\n" +
                "18 አሳብ በምክር ትጸናለች፥ በመልካምም ምክር ሰልፍ አድርግ።\n" +
                "19 ዘዋሪ ሐሜተኛ ምሥጢርን ይገልጣል፤ ከንፈሩን የሚያሞጠሙጥ ሰውን አትገናኘው።\n" +
                "20 አባቱን ወይም እናቱን የሚሰድብ፥ በጽቅድቅ ጨለማ መብራቱ ይጠፋል።\n" +
                "21 በመጀመሪያ ፈጥኖ የተከማቸ ርስት ፍጻሜው አይባረክም።\n" +
                "22 ክፉ እመልሳለሁ አትበል፤ እግዚአብሔርን ተማመን፥ እርሱም ያድንሃል።\n" +
                "23 ሁለት ዓይነት ሚዛን በእግዚአብሔር ዘንድ አስጸያፊ ነው፥ ሐሰተኛ ሚዛንም መልካም አይደለም።\n" +
                "24 የሰው አካሄዱ ከእግዚአብሔር ዘንድ ነው፤ እንግዲያስ ሰው መንገዱን እንዴት ያስተውላል?\n" +
                "25 ሰው በችኰላ። ለእግዚአብሔር የተቀደሰ ነው ብሎ ቢሳል፥ ከተሳለም በኋላ ቢፀፀት ወጥመድ ነው።\n" +
                "26 ጠቢብ ንጉሥ ኀጥኣንን በመንሽ ይበትናቸዋል፥ መንኰራኵሩንም በእነርሱ ላይ ያንኰራኵርባቸዋል።\n" +
                "27 የሰው መንፈስ የእግዚአብሔር መብራት ነው የሆዱን ጕርጆች ሁሉ የሚመረምር።\n" +
                "28 ቸርነትና እውነት ንጉሥን ይጠብቁታል፤ ዙፋኑም በቸርነት ይበረታል።\n" +
                "29 የጎበዛዝት ክብር ጕልበታቸው ናት፥ የሽማግሌዎችም ጌጥ ሽበት ነው።\n" +
                "30 የሰንበር ቍስል ክፉዎችን ያነጻል፤ ግርፋትም ወደ ሆድ ጕርጆች ይገባል።\n"));

        return new Chapter(20, verses);
    }
    private Chapter chapterTwentyOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ የንጉሥ ልብ እንደ ውኃ ፈሳሾች በእግዚአብሔር እጅ ነው፤ ወደ ወደደውም ያዘነብለዋል።\n" +
                "2 የሰው መንገድ ሁሉ በዓይኑ ፊት የቀናች ትመስለዋለች፤ እግዚአብሔር ግን ልብን ይመዝናል።\n" +
                "3 እግዚአብሔር ከመሥዋዕት ይልቅ ጽድቅንና ቅን ነገርን ማድረግ ይወድዳል።\n" +
                "4 ትዕቢተኛ ዓይንና ደፋር ልብ የኀጥኣንም እርሻ ኃጢአት ነው።\n" +
                "5 የትጉህ አሳብ ወደ ጥጋብ ያደርሳል፤ ችኵል ሰው ሁሉ ግን ለመጕደል ይቸኩላል።\n" +
                "6 በሐሰተኛ ምላስ መዝገብ ማከማቸት የሚበንን ጉም ነው፤ ይህን የሚፈልጉ ሞትን ይፈልጋሉ።\n" +
                "7 ቅን ነገርን ያደርጉ ዘንድ አይወድዱምና የኀጥኣን ንጥቂያ ራሳቸውን ያጠፋቸዋል።\n" +
                "8 የበደለኛ መንገድ የጠመመች ናት፤ የንጹሕ ሥራ ግን የቀና ነው።\n" +
                "9 ከጠበኛ ሴት ጋር በአንድ ቤት ከመቀመጥ በውጪ በቤት ማዕዘን ላይ መቀመጥ ይሻላል።\n" +
                "10 የኀጥእ ነፍስ ክፉን ትመኛለች፥ በፊቱም ባልንጀራው ሞገስን አያገኝም።\n" +
                "11 ፌዘኛ ቅጣትን በተቀበለ ጊዜ አላዋቂ ሰው ጥበብን ያገኛል፤ ጠቢብም ቢማር እውቀትን ይቀበላል።\n" +
                "12 ጻድቅ ስለ ኀጥእ ቤት ያስባል፥ ኀጥኣንም ለጥፋት እንደ ተገለበጡ።\n" +
                "13 የድሀውን ጩኸት እንዳይሰማ ጆሮውን የሚደፍን ሰው፥ እርሱ ራሱ ይጮኻል አይሰማለትምም።\n" +
                "14 ስጦታ በስውር ቍጣን ታጠፋለች፥ የብብትም ውስጥ ጉቦ ጽኑ ቍጣን ታበርዳለች።\n" +
                "15 ፍርድን ማድረግ ለጻድቅ ደስታ ነው፤ ኃጢአትን ለሚያደርጉ ግን ጥፋት ነው።\n" +
                "16 ከማስተዋል መንገድ የሚሳሳት ሰው በሙታን ጉባኤ ያርፋል።\n" +
                "17 ተድላ የሚወድድ ድሀ ይሆናል፥ የወይን ጠጅንና ዘይትንም የሚወድድ ባለጠጋ አይሆንም።\n" +
                "18 ኀጥእ የጻድቅ ቤዛ ነው፤ በደለኛም የቅን ሰው ቤዛ ነው።\n" +
                "19 ከጠበኛና ከቍጡ ሴት ጋር ከመቀመጥ በምድረ በዳ መቀመጥ ይሻላል።\n" +
                "20 የከበረ መዝገብና ዘይት በጠቢብ ሰው ቤት ይኖራል። አእምሮ የሌለው ሰው ግን ይውጠዋል።\n" +
                "21 ጽድቅንና ምሕረትን የሚከተል ሕይወትንና ጽድቅን ክብርንም ያገኛል።\n" +
                "22 ጠቢብ የኃያላንን ከተማ ይገባባታል፥ የሚታመኑበትንም ኃይል ያፈርሳል።\n" +
                "23 አፉንና ምላሱን የሚጠብቅ ነፍሱን ከመከራ ይጠብቃል።\n" +
                "24 ኵሩና ተጓዳጅ ሰው ፌዘኛ ይባላል፤ እርሱም በትዕቢት ቍጣ ያደርጋል።\n" +
                "25 ታካችን ምኞቱ ትገድለዋለች፥ እጆቹ ይሠሩ ዘንድ አይፈቅዱምና።\n" +
                "26 ኀጥእ ቀኑን ሁሉ ምኞትን ይመኛል፤ ጻድቅ ግን ይሰጣል፥ አይሰስትም።\n" +
                "27 የኀጥኣን መሥዋዕት አስጸያፊ ነው፤ ይልቁንም በክፉ አሳብ ሲያቀርቡት አስጸያፊ ነው።\n" +
                "28 ሐሰተኛ ምስክር ይጠፋል፤ የሚሰማ ሰው ግን ተጠንቅቆ ይናገራል።\n" +
                "29 ኀጥእ ፊቱን ያጠነክራል፤ ቅን ሰው ግን መንገዱን ያጸናል።\n" +
                "30 ጥበብ ወይም ማስተዋል ወይም ምክር በእግዚአብሔር ላይ የለም።\n" +
                "31 ፈረስ ለጦርነት ቀን ይዘጋጃል፤ ድል ግን ከእግዚአብሔር ዘንድ ነው።\n"));
        // Add more verses as needed
        return new Chapter(21, verses);
    }

    private Chapter chapterTwentyTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ መልካም ስም ከብዙ ባለጠግነት ይሻላል፥ መልካምም ሞገስ ከብርና ከወርቅ ይበልጣል።\n" +
                "2 ባለጠና ድሀ ተገናኙ፤ እግዚአብሔር የሁላቸው ፈጣሪ ነው።\n" +
                "3 ብልህ ሰው ክፉን አይቶ ይሸሸጋል፤ አላዋቂዎች ግን አልፈው ይጐዳሉ።\n" +
                "4 ትሕትናና እግዚአብሔርን መፍራት ባለጠግነት ክብር ሕይወትም ነው።\n" +
                "5 እሾህና ወጥመድ በጠማማ ሰው መንገድ ናቸው፤ ነፍሱን ግን የሚጠብቅ ከእነርሱ ይርቃል።\n" +
                "6 ልጅን በሚሄድበት መንገድ ምራው፥ በሸመገለም ጊዜ ከእርሱ ፈቀቅ አይልም።\n" +
                "7 ባለጠጋ ድሆችን ይገዛል፥ ተበዳሪም የአበዳሪ ባሪያ ነው።\n" +
                "8 ኃጢአትን የሚዘራ መከራን ያጭዳል፥ የቍጣውም በትር ይጠፋል።\n" +
                "9 ርኅሩህ የተባረከ ይሆናል፥ ከእንጀራው ለድሀ ሰጥቶአልና።\n" +
                "10 ፌዘኛን ብታወጣ ክርክር ይወጣል፥ ጠብና ስድብም ያልቃል።\n" +
                "11 የልብን ንጽሕና የሚወድድና ሞገስ በከንፈሩ ያለች፥ ንጉሥ ወዳጁ ይሆናል።\n" +
                "12 የእግዚአብሔር ዓይኖች እውቀትን ይጠብቃሉ፤ እርሱ ግን የወስላታውን ቃል ይገለብጣል።\n" +
                "13 ታካች ሰው። አንበሳ በሜዳ ነው፤ በመንገዱ ላይ እሞታለሁ ይላል።\n" +
                "14 የጋለሞታ ሴት አፍ የጠለቀ ጕድጓድ ነው፤ እግዚአብሔር የተቈጣው በእርስዋ ይወድቃል።\n" +
                "15 ስንፍና በሕፃን ልብ ታስሮአል፤ የተግሣጽ በትር ግን ከእርሱ ያርቃታል።\n" +
                "16 ለራሱ ጥቅም ለመጨመር ሲል ድሀን የሚጐዳ፥ ለባለጠጋም የሚሰጥ፥ እርሱ ወደ ድህነት ይወድቃል።\n" +
                "17 ጆሮህን አዘንብለህ የጠቢባንን ቃላት ስማ፥ ልብህንም ወደ እውቀቴ አድርግ፤\n" +
                "18 እነርሱን በውስጥህ ብትጠብቅ፥ በከንፈሮችህም ላይ የተዘጋጁ ቢሆኑ፥ የተወደደ ነገር ይሆንልሃልና።\n" +
                "19 እምነትህ በእግዚአብሔር ይሆን ዘንድ ለአንተ ዛሬ እነሆ አስታወቅሁህ።\n" +
                "20 -\n" +
                "21 የእውነትን ቃል እርግጥነት አስታውቅህ ዘንድ፥ ለሚጠይቅህም እውነትን ቃል መመለስ ይቻልህ ዘንድ፥ በምክርና በእውቀት የከበረን ነገር አልጻፍሁልህምን?\n" +
                "22 ድሀን በግድ አትበለው ድሀ ነውና፤ ችግረኛውንም በበር አትግፋው፤\n" +
                "23 እግዚአብሔር የእነርሱን ፍርድ ይፋረድላቸዋልና፥ የቀሙአቸውንም ሰዎች ሕይወት ይቀማልና።\n" +
                "24 ከቍጡ ሰው ጋር ባልንጀራ አትሁን፥ ከወፈፍተኛም ጋት አትሂድ፥\n" +
                "25 መንገዱን እንዳትማር ለነፍስህም ወጥመድ እንዳታገኝህ።\n" +
                "26 እጃቸውን አጋና እንደሚማቱ፥ ለባለ ዕዳዎች እንደሚዋሱ አትሁን፤\n" +
                "27 የምትከፍለው ባይኖርህ፥ ምንጣፍህን ከበታችህ ስለ ምን ይወስዳል?\n" +
                "28 አባቶችህ የሠሩትን የቀድሞውን የድንበር ምልክት አታፍልስ።\n" +
                "29 በሥራው የቀጠፈ ሰውን አይተሃልን? በነገሥታት ፊት ይቆማል፤ በተዋረዱም ሰዎች ፊት አይቆምም።\n" ));
        // Add more verses as needed
        return new Chapter(22, verses);
    }

    private Chapter chapterTwentyThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ ከመኰንን ጋር ለመብላት በተቀመጥህ ጊዜ፥ በፊትህ ያለውን በደኅና አስተውል፤\n" +
                "2 ሰውነትህም ቢሳሳ፥ በጕሮሮህ ላይ ካራ አድርግ።\n" +
                "3 ጣፋጩ መብል አይመርህ የሐሰት እንጀራ ነውና።\n" +
                "4 ባለጠጋ ለመሆን አትድከም፤ የገዛ ራስህን ማስተዋል ተው።\n" +
                "5 በእርሱ ላይ ዓይንህን ብታዘወትርበት ይጠፋል፤ ባለጠግነት ወደ ሰማይ እንደሚበርር እንደ ንስር ለራሱ ክንፍ ያበጃልና።\n" +
                "6 የቀናተኛን ሰው እንጀራ አትብላ፥ ጣፋጩ መብልም አይመርህ፤\n" +
                "7 በልቡ እንዳሰበ እንዲሁ ነውና፤ ብላ ጠጣ ይልሃል፥ ልቡ ግን ካንተ ጋር አይደለም።\n" +
                "8 የበላኸውን መብል ትተፋዋለህ፥ ያማረውንም ቃልህን ታጠፋዋለህ።\n" +
                "9 በሰነፍ ጆሮ አንዳች አትናገር፥ የቃልህን ጥበብ ያፌዝብሃልና።\n" +
                "10 የቀድሞውን የድንበር ምልክት አታፍልስ፤ ወደ ድሀ አደጎች እርሻ አትግባ፤\n" +
                "11 ታዳጊአቸው ጽኑ ነውና፥ እርሱም ፍርዳቸውን ከአንተ ጋር ይፋረዳልና።\n" +
                "12 ልብህን ለተግሣጽ ስጥ፥ ጆሮህንም ወደ እውቀት ቃል።\n" +
                "13 ሕፃንን ከመቅጣት ቸል አትበል፥ በበትር ብትመታው አይሞትምና።\n" +
                "14 በበትር ትመታዋለህ፥ ነፍሱንም ትታደጋለህ።\n" +
                "15 ልጄ ሆይ፥ ልብህ ጠቢብ ቢሆን ልቤ ደግሞ ደስ ይለዋል፤\n" +
                "16 ከንፈሮችህም በቅን ቢናገሩ ኵላሊቶቼ ደስ ይላቸዋል።\n" +
                "17 ልብህ በኃጢአተኞች አይቅና፤ ነገር ግን ቀኑን ሙሉ እግዚአብሔርን በመፍራት ኑር፤\n" +
                "18 በእውነት ፍጻሜ አለህና፥ ተስፋህም አይጠፋምና።\n" +
                "19 ልጄ ሆይ፥ ስማ ጠቢብም ሁን ልብህንም በቀናው መንገድ ምራ።\n" +
                "20 የወይን ጠጅ ከሚጠጡ ጋር አትቀመጥ ለሥጋም ከሚሣሡ ጋር፤\n" +
                "21 ሰካርና ሆዳም ይደኸያሉና፥ የእንቅልፍም ብዛት የተቦጫጨቀ ጨርቅ ያስለብሳልና።\n" +
                "22 የወለደህን አባትህን ስማ፥ እናትህም ባረጀች ጊዜ አትናቃት።\n" +
                "23 እውነትን ግዛ አትሽጣትም፥ ጥበብን ተግሣጽን ማስተዋልንም።\n" +
                "24 የጻድቅ አባት እጅግ ደስ ይለዋል፥ ጠቢብንም ልጅ የወለደ ሐሤትን ያገኛል።\n" +
                "25 አባትህና እናትህ ደስ ይበላቸው፥ አንተንም የወለደች ደስ ይበላት።\n" +
                "26 ልጄ ሆይ፥ ልብህን ስጠኝ፥ ዓይኖችህም መንገዴን ይውደዱ፤\n" +
                "27 ጋለሞታ ሴት የጠለቀች ዐዘቅት ናትና፥ ሌላይቱም ሴት የጠበበች ጕድጓድ ናትና።\n" +
                "28 እንደ ሌባ ታደባለች ወስላቶችንም በሰው ልጆች መካከል ታበዛለች።\n" +
                "29 ዋይታ ለማን ነው? ኀዘን ለማን ነው? ጠብ ለማን ነው? ጩኸት ለማን ነው? ያለ ምክንያት መቍሰል ለማን ነው? የዓይን ቅላት ለማን ነው?\n" +
                "30 የወይን ጠጅ በመጠጣት ለሚዘገዩ አይደለምን? የተደባለቀ የወይንን ጠጅ ይፈትኑ ዘንድ ለሚከተሉ አይደለምን?\n" +
                "31 ወደ ወይን ጠጅ አትመልከት በቀላ ጊዜ፥ መልኩም በብርሌ ባንጸባረቀ ጊዜ፥ እየጣፈጠም በገባ ጊዜ።\n" +
                "32 በኋላ እንደ እባብ ይነድፋል፥ እንደ እፉኝትም መርዙን ያፈስሳል።\n" +
                "33 ዓይኖችህ ጋለሞታዎችን ያያሉ፥ ልብህም ጠማማ ነገርን ይናገራል።\n" +
                "34 በባሕር ውስጥ እንደ ተኛ ትሆናለህ፥ በደቀልም ላይ እንደ ተኛ።\n" +
                "35 መቱኝ፥ ያውም አልተሰማኝም፤ ጐሰሙኝ፥ አላወቅሁምም። መቼ እነሣለሁ? ደግሞ ጨምሬ እሻታለሁ ትላለህ።\n"));
        // Add more verses as needed
        return new Chapter(23, verses);
    }

    private Chapter chapterTwentyFour() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ልጄ ሆይ፥ በክፉ ሰዎች አትቅና፥ ከእነርሱ ጋርም መሆንን አትውደድ፤\n" +
                "2 ልባቸው ግፍን ታስባለችና፥ ከንፈራቸውም ሽንገላን ትናገራለችና።\n" +
                "3 ቤት በጥበብ ይሠራል፥ በማስተዋልም ይጸናል።\n" +
                "4 በእውቀት ከከበረውና ካማረው ሀብት ሁሉ ጓዳዎች ይሞላሉ።\n" +
                "5 ጠቢብ ሰው ብርቱ ነው፥ አዋቂም ሰው ኃይሉን ያበዛል።\n" +
                "6 በመልካም ሥርዓት ሰልፍ ታደርጋለህ፤ ድልም ብዙ ምክር ባለበት ዘንድ ነው።\n" +
                "7 ጥበብ ለሰነፍ ከፍ ብላ የራቀች ናት፤ በበርም አፉን አይከፍትም።\n" +
                "8 ክፉ ለማድረግ የሚያስብ ተንኰለኛ ይባላል።\n" +
                "9 የስንፍና ሐሳብ ኃጢአት ነው፤ ሰዎች ፌዘኛውን ይጸየፉታል።\n" +
                "10 በመከራ ቀን ብትላላ ጉልበትህ ጥቂት ነው።\n" +
                "11 ወደ ሞት የሚነዱትን ታደግ፤ ሊታረዱ የተወሰኑትን አድን።\n" +
                "12 እነሆ፥ ይህን አላወቀውም ብትል፥ ልቦችን የሚመረምር እርሱ አያስተውልምን? ነፍስህንም የሚመለከት እርሱ አያውቅምን? ለሰውስ ሁሉ እንደ ሥራው አይመልስለትምን?\n" +
                "13 ልጄ ሆይ፥ መልካም ነውና ማር ብላ፤ ወለላም ለጣምህ ጣፋጭ ነው።\n" +
                "14 ጥበብም ለነፍስህ እንዲሁ እንደሚሆን እወቅ፤ ብታገኘውም ፍጻሜህ መልካም ይሆናል፥ ተስፋህም አይጠፋም።\n" +
                "15 እንደ ኀጥእ በጻድቅ ቤት ላይ አትሸምቅ፤ ማደሪያውንም አታውክ።\n" +
                "16 ጻድቅ ሰባት ጊዜ ይወድቃልና፥ ይነሣማል፤ ኀጥኣን ግን በክፉ ላይ ይወድቃሉ።\n" +
                "17 ጠላትህ ቢወድቅ ደስ አይበልህ፥ በመሰናከሉም ልብህ ሐሤት አያድርግ፥\n" +
                "18 እግዚአብሔር ያንን አይቶ በዓይኑ ክፉ እንዳይሆን፥ ቍጣውንም ከእርሱ እንዳይመልስ።\n" +
                "19 ስለ ኃጢአተኞች አትቈጣ፥ በክፉዎችም አትቅና።\n" +
                "20 ለኃጢአተኛ የፍጻሜ ተስፋ የለውምና፥ የኅጥኣንም መብራት ይጠፋልና።\n" +
                "21 ልጄ ሆይ፥ እግዚአብሔርንና ንጉሥን ፍራ፥ ከዓመፀኞችም ጋር አትደባለቅ።\n" +
                "22 መከራቸው ድንገት ይነሣልና፤ ከሁለቱ የሚመጣውን ጥፋት ማን ያውቃል? ፍን [የሚቀጥለው ከግሪክ የተጨመረ ነው።] የነገሩትን የሚሰማ ልጅ ከጥፋት የራቀ ነው፤ የነገሩትን የሚቀበልን ሰው እግዚአብሔር ይቀበለዋል። ከንጉሥ አንደበት ምንምን ሐሰት ይነገራል አይባልም፤ ከአንደበቱም የሚወጣ ሐሰት የለም። የንጉሥ ቃል ሾተል ናት፤ ለጥፋት የተሰጠችውን ሰው ሰውነት ታጠፋዋለች እንጂ አንድ አካል ብቻ የምታጠፋ አይደለም። ሰይፍ መዓቱ ብትሳል ግን ከወገኑ ጋር ሰውን ታጠፋለች፤ ከአሞሮች ግልገል ወገን የማይበላ እስኪሆን ድረስ እንደ እሳት ነበልባል ታቃጥላለች።\n" +
                "23 እነዚህ ደግሞ የጠቢባን ቃሎች ናቸው። በፍርድ ታደላ ዘንድ መልካም አይደለም።\n" +
                "24 ኀጥኡን። ጻድቅ ነህ የሚለውን ወገኖች ይረግሙታል አሕዛብም ይጠሉታል፤\n" +
                "25 የሚዘልፉት ግን ደስታ ይሆንላቸዋል፥ በላያቸውም መልካም በረከት ትመጣላቸዋለች።\n" +
                "26 በቀና ነገር የሚመልስ ከንፈርን ይስማል።\n" +
                "27 በስተ ሜዳ ሥራህን አሰናዳ፥ ስለ አንተ በእርሻ አዘጋጃት፤ ከዚያም በኋላ ቤትህን ሥራ።\n" +
                "28 በባልንጀራህ ላይ በከንቱ ምስክር አትሁን፥ በከንፈርህም አታባብለው።\n" +
                "29 እንዳደረገብኝ እንዲሁ አደርግበታለሁ፥ እንደ ሥራውም እመልስበታለሁ አትበል።\n" +
                "30 በታካች ሰው እርሻ፥ አእምሮ በጐደለውም ሰው ወይን ቦታ አለፍሁ።\n" +
                "31 እነሆም፥ ሁሉ እሾህ ሞልቶበታል፥ ፊቱንም ሳማ ሸፍኖታል፥ የድንጋዩም ቅጥር ፈርሶአል።\n" +
                "32 ተመለከትሁና አሰብሁ፤ አየሁትና ተግሣጽን ተቀበልሁ።\n" +
                "33 ጥቂት ትተኛለህ፥ ጥቂትም ታንቀላፋለህ፥ ትተኛም ዘንድ ጥቂት እጅህን ታጥፋለህ፤\n" +
                "34 እንግዲህ ድህነትህ እንደ ወንበዴ፥ ችጋርህም ሰይፍ እንደ ታጠቀ ሰው ይመጣብሃል። [በግዕዝ መጽሐፈ ተግሣጽ ይባላል]\n"));
        // Add more verses as needed
        return new Chapter(24, verses);
    }
    private Chapter chapterTwentyFive() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እነዚህም ደግሞ የይሁዳ ንጉሥ የሕዝቅያስ ሰዎች የቀዱአቸው የሰሎሞን ምሳሌዎች ናቸው።\n" +
                "2 የእግዚአብሔር ክብር ነገርን መሰወር ነው፤ የነገሥታት ክብር ግን ነገርን መመርመር ነው።\n" +
                "3 እንደ ሰማይ ከፍታ እንደ ምድርም ጥልቀት የነገሥታት ልብ አይመረመርም።\n" +
                "4 ከብር ዝገትን አስወግድ፥ ፈጽሞም ይጠራል።\n" +
                "5 ከንጉሥ ፊት ኀጥኣንን አርቅ፥ ዙፋኑም በጽድቅ ትጸናለች።\n" +
                "6 በንጉሥ ፊት አትመካ፥ በታላልቆችም ስፍራ አትቁም፤\n" +
                "7 ዓይኖችህ ባዩት በመኰንን ፊት ከምትዋረድ። ወደዚህ ከፍ በል ብትባል ይሻልሃልና።\n" +
                "8 ባልንጀራህ ባሳፈረህ ጊዜ ኋላ እንዳትጸጸት ለክርክር ፈጥነህ አትውጣ፤\n" +
                "9 ክርክርህን ከባልንጀራህ ጋር ተከራከር፤ የሌላ ሰው ምሥጢር ግን አትግለጥ፥\n" +
                "10 የሚሰማ እንዳይነቅፍህ፥ አንተንም ከማነወር ዝም እንዳይል።\n" +
                "11 የወርቅ እንኮይ በብር ፃሕል ላይ፤ የጊዜው ቃል እንዲሁ ነው።\n" +
                "12 የምትሰማን ጆሮ የሚዘልፍ ጠቢብ ሰው እንደ ወርቅ ጉትቻ እንደሚያንጸባርቅም ዕንቍ እንዲሁ ነው።\n" +
                "13 በመከር ወራት የውርጭ ጠል ደስ እንደሚያሰኝ፥ እንዲሁ የታመነ መልእክተኛ ለላኩት ነው፤ የጌቶቹን ነፍስ ያሳርፋልና።\n" +
                "14 ስለ ስጦታው በሐሰት የሚመካ ሰው ዝናብ እንደማይከተለው ደመና ነፋስም ነው።\n" +
                "15 በትዕግሥት አለቃ ይለዝባል፥ የገራም ምላስ አጥንትን ይሰብራል።\n" +
                "16 አጥብቀህ እንዳትጠግብ እንዳትተፋውም ማር ባገኘህ ጊዜ የሚበቃህን ብላ።\n" +
                "17 እንዳይሰለችህ እንዳይጠላህም እግርህን ወደ ባልንጀራህ ቤት አታዘውትር።\n" +
                "18 በባልንጀራው በሐሰት የሚመሰክር እንደ መዶሻና እንደ ሰይፍ እንደ ተሳለም ፍላጻ ነው።\n" +
                "19 ወስላታውን ሰው በመከራ ጊዜ መተማመን እንደ ተሰበረ ጥርስና እንደ ሰለለ እግር ነው።\n" +
                "20 ለሚያዝን ልብ ዝማሬ የሚዘምር፥ ለብርድ ቀን መጐናጸፊያውን እንደሚያስወግድ በቍስልም ላይ እንደ መጻጻ እንዲሁ ነው።\n" +
                "21 ጠላትህ ቢራብ እንጀራ አብላው፥ ቢጠማም ውኃ አጠጣው፤\n" +
                "22 ፍም በራሱ ላይ ትሰበስባለህና፥ እግዚአብሔርም ዋጋህን ይመልስልሃልና።\n" +
                "23 የሰሜን ነፋስ ወጀብ ያመጣል፤ ሐሜተኛ ምላስም የሰውን ፊት ያስቈጣል።\n" +
                "24 ከጠበኛ ሴት ጋር በአንድ ቤት ከመቀመጥ በሰገነት ማዕዘን መቀመጥ ይሻላል።\n" +
                "25 የቀዘቀዘ ውኃ ለተጠማች ነፍስ ደስ እንደሚያሰኝ፥ ከሩቅ አገር የመጣ መልካም ምስራች እንዲሁ ነው።\n" +
                "26 በኀጥእ ፊት የሚወድቅ ጻድቅ እንደደፈረሰ ፈሳሽና እንደ ረከሰ ምንጭ ነው።\n" +
                "27 ብዙ ማር መብላት መልካም አይደለም፤ እንዲሁም የራስን ክብር መፈላለግ አያስከብርም።\n" +
                "28 ቅጥር እንደሌላት እንደ ፈረሰች ከተማ፥ መንፈሱን የማይከለክል ሰው እንዲሁ ነው።\n"));

        return new Chapter(25, verses);
    }

    private Chapter chapterTwentySix() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ በረዶ በበጋ ዝናብም በመከር እንዳይገባ፥ እንዲሁ ለሰነፍ ክብር አይገባውም።\n" +
                "2 እንደሚተላለፍ ድንቢጥ ወዲያና ወዲህም እንደሚበርር ጨረባ፥ እንዲሁ ከንቱ እርግማን በማንም ላይ አይደርስም።\n" +
                "3 አለንጋ ለፈረስ፥ ልጓም ለአህያ፥ በትርም ለሰነፍ ጀርባ ነው።\n" +
                "4 አንተ ደግሞ እርሱን እንዳትመስል ለሰነፍ እንደ ስንፍናው አትመልስለት።\n" +
                "5 ለራሱ ጠቢብ የሆነ እንዳይመስለው ለሰነፍ እንደ ስንፍናው መልስለት።\n" +
                "6 በሰነፍ መልእክተኛ እጅ ነገርን የሚልክ እግሮቹን ይቈርጣል ግፍንም ይጠጣል።\n" +
                "7 እንደሚንጠለጠሉ የአንካሳ እግሮች፥ እንዲሁም ምሳሌ በሰነፎች አፍ ነው።\n" +
                "8 ለሰነፍ ክብርን የሚሰጥ ድንጋይን በወንጭፍ እንደሚያስር ነው።\n" +
                "9 እሾህ በስካር እጅ እንደሚሰካ፥ እንዲሁ ምሳሌ በሰነፎች አፍ ነው።\n" +
                "10 ዋና ሠራተኛ ሁሉን ነገር ይሠራል፤ ሰነፍን የሚቀጥር ግን መንገድ አላፊውን እንደሚቀጥር ነው።\n" +
                "11 ወደ ትፋቱ እንደሚመለስ ውሻ ስንፍናውን የሚደግም ሰው እንዲሁ ነው።\n" +
                "12 ለራሱ ጠቢብ የሆነ የሚምስለውን ሰው አየኽውን? ከእርሱ ይልቅ ለሰነፍ ተስፋ አለው።\n" +
                "13 ታካች ሰው። አንበሳ በመንገድ አለ፤ አንበሳ በጎዳና አለ ይላል።\n" +
                "14 ሣንቃ በማጠፊያው ላይ እንደሚዞር፥ እንዲሁ ታካች ሰው በአልጋው ላይ ይመላለሳል።\n" +
                "15 ታካች ሰው እጁን ወደ ወጭት ያጠልቃል፤ ወደ አፉም ይመልሳት ዘንድ ለእርሱ ድካም ነው።\n" +
                "16 ታካች ሰው በጥበብ ከሚመልሱ ከሰባት ሰዎች ይልቅ ለራሱ ጠቢብ የሆነ ይመስለዋል።\n" +
                "17 አልፎ በሌላው ጥል የሚደባለቅ ውሻን በጅራቱ እንደሚይዝ ነው።\n" +
                "18 ትንታግንና ፍላጻን ሞትንም እንደሚወረውር እንደ ዕብድ ሰው፥\n" +
                "19 ባልንጀራውን የሚያታልል። በጨዋታ አደረግሁት የሚል ሰውም እንዲሁ ነው።\n" +
                "20 እንጨት ባለቀ ጊዜ እሳት ይጠፋል፤ ጆሮ ጠቢ በሌለበትም ዘንድ ጠብ ጸጥ ይላል።\n" +
                "21 ከሰል ፍምን እንጨትም እሳትን እንዲያበዛ፥ እንዲሁ ቍጡ ሰው ጠብን ያበዛል።\n" +
                "22 የጆሮ ጠቢ ቃል እንደ ጣፋጭ መብል ነው፥ እርሱም እስከ ሆድ ጕርጆች ድረስ ይወርዳል።\n" +
                "23 ክፋት በልቡ ሳለ ፍቅርን የሚናገር ከንፈር በብር ዝገት እንደ ተለበጠ የሸክላ ዕቅ ነው።\n" +
                "24 ጠላት በከንፈሩ ተስፋ ይሰጣል፥ በልቡ ግን ተንኰልን ያኖራል።\n" +
                "25 በልቡ ሰባት ርኵሰት አለበትና በቃሉ አሳምሮ ቢናገርህ አትመነው።\n" +
                "26 ጠላትነቱን በተንኰል የሚሸሽግ፥ ክፋቱ በጉባኤ መካከል ይገለጣል።\n" +
                "27 ጕድጓድን የሚምስ ይወድቅበታል፤ ድንጋይንም የሚያንከባልል ይገለበጥበታል።\n" +
                "28 ሐሰተኛ ምላስ ያቈሰላቸውን ሰዎች ይጠላል፤ ልዝብ አፍም ጥፋትን ያመጣል።\n" ));

        return new Chapter(26, verses);
    }

    private Chapter chapterTwentySeven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ቀን የሚያመጣውን ምን እንደ ሆነ አታውቅምና ነገ በሚሆነው አትመካ።\n" +
                "2 ሌላ ያመስግንህ እንጂ አፍህ አይደለም፤ ባዕድ ሰው እንጂ ከንፈርህ አይደለም።\n" +
                "3 ድንጋይ ከባድ ነው አሸዋም ሸክሙ ጽኑ ነው፤ ከሁለቱ ግን የሰነፍ ቍጣ ይከብዳል።\n" +
                "4 ቍጣ ምሕረት የሌለው ነው፥ መዓትም እንደ ጎርፍ ነው፤ በቅንዓት ፊት ግን ማን ይቆማል?\n" +
                "5 የተገለጠ ዘለፋ ከተሰወረ ፍቅር ይሻላል።\n" +
                "6 የወዳጅ ማቍሰል የታመነ ነው፤ የጠላት መሳም ግን የበዛ ነው።\n" +
                "7 የጠገበች ነፍስ የማር ወላላ ትረግጣለች፤ ለተራበች ነፍስ ግን የመረረ ነገር ሁሉ ይጣፍጣታል።\n" +
                "8 ስፍራውን የሚተው ሰው፤ ቤቱን ትቶ እንደሚበርር ወፍ ነው።\n" +
                "9 ሽቱና ዕጣን ልብን ደስ ያሰኛሉ፤ እንዲሁ ነፍስ በወዳጁ ምክር ደስ ይላታል።\n" +
                "10 ወዳጅህንና የአባትህን ወዳጅ አትተው፤ በመከራህም ቀን ወደ ወንድምህ ቤት አትግባ፤ የቀረበ ወዳጅ ከራቀ ወንድም ይሻላል።\n" +
                "11 ልጄ ሆይ፥ ጠቢብ ሁን፥ ልቤንም ደስ አሰኘው፥ ለሚሰድበኝ መልስ መስጠት ይቻለኝ ዘንድ።\n" +
                "12 ብልህ ሰው ክፉን አይቶ ይሸሸጋል፤ አላዋቂዎች ግን አልፈው ይጐዳሉ።\n" +
                "13 ለማያውቀው ከተዋሰ ሰው ልብሱን ውሰድ፥ ለእንግዳ የተዋሰውንም እርሱን አግተው።\n" +
                "14 ባልንጀራውን በታላቅ ቃል ማለዳ የሚባርክ ሰው እንደሚራገም ያህል ነው።\n" +
                "15 በዝናብ ቀን የሚያንጠባጥብ ቤትና ጠበኛ ሴት አንድ ናቸው፤\n" +
                "16 እርስዋንም መከልከል ነፍስን መከልከልና ዘይትን በቀኝ እጅ መጨበጥ ነው።\n" +
                "17 ብረት ብረትን ይስለዋል፥ ሰውም ባልንጀራውን ይስላል።\n" +
                "18 በለሱን የጠበቀ ፍሬዋን ይበላል፥ ጌታውንም የሚጠብቅ ይከብራል።\n" +
                "19 ፊት በውኃ ላይ ለፊት እንደሚታይ፥ እንዲሁ የሰው ልብ ለሰው ይታያል።\n" +
                "20 ሲኦልና ጥፋት እንዳይጠግቡ፥ እንዲሁ የሰው ዓይን አይጠግብም።\n" +
                "21 ብር በከውር ወርቅም በማቅለጫ ይፈተናል፤ ሰውም በሚያመሰገኑት ሰዎች አፍ ይፈተናል።\n" +
                "22 ሰነፍን በሙቀጫ ውስጥ ከእህል ጋር በዘነዘና ብትወቅጠው፥ ስንፍናው ከእርሱ አይርቅም።\n" +
                "23 የበጎችህን መልክ አስተውለህ እወቅ፥ በከብቶችህም ላይ ልብህን አኑር፤\n" +
                "24 ባለጠግነት ለዘላለም አይኖርምና፥ ዘውድም ለትውልድ ሁሉ አይጸናምና።\n" +
                "25 ደረቅ ሣር በታጨደ ጊዜ፥ አዲስ ለምለም በታየ ጊዜ፥ ከተራራውም ቡቃያ በተሰበሰበ ጊዜ፥\n" +
                "26 በጎች ለልብስህ ፍየሎችም የእርሻ ዋጋ ይሆናሉ።\n" +
                "27 ለሲሳይህ ለቤተ ሰቦችህም ሲሳይ ለገረዶችህም ምግብ የፍየል ወተት ይበቃል።\n"));

        return new Chapter(27, verses);
    }

    private Chapter chapterTwentyEight() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ ኀጥእ ማንም ሳያሳድደው ይሸሻል፤ ጻድቅ ግን እንደ አንበሳ ያለ ፍርሃት ይኖራል።\n" +
                "2 ስለ አገሪቱ ዓመፀኝነት አለቆችዋ ብዙ ሆኑ፤ በአስተዋይና በአዋቂ ሰው ግን ዘመንዋ ይረዝማል።\n" +
                "3 ድሆችን የሚያስጨንቅ ምስኪን ሰው እህልን እንደሚያጠፋ እንደ ዶፍ ዝናብ ነው።\n" +
                "4 ሕግን የሚተዉ ሰዎች ኀጥኣንን ያመሰግናሉ፤ ሕግ ጠባቂዎች ግን ይጠሉአቸዋል።\n" +
                "5 ክፉዎች ሰዎች ፍርድን አያስተውሉም፤ እግዚአብሔርን የሚሹ ግን ሁሉን ያስተውላሉ።\n" +
                "6 በጠማማ መንገድ ከሚሄድ ባለጠጋ ያለ ነውር የሚሄድ ድሀ ይሻላል።\n" +
                "7 ሕግን የሚጠብቅ አስተዋይ ልጅ ነው፤ ምናምንቴዎችን የሚከተል ግን አባቱን ያሳፍራል።\n" +
                "8 በአራጣ ብዛትና በቅሚያ ሀብቱን የሚያበዛ ለድሀ ለሚራራ ያከማችለታል።\n" +
                "9 ሕግን ከመስማት ጆሮውን የሚመልስ ጸሎቱ አስጸያፊ ናት።\n" +
                "10 ቅኖችን በክፉ መንገድ የሚያስት፥ እርሱ ወደ ጕድጓዱ ይወድቃል፤ ፍጹማን ግን መልካም ነገርን ይወርሳሉ።\n" +
                "11 ባለጠጋ ሰው ለራሱ ጠቢብ የሆነ ይመስለዋል፤ አስተዋይ ድሀ ግን ይመረምረዋል።\n" +
                "12 ጻድቃን ድል ባደረጉ ጊዜ ብዙ ክብር አለ፤ ኀጥኣን ከፍ ከፍ ባሉ ጊዜ ግን ሰው ይሸሸጋል።\n" +
                "13 ኃጢአቱን የሚሰውር አይለማም፤ የሚናዘዝባትና የሚተዋት ግን ምሕረትን ያገኛል።\n" +
                "14 ሁልጊዜ የሚፈራ ሰው ምስጉን ነው፤ ልቡን የሚያጸና ግን በክፉ ላይ ይወድቃል።\n" +
                "15 በድሀ ሕዝብ ላይ የሚገዛ ክፉ መኰንን እንደሚያገሣ አንበሳን እንደ ተራበ ድብ ነው።\n" +
                "16 አእምሮ የጐደለው መኰንን ትልቅ ግፈኛ ነው፤ ግፍን የሚጠላ ግን ብዙ ዘመን ይኖራል።\n" +
                "17 የሰው ደም ያለበት ሰው እንደ ጕድጓድ ይሸሻል፥ ማንም አያስጠጋውም።\n" +
                "18 በቅንነት የሚሄድ ይድናል፤ በጠማምነት የሚሄድ ግን ወዲያው ይወድቃል።\n" +
                "19 ምድሩን የሚያርስ እንጀራ ይጠግባል፤ ምናምንቴዎችን የሚከተል ግን ድህነት ይሞላበታል።\n" +
                "20 የታመነ ሰው እጅግ ይባረካል፤ ባለጠጋ ለመሆን የሚቸኵል ግን ሳይቀጣ አይቀርም።\n" +
                "21 ማድላት፥ በቍራሽ እንጀራም መበደል መልካም አይደለም።\n" +
                "22 ምቀኛ ሰው ባለጠጋ ለመሆን ይቸኵላል ችጋርም እንደሚመጣበት አያውቅም።\n" +
                "23 ምላሱን ከሚያጣፍጥ ይልቅ ሰውን የሚገሥጽ በኋላ ሞገስ ያገኛል።\n" +
                "24 ከአባቱና ከእናቱ የሚሰርቅ። ኃጢአትን አልሠራሁም የሚልም የአጥፊ ባልንጀራ ነው።\n" +
                "25 የሚጐመጅ ሰው ክርክርን ያነሣሣል፤ በእግዚአብሔር የሚታመን ግን ይጠግባል።\n" +
                "26 በገዛ ልቡ የሚታመን ሰው ሰነፍ ነው፤ በጥበብ የሚሄድ ግን ይድናል።\n" +
                "27 ለድሀ የሚሰጥ አያጣም፤ ዓይኖቹን የሚጨፍን ግን እጅግ ይረገማል።\n" +
                "28 ኀጥአን በተነሡ ጊዜ ሰዎች ይሸሸጋሉ፤ እነርሱ በጠፉ ጊዜ ግን ጻድቃን ይበዛሉ።\n"));

        return new Chapter(28, verses);
    }

    private Chapter chapterTwentyNine() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "1 ፤ ብዙ ጊዜ ተዘልፎ አንገቱን ያደነደነ ድንገት ይሰበራል፥ ፈውስም የለውም።\n" +
                "2 ጻድቃን በበዙ ጊዜ ሕዝብ ደስ ይለዋል፤ ኀጥኣን በሠለጠኑ ጊዜ ግን ሕዝብ ያለቅሳል።\n" +
                "3 ጥበብን የወደደ ሰው አባቱን ደስ ያሰኛል፤ ጋለሞቶችን የሚከተል ግን ሀብቱን ያጠፋል።\n" +
                "4 ንጉሥ በፍርድ አገሩን ያጸናል፤ መማለጃ የሚወድድ ግን ያፈርሰዋል።\n" +
                "5 ወዳጁን በለዘበ ቃል የሚናገር ሰው ለእግሩ መርበብን ይዘረጋል።\n" +
                "6 በክፉ ሰው ዓመፃ ወጥመድ ይገኛል፤ ጻድቅ ግን ደስ ይለዋል፥ እልልም ይላል።\n" +
                "7 ጻድቅ የድሆችን ፍርድ ይመለከታል፤ ኀጥእ ግን እውቀትን አያስተውልም።\n" +
                "8 ፌዘኞች ከተማቸውን ያቃጥላሉ፤ ጠቢባን ግን ቍጣን ይመልሳሉ።\n" +
                "9 ጠቢብ ከሰነፍ ጋር ቢጣላ፥ ሰነፍ ወይም ይቈጣል ወይም ይስቃል፥ ዕረፍትም የለም።\n" +
                "10 ደምን ለማፍሰስ የሚሹ ሰዎች ፍጹሙን ሰው ይጠላሉ፥ ደግሞም የቅኑን ሰው ነፍስ ይሻሉ።\n" +
                "11 ሰነፍ ሰው ቍጣውን ሁሉ ያወጣል፤ ጠቢብ ግን በውስጡ ያስቀረዋል።\n" +
                "12 መኰንን ሐሰተኛ ነገርን ቢያደምጥ፥ ከእርሱ በታች ያሉት ሁሉ ዓመፅኞች ይሆናሉ።\n" +
                "13 ድሀና ግፈኛ ተገናኙ፤ እግዚአብሔር የሁለቱንም ዓይን ያበራል።\n" +
                "14 ለድሀ በእውነት የሚፈርድ ንጉሥ፥ ዙፋኑ ለዘላለም ይጸናል።\n" +
                "15 በትርና ተግሣጽ ጥበብን ይሰጣሉ፤ ያልተቀጣ ብላቴና ግን እናቱን ያሳፍራል።\n" +
                "16 ኀጥኣን ሲበዙ ኃጢአት ትበዛለች፤ ጻድቃን ግን ውደቀታቸውን ያያሉ።\n" +
                "17 ልጅህን ቅጣ ዕረፍትንም ይሰጥሃል፤ ለነፍስህም ተድላን ይሰጣታል።\n" +
                "18 ራእይ ባይኖር ሕዝብ መረን ይሆናል፤ ሕግን የሚጠብቅ ግን የተመሰገነ ነው።\n" +
                "19 ባሪያ በቃል አይገሠጽም፤ ቢያስተውል እንኳ አይመልስምና።\n" +
                "20 በቃሉ የሚቸኵለውን ሰው ብታይ፥ ከእርሱ ይልቅ ለሰነፍ ተስፋ አለው።\n" +
                "21 ባሪያውን ከሕፃንነቱ ጀምሮ በማቀማጠል የሚያሳድግ የኋላ ኋላ እንደ ጌታ ያደርገዋል።\n" +
                "22 ቍጡ ሰው ክርክርን ያነሣሣል። ወፈፍተኛ ሰውም ኃጢአትን ያበዛል።\n" +
                "23 ሰውን ትዕቢቱ ያዋርደዋል፤ መንፈሱን የሚያዋርድ ግን ክብርን ይቀበላል።\n" +
                "24 ከሌባ ጋር የሚካፈል ነፍሱን ይጠላል፤ መርገምን ይሰማል፥ ነገር ግን ምንም አይገልጥም።\n" +
                "25 ሰውን መፍራት ወጥመድ ያመጣል፤ በእግዚአብሔር የሚታመን ግን እርሱ ይጠበቃል።\n" +
                "26 ብዙ ሰዎች የሹምን ፊት ይሻሉ፤ የሰው ፍርድ ግን ከእግዚአብሔር ዘንድ ነው።\n" +
                "27 ኃጢአተኛ በጻድቃን ዘንድ አስጸያፊ ነው፤ በቀና መንገድ የሚሄደውም በኀጥኣን ዘንድ አስጸያፊ ነው።\n"));

        return new Chapter(29, verses);
    }

    private Chapter chapterThirty() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ የማሣ አገር ሰው የያቄ ልጅ የአጉር ቃል ሰውየው ለኢቲኤልና ለኡካል እንደዚህ ይናገራል።\n" +
                "2 እኔ በእውነት ከሰው ሁሉ ይልቅ ደንቆሮ ነኝ፥ የሰውም ማስተዋል የለብኛም።\n" +
                "3 ጥበብንም አልተማርሁም፥ ቅዱሱንም አላወቅሁትም።\n" +
                "4 ወደ ሰማይ የወጣ የወረደስ ማን ነው? ነፋስንስ በእጁ የጨበጠ ማን ነው? ውኃንስ በልብሱ የቋጠረ ማን ነው? የምድርን ዳርቻ ሁሉ ያጸና ማን ነው? ይህን ታውቅ እንደ ሆንህ፥ ስሙ ማን የልጁስ ስም ማን ነው?\n" +
                "5 የእግዚአብሔር ቃል ሁሉ ተፈትናለች፤ እርሱ ለሚታመኑት ጋሻ ነው።\n" +
                "6 እንዳይዘልፍህ፥ ሐሰተኛም እንዳትሆን በቃሉ አንዳች አትጨምር።\n" +
                "7 ሁለትን ነገር ከአንተ እሻለሁ፥ ሳልሞትም አትከልክለኝ፤\n" +
                "8 ከንቱነትንና ሐሰተኛነትን ከእኔ አርቃቸው፤ ድኅነትንና ባለጠግነትን አትስጠኝ፤ ነገር ግን የሚያስፈልገኝን እንጀራ ስጠኝ፥\n" +
                "9 እንዳልጠግብ እንዳልክድህም። እግዚአብሔርስ ማን ነው? እንዳልል፤ ድሀም እንዳልሆን እንዳልሰርቅም፥ በአምላኬም ስም በሐሰት እንዳልምል።\n" +
                "10 እንዳይሰድብህ በደለኛም እንዳትሆን ባሪያን በጌታው ፊት አትማ።\n" +
                "11 አባቱን የሚረግም፥ እናቱንም የማይባርክ ትውልድ አለ።\n" +
                "12 ለራሱ ንጹሕ የሆነ የሚመስለው ከርኵሰቱ ያልጠራ ትውልድ አለ።\n" +
                "13 ከፍ ከፍ ያሉ ዓይኖች ያሉት፥ ሽፋሽፍቶቹም ወደ ላይ የሚያዩ ትውልድ አለ።\n" +
                "14 ድሆችን ከምድር ላይ ችግረኞችንም ከሰው መካከል ያጠፋና ይጨርስ ዘንድ ጥርሶቹ ሰይፍ መንጋጎቹም ካራ የሆኑ ትውልድ አለ።\n" +
                "15 አልቅት። ስጠን ስጠን የሚሉ ሁለት ሴቶች ልጆች አሉት። ሦስቱ የማይጠግቡ አራቱም። በቃን የማይሉ ናቸው፤\n" +
                "16 እነርሱም ሲኦልና የማትወልድ ማኅፀን ውኃ የማትጠግብ ምድርና። በቃኝ የማትል እሳት ናቸው።\n" +
                "17 በአባትዋ የምታላግጥን የእናትዋንም ትእዛዝ የምትንቅን ዓይን የሸለቆ ቍራዎች ይጐጠጕጡአታል፥ አሞራዎችም ይበሉአታል።\n" +
                "18 ሦስት ነገር ይገርመኛል፥ አራተኛውንም ከቶ አላስተውለውም።\n" +
                "19 እነርሱም የንስር መንገድ በሰማይ፥ የእባብ መንገድ በድንጋይ ላይ፥ የመርከብ መንገድ በባሕር ላይ፥ የሰውም መንገድ ከቈንጆ ጋር ናቸው።\n" +
                "20 እንዲሁ በልታ አፍዋን የምታብስ። አንዳች ክፉ ነገር አላደረግሁም የምትልም የአመንዝራ ሴት መንገድ ናት።\n" +
                "21 በሦስት ነገር ምድር ትናወጣለች፥ አራተኛውንም ትሸከም ዘንድ አይቻላትም።\n" +
                "22 ባሪያ በነገሠ ጊዜ ሰነፍም እንጀራ በጠገበ ጊዜ፥\n" +
                "23 የተጠላች ሴት ባል ባገኘች ጊዜ፥ ሴት ባሪያም እመቤቷን በወረሰች ጊዜ።\n" +
                "24 በምድር ላይ አራት ጥቃቅን ፍጥረቶች አሉ፤ እነርሱ ግን እጅግ ጠቢባን ናቸው፤\n" +
                "25 ገብረ ጕንዳን ኃይል የሌላቸው ሕዝቦች ናቸው፥ ነገር ግን በበጋ መኖዋቸዋን ይሰበስባሉ።\n" +
                "26 ሽኮኮዎች ያልበረቱ ሕዝቦች ናቸው፥ ቤታቸውን ግን በቋጥኝ ድንጋይ ውስጥ ያደርጋሉ።\n" +
                "27 አንበጣዎች ንጉሥ የላቸውም፥ ሁላቸው ግን በመልካም ሥርዓት ይሄዳሉ።\n" +
                "28 እንሽላሊት በእጅ ይያዛል፥ በነገሥታት ግቢ ግን ይኖራል።\n" +
                "29 መልካም አረማመድን የሚራመዱ ሦስት ፍጥረቶች አሉ፥ አራተኛውም መልካም አካሄድን ይሄዳል፤\n" +
                "30 የአንበሳ ደቦል ከእንስሳ ሁሉ የሚበረታ፥ የማይመለስ፥ እንስሳንም የማይፈራ፤\n" +
                "31 በእንስቶች መካከል በድፍረት የሚራመድ አውራ ዶሮ፤ መንጋን የምመራ አውራ ፍየል፤ በሕዝብ ፊት በግልጥ የሚናገር ንጉሥ።\n" +
                "32 ከፍ ከፍ ስትል ስንፍናን ያደረግህ እንደሆነ፥ ክፉም ያሰብህ እንደ ሆነ፥ እጅህን በአፍህ ላይ ጫን።\n" +
                "33 ወተት መግፋት ቅቤን ያወጣል፥ አፍንጫንም መጭመቅ ደምን ያወጣ፤ እንዲሁም ቍጣን መጐተት ጠብን ያወጣል።\n"));

        return new Chapter(30, verses);
    }
    private Chapter chapterThirtyOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","1 ፤ እናቱ እርሱን ያስተማረችበት የማሣ ንጉሥ የልሙኤል ቃል።\n" +
                "2 ልጄ ሆይ፥ ምንድር ነው? የሆዴ ልጅ ሆይ፥ ምንድር ነው? የስእለቴ ልጅ ሆይ፥ ምንድር ነው?\n" +
                "3 ጕልበትህን ለሴቶች አትስጥ፥ መንገድህንም ነገሥታትን ለሚያጠፉ።\n" +
                "4 ለነገሥታት አይገባም፥ ልሙኤል ሆይ፥ ነገሥታት የወይን ጠጅ ይጠጡ ዘንድ አይገባም። መሳፍንትም። ብርቱ መጠጥ ወዴት ነው? ይሉ ዘንድ፤\n" +
                "5 እንዳይጠጡና ሕግን እንዳይረሱ፥ የድሀ ልጆችንም ፍርድ እንዳያጐድሉ።\n" +
                "6 ለጥፋት ለቀረበው ሰው ብርቱ መጠጥ ስጡት፥ ነፍሱ ለመረረውም የወይን ጠጅ ስጡት፤\n" +
                "7 ይጠጣ ድህነቱንም ይርሳ፥ ጕስቍልናውንም ከእንግዲህ ወዲህ አያስብ።\n" +
                "8 አፍህን ስለ ዲዳው ክፈት፥ ተስፋ ስለሌላቸውም ሁሉ ተፋረድ።\n" +
                "9 አፍህን ክፍት፥ በእውነትም ፍረድ፤ ለድሀና ለምስኪን ፍረድ።\n" +
                "10 ልባም ሴትን ማን ሊያገኛት ይችላል? ዋጋዋ ከቀይ ዕንቍ እጅግ ይበልጣል።\n" +
                "11 የባልዋ ልብ ይታመንባታል። ምርኮም አይጐድልበትም።\n" +
                "12 ዕድሜዋን ሙሉ መልካም ታደርግለታለች፥ ክፉም አታደርግም።\n" +
                "13 የበግ ጠጕርና የተልባ እግር ትፈልጋለች፥ በእጆችዋም ደስ ብሎአት ትሠራለች።\n" +
                "14 እርስዋ እንደ ነጋዴ መርከብ ናት፤ ከሩቅ አገር ምግብዋን ትሰበስባለች።\n" +
                "15 ገና ሌሊት ሳለ ትነሣለች ለቤትዋም ሰዎች ምግባቸውን፥ ለገረዶችዋም ተግባራቸውን ትሰጣለች።\n" +
                "16 እርሻንም ተመልክታ ትገዛለች፤ ከእጅዋም ፍሬ ወይን ትተክላለች።\n" +
                "17 ወገብዋን በኃይል ትታጠቃለች፥ ክንድዋንም ታበረታለች።\n" +
                "18 ንግድዋ መልካም እንደ ሆነ ትመለከታለች፤ መብራትዋ በሌሊት አይጠፋም።\n" +
                "19 እጅዋን ወደ አመልማሎ ትዘረጋለች፥ ጣቶችዋም እንዝርትን ይይዛሉ።\n" +
                "20 እጅዋን ወደ ድሀ ትዘረጋለች፥ ወደ ችግረኛም እጅዋን ትሰድዳለች።\n" +
                "21 ለቤትዋ ሰዎች ከበረዶ ብርድ የተነሣ አትፈራም፥ የቤትዋ ሰዎች ሁሉ እጥፍ ድርብ የለበሱ ናቸውና።\n" +
                "22 ለራስዋም ግብረ መርፌ ስጋጃ ትሠራለች ጥሩ በፍታና ቀይ ግምጃ ትለብሳለች።\n" +
                "23 ባልዋ በአገር ሽማግሌዎች መካከል በሸንጎ በተቀመጠ ጊዜ በበር የታወቀ ይሆናል።\n" +
                "24 የበፍታ ቀሚስ እየሠራች ትሸጣለች፥ ለነጋዴም ድግ ትሸጣለች።\n" +
                "25 ብርታትና ከበሬታ ልብስዋ ነው፤ በኋላም ዘመን ላይ ትስቃለች።\n" +
                "26 አፍዋን በጥበብ ትከፍታለች፤ የርኅራኄም ሕግ በምላስዋ አለ።\n" +
                "27 የቤትዋንም ሰዎች አካሄድ በደኅና ትመለከታለች፥ የሀኬትንም እንጀራ አትበላም።\n" +
                "28 ልጆችዋ ይነሣሉ፥ ምስጋናዋንም ይናገራሉ፤ ባልዋ ደግሞ እንዲህ ብሎ ያመሰግናታል።\n" +
                "29 መልካም ያደረጉ ብዙ ሴቶች አሉ፥ አንቺ ግን ከሁሉ ትበልጫለሽ።\n" +
                "30 ውበት ሐሰት ነው፥ ደም ግባትም ከንቱ ነው፤ እግዚአብሔርን የምትፈራ ሴት ግን እርስዋ ትመሰገናለች።\n" +
                "31 ከእጅዋ ፍሬ ስጡአት፥ ሥራዎችዋም በሸንጎ ያመስግኑአት።"));
        // Add more verses as needed
        return new Chapter(31, verses);
    }
}
