package com.example.bibleapp.books.added;

import com.example.bibleapp.models.Book;
import com.example.bibleapp.models.Chapter;
import com.example.bibleapp.models.Verse;

import java.util.ArrayList;
import java.util.List;

public class ZECHARIAH {
    private Book ZECHARIAHBook;

    public ZECHARIAH() {
        List<Chapter> chapters = new ArrayList<>();
        chapters.add(chapterOne());
        chapters.add(chapterTwo());
        chapters.add(chapterThree());
        chapters.add(chapterFour());
        chapters.add(chapterFive());
        chapters.add(chapterSix());
        chapters.add(chapterSeven());
        chapters.add(chapterEight());
        chapters.add(chapterNine());
        chapters.add(chapterTen());
        chapters.add(chapterEleven());
        chapters.add(chapterTwelve());
        chapters.add(chapterThirteen());
        chapters.add(chapterFourteen());
 
        ZECHARIAHBook = new Book("ትንቢተ ዘካርያስ", chapters);
    }

    public Book getZECHARIAHBook() {
        return ZECHARIAHBook;
    }

    private Chapter chapterOne() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","በዳርዮስ በሁለተኛው ዓመት በስምንተኛው ወር የእግዚአብሔር ቃል ወደ አዶ ልጅ ወደ በራክዩ ልጅ ወደ ነቢዩ ወደ ዘካርያስ እንዲህ ሲል መጣ።  \n" +   
                "2 ፤ እግዚአብሔር በአባቶቻችሁ ላይ እጅግ ተቈጥቶ ነበር።  \n" +   
                "3 ፤ ስለዚህ እንዲህ በላቸው። የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። ወደ እኔ ተመለሱ፥ ይላል የሠራዊት ጌታ እግዚአብሔር፥ እኔም ወደ እናንተ እመለሳለሁ፥ ይላል የሠራዊት ጌታ እግዚአብሔር።  \n" +   
                "4 ፤ የቀደሙት ነቢያት ለአባቶቻችሁ እንዲህ ብለው ሰብከዋል። የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። ከክፉ መንገዳችሁና ከክፉ ሥራችሁ ተመለሱ፤ እነርሱ ግን አልሰሙም፥ እኔንም አላደመጡም፤ እንደ እነርሱ አትሁኑ፥ ይላል እግዚአብሔር።  \n" +   
                "5 ፤ አባቶቻችሁ ወዴት ናቸው? ነቢያትስ ለዘላለም በሕይወት ይኖራሉን?  \n" +   
                "6 ፤ ለባሪያዎቼስ ለነቢያት ያዘዝኋቸው ቃሎቼና ሥርዓቴ በአባቶቻችሁ ላይ አልደረሱምን? እነርሱም ተመልሰው። የሠራዊት ጌታ እግዚአብሔር በመንገዳችንና በሥራችን መጠን ያደርግብን ዘንድ እንዳሰበ እንዲሁ አድርጎብናል አሉ።  \n" +   
                "7 ፤ በዳርዮስ በሁለተኛው ዓመት ሳባጥ በሚባል በአሥራ አንደኛው ወር በሀያ አራተኛው ቀን የእግዚአብሔር ቃል ወደ አዶ ልጅ ወደ በራክዩ ልጅ ወደ ነቢዩ ወደ ዘካርያስ እንዲህ ሲል መጣ።  \n" +   
                "8 ፤ እነሆም፥ አንድ ሰው በመጋላ ፈረስ ተቀምጦ በሌሊት አየሁ፥ እርሱም በሸለቆው ውስጥ ባሉ በባርሰነት ዛፎች መካከል ቆሞ ነበር፤ በስተ ኋላውም መጋላና ሐመር አንባላይም ፈረሶች ነበሩ።  \n" +   
                "9 ፤ እኔም። ጌታዬ ሆይ፥ እነዚህ ምንድር ናቸው? አልሁ። ከእኔም ጋር ይነጋገር የነበረው መልአክ። እነዚህ ምን እንደ ሆኑ አሳይሃለሁ አለኝ።  \n" +   
                "10 ፤ በባርሰነት ዛፎች መካከልም ቆሞ የነበረው ሰው። እነዚህ በምድር ላይ ይመላለሱ ዘንድ እግዚአብሔር የላካቸው ናቸው ብሎ መለሰ።  \n" +   
                "11 ፤ በባርሰነት ዛፎች መካከልም ቆሞ የነበረውን የእግዚአብሔርን መልአክ። በምድር ላይ ተመላለስን፥ እነሆም፥ ምድር ሁሉ ዝም ብላ ዐርፋ ተቀምጣለች ብለው መለሱለት።  \n" +   
                "12 ፤ የእግዚአብሔርም መልአክ መልሶ። አቤቱ፥ የሠራዊት ጌታ ሆይ፥ እነዚህ ሰባ ዓመት የተቈጣሃቸውን ኢየሩሳሌምንና የይሁዳን ከተሞች የማትምራቸው እስከ መቼ ነው? አለ።  \n" +   
                "13 ፤ እግዚአብሔርም መልሶ ከእኔ ጋር ይነጋገር ለነበረው መልአክ በመልካምና በሚያጽናና ቃል ተናገረው።  \n" +   
                "14 ፤ ስለዚህም ከእኔ ጋር ይነጋገር የነበረው መልአክ እንዲህ አለኝ። ስበክ እንዲህም በል። የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። እኔ በታላቅ ቅንዓት በኢየሩሳሌምና በጽዮን ቀንቻለሁ።  \n" +   
                "15 ፤ እኔ ጥቂት ብቻ ተቈጥቼ ሳለሁ እነርሱ ክፋትን ስላገዙት፥ ባልተቸገሩት አሕዛብ ላይ እጅግ ተቈጥቻለሁ።  \n" +   
                "16 ፤ ስለዚህ እግዚአብሔር እንዲህ ይላል። ወደ ኢየሩሳሌም በምሕረት ተመልሻለሁ፤ ቤቴ ይሠራባታል፤ በኢየሩሳሌምም ላይ ገመድ ይዘረጋበታል፥ ይላል የሠራዊት ጌታ እግዚአብሔር።  \n" +   
                "17 ፤ ደግሞም እንዲህ ስትል ስበክ። የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። ከተሞቼ ደግሞ በበጎ ነገር ይረካሉ፤ እግዚአብሔርም ደግሞ ጽዮንን ያጽናናል፥ ኢየሩሳሌምንም ደግሞ ይመርጣል።  \n" +   
                "18 ፤ ዓይኖቼንም አንሥቼ እነሆ፥ አራት ቀንዶች አየሁ።  \n" +   
                "19 ፤ ከእኔም ጋር ይነጋገር የነበረውን መልአክ። እነዚህ ምንድር ናቸው? አልሁት። እርሱም። እነዚህ ይሁዳንና እስራኤልን ኢየሩሳሌምንም የበተኑ ቀንዶች ናቸው ብሎ መለሰልኝ።  \n" +   
                "20 ፤ እግዚአብሔርም አራት ጠራቢዎች አሳየኝ።  \n" +   
                "21 ፤ እኔም። እነዚህ የመጡት ምን ሊሠሩ ነው? አልሁ። እርሱም። አንድ ሰው ራሱን እስከማያነሣ ድረስ እነዚህ ቀንዶች ይሁዳን የበተኑ ናቸው፤ እነዚህ ግን ሊያስፈራሩአቸው፥ የይሁዳንም አገር ይበትኑ ዘንድ ቀንዳቸውን ያነሡትን የአሕዛብን ቀንዶች ሊጥሉ መጥተዋል ብሎ ተናገረ።"));

        return new Chapter(1, verses);
    }

    private Chapter chapterTwo() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ዓይኖቼንም አነሣሁ፤ እነሆም፥ በእጁ የመለኪያ ገመድ የያዘ አንድ ሰውን አየሁ።  \n" +   
                "2 ፤ እኔም። አንተ ወዴት ትሄዳለህ? አልሁ። እርሱም። የኢየሩሳሌምን ወርድና ርዝመት ስንት መሆኑን ሰፍሬ አይ ዘንድ እሄዳለሁ አለኝ።  \n" +   
                "3 ፤ እነሆም፥ ከእኔ ጋር ይነጋገር የነበረው መልአክ ወጣ፥ ሌላም መልአክ ሊገናኘው ወጣ፥  \n" +   
                "4 ፤ እንዲህም አለው። ሩጥ፥ ይህንም ጕልማሳ እንዲህ በለው። ኢየሩሳሌም በውስጥዋ ካሉት ሰዎችና እንስሶች ብዛት የተነሣ ቅጥር እንደሌላቸው መንደሮች ሆና ትኖራለች።  \n" +   
                "5 ፤ እኔ በዙሪያዋ የእሳት ቅጥር እሆንላታለሁ፥ በውስጥዋም ክብርን እሆናለሁ፥ ይላል እግዚአብሔር።  \n" +   
                "6 ፤ እናንተ ሆይ፥ ከሰሜን ምድር ሽሹ፥ ይላል እግዚአብሔር፤ እንደ አራቱ የሰማይ ነፍሳት በትኛችኋለሁና፥ ይላል እግዚአብሔር።  \n" +   
                "7 ፤ አንቺ ከባቢሎን ሴት ልጅ ጋር የምትኖሪ ጽዮን ሆይ፥ ኰብልዪ።  \n" +   
                "8 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላልና። ከክብሩ በኋላ ወደ በዘበዙአችሁ አሕዛብ ልኮኛል፤ የሚነካችሁ የዓይኑን ብሌን የሚነካ ነውና።  \n" +   
                "9 ፤ እነሆ፥ እጄን በላያቸው አወዛውዛለሁ፥ ተገዝተው ለነበሩት ብዝበዛ ይሆናሉ፤ የሠራዊት ጌታ እግዚአብሔርም እንደ ላከኝ ታውቃላችሁ።  \n" +   
                "10 ፤ የጽዮን ልጅ ሆይ፥ እነሆ፥ መጥቼ በመካከልሽ እኖራለሁና ዘምሪ ደስም ይበልሽ፥ ይላል እግዚአብሔር።  \n" +   
                "11 ፤ በዚያም ቀን ብዙ አሕዛብ ወደ እግዚአብሔር ይጠጋሉ፥ ሕዝብም ይሆኑኛል፤ በመካከልሽም እኖራለሁ፥ የሠራዊት ጌታ እግዚአብሔርም ወደ አንቺ እንደ ላከኝ ታውቂአለሽ።  \n" +   
                "12 ፤ እግዚአብሔርም ይሁዳን እድል ፈንታው አድርጎ በተቀደሰችው ምድር ይወርሰዋል፥ ኢየሩሳሌምንም ዳግመኛ ይመርጣል።  \n" +   
                "13 ፤ እግዚአብሔር ከተቀደሰ ማደሪያው ነቅቶአልና ሥጋ ለባሽ ሁሉ ሆይ፥ በፊቱ ዝም በል።"));
        return new Chapter(2, verses);
    }

    private Chapter chapterThree() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "እርሱም ታላቁን ካህን ኢያሱን በእግዚአብሔር መልአክ ፊት ቆሞ አሳየኝ፥ ሰይጣንም ይከስሰው ዘንድ በስተ ቀኙ ቆሞ ነበር።  \n" +   
                "2 ፤ እግዚአብሔርም ሰይጣንን። ሰይጣን ሆይ፥ እግዚአብሔር ይገሥጽህ፤ ኢየሩሳሌምን የመረጠ እግዚአብሔር ይገሥጽህ፤ በውኑ ይህ ከእሳት የተነጠቀ ትንታግ አይደለምን? አለው።  \n" +   
                "3 ፤ ኢያሱም እድፋም ልብስ ለብሶ በመልአኩ ፊት ቆሞ ነበር። እርሱም መልሶ በፊቱ የቆሙትን። እድፋሙን ልብስ ከእርሱ ላይ አውልቁ አላቸው። እርሱንም። እነሆ፥ አበሳህን ከአንተ አርቄአለሁ፥ ጥሩ ልብስም አለብስሃለሁ አለው።  \n" +   
                "4  \n" +   
                "5 ፤ ደግሞ። ንጹሕ ጥምጥም በራሱ ላይ አድርጉ አለ። እነርሱም በራሱ ላይ ንጹሕ ጥምጥም አደረጉ፥ ልብስንም አለበሱት፤ የእግዚአብሔርም መልአክ በአጠገቡ ቆሞ ነበር።  \n" +   
                "6 ፤ የእግዚአብሔርም መልአክ በኢያሱ እንዲህ ሲል አዳኘበት።  \n" +   
                "7 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። በመንገዴ ብትሄድ ትእዛዜንም ብትጠብቅ፥ በቤቴ ላይ ትፈርዳለህ፥ አደባባዮቼንም ትጠብቃለህ፥ በዚህም ከቆሙት ከእነዚህ ጋር መግባትን እሰጣለሁ።  \n" +   
                "8 ፤ ታላቁ ካህን ኢያሱ ሆይ፥ ስማ፤ በፊትህም የሚቀመጡት ባልንጀሮችህ ለምልክት የሚሆኑ ሰዎች ናቸውና ይስሙ፤ እነሆ፥ እኔ ባሪያዬን ቍጥቋጥ አወጣለሁ።  \n" +   
                "9 ፤ በኢያሱ ፊት ያኖርሁት ድንጋይ እነሆ አለ፤ በአንዱ ድንጋይ ላይ ሰባት ዓይኖች አሉ፤ እነሆ፥ ቅርጹን እቀርጻለሁ፥ ይላል የሠራዊት ጌታ እግዚአብሔር፥ የዚያችንም ምድር በደል በአንድ ቀን አስወግዳለሁ።  \n" +   
                "10 ፤ በዚያ ቀን፥ ይላል የሠራዊት ጌታ እግዚአብሔር፥ እያንዳንዱ ከወይኑና ከበለሱ በታች ሆኖ ባልንጀራውን ይጠራል።"));

        return new Chapter(3, verses);
    }

    private Chapter chapterFour() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1","ከእኔም ጋር ይነጋገር የነበረው መልአክ ተመልሶ ከእንቅልፉ እንደሚነቃ ሰው አነቃኝ።  \n" +   
                "2 ፤ እርሱም። የምታየው ምንድር ነው? አለኝ። እኔም። እነሆ፥ ሁለንተናው ወርቅ የሆነውን መቅረዝ አየሁ፤ የዘይትም ማሰሮ በራሱ ላይ ነበረ፥ ሰባትም መብራቶች ነበሩበት፤ በራሱም ላይ ለነበሩት መብራቶች ሰባት ቧንቧዎች ነበሩአቸው።  \n" +   
                "3 ፤ ሁለት የወይራ ዛፎች፥ አንዱ በማሰሮው በስተ ቀኝ አንዱም በስተ ግራው ሆነው፥ በአጠገቡ ነበሩ አልሁ።  \n" +   
                "4 ፤ ከእኔ ጋር ይነጋገር ለነበረውም መልአክ መልሼ። ጌታዬ ሆይ፥ እነዚህ ምንድር ናቸው? አልሁት።  \n" +   
                "5 ፤ ከእኔ ጋር ይነጋገር የነበረውም መልአክ መልሶ። እነዚህ ምን እንደ ሆኑ አታውቅምን? አለኝ። እኔም። ጌታዬ ሆይ፥ አላውቅም አልሁ።  \n" +   
                "6 ፤ መልሶም። ለዘሩባቤል የተባለው የእግዚአብሔር ቃል ይህ ነው። በመንፈሴ እንጂ በኃይልና በብርታት አይደለም፥ ይላል የሠራዊት ጌታ እግዚአብሔር።  \n" +   
                "7 ፤ ታላቅ ተራራ ሆይ፥ አንተ ምንድር ነህ? በዘሩባቤል ፊት ደልዳላ ሜዳ ትሆናለህ፤ ሰዎችም። ሞገስ፥ ሞገስ ይሁንለት ብለው እየጮኹ እርሱ መደምደሚያውን ድንጋይ ያወጣል ብሎ ተናገረኝ።  \n" +   
                "8 ፤ የእግዚአብሔርም ቃል ወደ እኔ እንዲህ ሲል መጣ።  \n" +   
                "9 ፤ የዘሩባቤል እጆች ይህን ቤት መሠረቱ፥ የእርሱም እጆች ይፈጽሙታል፤ የሠራዊት ጌታ እግዚአብሔርም ወደ እናንተ እንደ ላከኝ ታውቃላችሁ።  \n" +   
                "10 ፤ የጥቂቱን ነገር ቀን የናቀ ማን ነው? እነዚህ ሰባቱ ደስ ብሎአቸው በዘሩባቤል እጅ ቱንቢውን ያያሉ፤ እነዚህም በምድር ሁሉ የሚዘዋወሩ የእግዚአብሔር ዓይኖች ናቸው።  \n" +   
                "11 ፤ እኔም መልሼ። በመቅረዙ በስተ ቀኝና በስተ ግራ ያሉ እነዚህ ሁለት የወይራ ዛፎች ምንድር ናቸው? አልሁት።  \n" +   
                "12 ፤ ሁለተኛም መልሼ። በሁለቱ የወርቅ ቧንቧዎች አጠገብ ሆነው የወርቁን ዘይት የሚያፈስሱ እነዚህ ሁለት የወይራ ቅርንጫፎች ምንድር ናቸው? አልሁት።  \n" +   
                "13 ፤ እርሱም መልሶ። እነዚህ ምን እንደ ሆኑ አታውቅምን? አለኝ። እኔም ። ጌታዬ ሆይ፥ አላውቅም አልሁት።  \n" +   
                "14 ፤ እርሱም። በምድር ሁሉ ጌታ አጠገብ የቆሙት ሁለቱ የተቀቡት እነዚህ ናቸው አለኝ።"));

        return new Chapter(4, verses);
    }

    private Chapter chapterFive() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ተመልሼም ዓይኖቼን አነሣሁ፥ እነሆም፥ አንድ በራሪ የመጽሐፍ ጥቅልል አየሁ።  \n" +   
                "2 ፤ እርሱም። የምታየው ምንድር ነው? አለኝ። እኔም። በራሪ የመጽሐፍ ጥቅልል አያለሁ፤ ርዝመቱ ሀያ ክንድ ወርዱም አሥር ክንድ ነው አልሁ።  \n" +   
                "3 ፤ እንዲህም አለኝ። ይህ በምድር ፊት ሁሉ ላይ የሚወጣው እርግማን ነው፤ የሚሰርቅ ሁሉ በእርሱ ላይ በዚህ በኩል እንደ ተጻፈው ሁሉ ይጠፋል፥ በሐሰት የሚምልም ሁሉ በእርሱ ላይ በዚያ በኩል እንደ ተጻፈው ሁሉ ይጠፋል።  \n" +   
                "4 ፤ እኔ አስወጣዋለሁ፥ ይላል የሠራዊት ጌታ እግዚአብሔር፥ ወደ ሚሰርቀውም ቤት፥ በሐሰትም በስሜ ወደሚምለው ቤት ይገባል፤ በቤቱም ውስጥ ይኖራል፥ እርሱንም፥ እንጨቱንና ድንጋዩን፥ ይበላል።  \n" +   
                "5 ፤ ከእኔም ጋር ይነጋገር የነበረው መልአክ ወጥቶ። ዓይኖችህን አንሣ፥ ይህችም የምትወጣው ምን እንደ ሆነች እይ አለኝ።  \n" +   
                "6 ፤ እኔም። ምንድር ናት? አልሁ። እርሱም። ይህች የምትወጣው የኢፍ መስፈሪያ ናት አለኝ። ደግሞም። በምድር ሁሉ ላይ ያለ በደላቸው ይህ ነው አለ።  \n" +   
                "7 ፤ እነሆም፥ የእርሳሱን መክሊት አነሡት፤ እነሆም፥ በኢፍ መስፈሪያው ውስጥ አንዲት ሴት ተቀምጣ ነበር።  \n" +   
                "8 ፤ እርሱም። ይህች ክፋት ናት አለኝ፤ በኢፍ መስፈሪያው ውስጥ ጣላት፥ የእርሳሱንም ጠገራ በመስፈሪያ አፍ ላይ ጣለ።  \n" +   
                "9 ፤ ዓይኖቼንም አንሥቼ አየሁ፥ እነሆም፥ ሁለት ሴቶች ወጡ፥ ነፋስም በክንፎቻቸው ነበረ፤ ክንፎቻቸውም እንደ ሽመላ ክንፎች ነበሩ፤ የኢፍ መስፈሪያውንም በምድርና በሰማይ መካከል አነሡት።  \n" +   
                "10 ፤ ከእኔም ጋር ይነጋገር የነበረውን መልአክ። እነዚህ የኢፍ መስፈሪያውን ወዴት ይወስዱታል? አልሁት።  \n" +   
                "11 ፤ እርሱም። በሰናዖር ምድር ቤት ይሠሩለት ዘንድ ይወስዱታል፤ በተዘጋጀም ጊዜ በዚያ በስፍራው ይኖራል አለኝ።"));
        return new Chapter(5, verses);
    }

    private Chapter chapterSix() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ተመልሼም ዓይኖቼን አነሣሁ፥ እነሆም፥ አራት ሰረገሎች ከሁለት ተራራ መካከል ሲወጡ አየሁ፤ ተራሮቹም የናስ ተራሮች ነበሩ።  \n" +   
                "2 ፤ በፊተኛው ሰረገላ መጋላ ፈረሶች፥ በሁለተኛውም ሰረገላ ዱሪ ፈረሶች ነበሩ፥  \n" +   
                "3 ፤ በሦስተኛውም ሰረገላ አምባላይ ፈረሶች፥ በአራተኛውም ሰረገላ ቅጥልጣል ፈረሶች ነበሩ።  \n" +   
                "4 ፤ ከእኔ ጋር ይነጋገር ለነበረውም መልአክ መልሼ። ጌታዬ ሆይ፥ እነዚህ ምንድር ናቸው? አልሁት።  \n" +   
                "5 ፤ መልአኩም መልሶ። እነዚህ በምድር ሁሉ ጌታ ፊት ከቆሙበት ስፍራ የሚወጡ አራቱ የሰማይ ነፋሳት ናቸው።  \n" +   
                "6 ፤ ዱሪ ፈረሶች ያሉበት ወደ ሰሜን ይወጣል፤ አምባላዮቹም ከእነርሱ በኋላ ይወጣሉ፥ ቅጥልጣሎችም ወደ ደቡብ ይወጣሉ አለኝ።  \n" +   
                "7 ፤ መጋላዎቹም ደግሞ ወጡ በምድርም ይመላለሱ ዘንድ ለመሄድ ይፈልጉ ነበር፤ እርሱም። ሂዱ፥ በምድር ላይ ተመላለሱ አለ። እነርሱም በምድር ላይ ተመላለሱ።  \n" +   
                "8 ፤ ጮኾም። እነሆ፥ ወደ ሰሜን ምድር የሚወጡት እነርሱ መንፈሴን በሰሜን ምድር ላይ አሳርፈዋል ብሎ ተናገረኝ።  \n" +   
                "9 ፤ የእግዚአብሔርም ቃል ወደ እኔ እንዲህ ሲል መጣ።  \n" +   
                "10 ፤ ከባቢሎን ከመጡት ምርኮኞች ከሔልዳይና ከጦብያ ከዮዳኤም ውሰድ፤ በዚያም ቀን መጥተህ ወደ ሶፎንያስ ልጅ ወደ ኢዮስያስ ቤት ግባ።  \n" +   
                "11 ፤ ብርንና ወርቅን ከእነርሱ ውሰድ፥ አክሊሎችንም ሥራ፤ በታላቁም ካህን በኢዮሴዴቅ ልጅ በኢያሱ ራስ ላይ ድፋቸው፥  \n" +   
                "12 ፤ እንዲህም በለው። የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። እነሆ፥ ስሙ ቍጥቋጥ የሚባል ሰው በስፍራው ይበቅላል፥ የእግዚአብሔርንም መቅደስ ይሠራል።  \n" +   
                "13 ፤ እርሱ የእግዚአብሔርን መቅደስ ይሠራል፥ ክብርንም ይሸከማል፥ በዙፋኑም ላይ ተቀምጦ ይነግሣል፤ በዙፋኑም ላይ ካህን ይሆናል፥ የሰላምም ምክር በሁለቱ መካከል ይሆናል።  \n" +   
                "14 ፤ አክሊሎችም ለሔሌምና ለጦብያ ለዮዳኤም ለሶፎንያስም ልጅ ለሔን በእግዚአብሔር መቅደስ ውስጥ ለመታሰቢያ ይሆናሉ።  \n" +   
                "15 ፤ በሩቅም ያሉት መጥተው የእግዚአብሔርን መቅደስ ይሠራሉ፤ የሠራዊት ጌታ እግዚአብሔርም ወደ እናንተ እንደ ላከኝ ታውቃላችሁ። የአምላካችሁንም የእግዚአብሔርን ቃል አጥብቃችሁ ብትሰሙ ይህ ይሆናል።"));

        return new Chapter(6, verses);
    }
     
    private Chapter chapterSeven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "በንጉሡም በዳርዮስ በአራተኛው ዓመት ካሴሉ በሚባል በዘጠነኛው ወር በአራተኛው ቀን የእግዚአብሔር ቃል ወደ ዘካርያስ መጣ።  \n" +   
                "2 ፤ የቤቴልም ሰዎች ሳራሳርንና ሬጌሜሌክን ሰዎቻቸውንም በእግዚአብሔር ፊት ይለምኑ ዘንድ፥  \n" +   
                "3 ፤ ለሠራዊት ጌታ ለእግዚአብሔር ቤት ካህናት ለነቢያትም። ባለፉት ዓመታት እንዳደረግሁት በአምስተኛው ወር መለየትና ማልቀስ ይገባኛልን? ብለው ይናገሩ ዘንድ ልኮአቸው ነበር።  \n" +   
                "4 ፤ የሠራዊትም ጌታ የእግዚአብሔር ቃል ወደ እኔ እንዲህ ሲል መጣ።  \n" +   
                "5 ፤ ለምድሩ ሕዝብ ሁሉ ለካህናትም እንዲህ ብለህ ተናገራቸው። በዚህ በሰባው ዓመት በአምስተኛውና በሰባተኛው ወር በጾማችሁና ባለቀሳችሁ ጊዜ፥ በውኑ ለእኔ ጾም ጾማችሁልኝ?  \n" +   
                "6 ፤ በምትበሉበትና በምትጠጡበትስ ጊዜ፥ ለራሳችሁ የምትበሉና የምትጠጡ አይደላችሁምን?  \n" +   
                "7 ፤ ኢየሩሳሌምና በዙሪያዋ ያሉ ከተሞች ገና ሰዎች ባሉባቸው ጊዜ፥ በምቾትም ተቀምጠው ሳሉ፥ ደቡቡና ቈላውም ሰዎች ባሉባቸው ጊዜ፥ እግዚአብሔር በቀደሙት ነቢያት እጅ የተናገረውን ቃል መስማት አይገባችሁምን?  \n" +   
                "8 ፤ የእግዚአብሔርም ቃል ወደ ዘካርያስ እንዲህ ሲል መጣ።  \n" +   
                "9 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ብሎ ተናግሮአል። እውነተኛውን ፍርድ ፍረዱ፤ ቸርነትንና ምሕረትን ሁላችሁ ለወንድሞቻችሁ አድርጉ፤  \n" +   
                "10 ፤ መበለቲቱንና ድሀ አደጉን፥ መጻተኛውንና ችግረኛውን አትበድሉ፤ ከእናንተም ማንም በወንድሙ ላይ ክፉውን ነገር በልቡ አያስብ።  \n" +   
                "11 ፤ እነርሱ ግን ደንደሳቸውን አዞሩ እንጂ መስማትን እምቢ አሉ፤ እንዳይሰሙም ጆሮአቸውን አደነቈሩ።  \n" +   
                "12 ፤ የሠራዊትም ጌታ እግዚአብሔር በቀደሙት ነቢያት እጅ በመንፈሱ የላከውን ሕጉንና ቃሉን እንዳይሰሙ ልባቸውን እንደ አልማዝ አጠነከሩ፤ ስለዚህ ከሠራዊት ጌታ ከእግዚአብሔር ዘንድ ታላቅ ቍጣ መጣ።  \n" +   
                "13 ፤ እኔ በጠራሁ ጊዜ እነርሱ እንዳልሰሙኝ፥ እንዲሁ እነርሱ በሚጠሩበት ጊዜ እኔ አልሰማም፥ ይላል የሠራዊት ጌታ እግዚአብሔር፤  \n" +   
                "14 ፤ ወደማያውቁአቸውም አሕዛብ ሁሉ በዐውሎ ነፋስ በተንኋቸው። እንዲሁ ከእነርሱ በኋላ ምድሪቱ ባድማ ሆናለች፥ የሚተላለፍባትና የሚመላለስባትም አልነበረም፤ ያማረችውንም ምድር ባድማ አደረጉአት።"));

        return new Chapter(7, verses);
    }

    private Chapter chapterEight() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "የሠራዊትም ጌታ የእግዚአብሔር ቃል ወደ እኔ እንዲህ ሲል መጣ።  \n" +   
                "2 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። ስለ ጽዮን ታላቅ ቅንዓት ቀንቻለሁ፥ በታላቅም ቍጣ ስለ እርስዋ ቀንቻለሁ።  \n" +   
                "3 ፤ እግዚአብሔር እንዲህ ይላል። ወደ ጽዮን ተመልሻለሁ፥ በኢየሩሳሌምም መካከል እኖራለሁ፤ ኢየሩሳሌምም የእውነት ከተማ ትባላለች፤ የሠራዊትም ጌታ የእግዚአብሔር ተራራ የተቀደሰ ተራራ ይባላል።  \n" +   
                "4 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። ዳግመኛ ሽማግሌዎችና ባልቴቶች በኢየሩሳሌም አደባባይ ይቀመጣሉ፤ ሰውም ሁሉ ከዕድሜው ብዛት የተነሣ ምርኩዝ በእጁ ይይዛል።  \n" +   
                "5 ፤ የከተማይቱም አደባባዮች በእነዚያ በሚጫወቱ ወንዶችና ሴቶች ልጆች ይሞላሉ።  \n" +   
                "6 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። በዚህ ወራት በዚህ ሕዝብ ቅሬታ ዓይን ዘንድ ድንቅ ቢሆን፥ በውኑ በእኔ ዓይን ዘንድ ደግሞ ድንቅ ይሆናልን? ይላል የሠራዊት ጌታ እግዚአብሔር።  \n" +   
                "7 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። እነሆ፥ ሕዝቤን ከምሥራቅ ምድርና ከምዕራብ ምድር አድነዋለሁ፤  \n" +   
                "8 ፤ አመጣቸዋለሁም፥ በኢየሩሳሌምም ውስጥ ይኖራሉ፤ እነርሱም ሕዝብ ይሆኑኛል፥ እኔም በእውነትና በጽድቅ አምላክ እሆናቸዋለሁ።  \n" +   
                "9 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። መቅደሱ ይሠራ ዘንድ የሠራዊት ጌታ የእግዚአብሔር ቤት ከተመሠረተበት ቀን ጀምሮ ከነቢያት አፍ ይህን ቃል በዚህ ዘመን የሰማችሁ እናንተ ሆይ፥ እጃችሁን አበርቱ።  \n" +   
                "10 ፤ ከዚያ ወራት አስቀድሞ ለሰውና ለእንስሳ ዋጋ አልነበረምና፤ እኔም ሰውን ሁሉ በወንድሙ ላይ አስነሥቼ ነበርና ከአስጨናቂው የተነሣ ለሚገባውና ለሚወጣው ሰላም አልነበረም።  \n" +   
                "11 ፤ አሁን ግን እንደ ቀደመው ዘመን በዚህ ሕዝብ ቅሬታ ላይ አልሆንም፥ ይላል የሠራዊት ጌታ እግዚአብሔር።  \n" +   
                "12 ፤ ነገር ግን ሰላምን እዘራለሁ፤ ወይኑ ፍሬውን ይሰጣል፥ ምድርም አዝመራዋን ታወጣለች፥ ሰማያትም ጠላቸውን ይሰጣሉ፤ ለዚህም ሕዝብ ቅሬታ ይህን ነገር ሁሉ አወርሳለሁ።  \n" +   
                "13 ፤ የይሁዳ ቤትና የእስራኤል ቤት ሆይ፥ በአሕዛብ ዘንድ እርግማን እንደ ነበራችሁ፥ እንዲሁ አድናችኋለሁ፥ በረከትም ትሆናላችሁ፤ አትፍሩ፥ እጃችሁንም አበርቱ።  \n" +   
                "14 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላልና። አባቶቻችሁ እጅግ ባስቈጡኝ ጊዜ ክፉ ለማድረግ እንዳሰብሁ፥ እንዳልተጸጸትሁም፥ ይላል የሠራዊት ጌታ እግዚአብሔር፥  \n" +   
                "15 ፤ እንዲሁ ዳግመኛ ለኢየሩሳሌምና ለይሁዳ ቤት በዚህ ወራት በጎነትን አደርግ ዘንድ አስቤአለሁ፤ አትፍሩ።  \n" +   
                "16 ፤ የምትሠሩት ነገር ይህ ነው፤ እያንዳንዳችሁ ከባልንጀራችሁ ጋር እውነትን ተነጋገሩ፤ በበር አደባባያችሁም የእውነትንና የሰላምን ፍርድ ፍረዱ፤  \n" +   
                "17 ፤ ሁላችሁም በባልንጀራችሁ ላይ ክፉን ነገር በልባችሁ አታስቡ፤ የሐሰትንም መሐላ አትውደዱ፤ ይህን ነገር ሁሉ እጠላለሁና፥ ይላል እግዚአብሔር።  \n" +   
                "18 ፤ የሠራዊት ጌታ የእግዚአብሔር ቃል ወደ እኔ እንዲህ ሲል መጣ።  \n" +   
                "19 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። የአራተኛው ወር ጾም የአምስተኛውም የሰባተኛውም የአሥረኛውም ወር ጾም ለይሁዳ ቤት ደስታና ተድላ የሐሤትም በዓላት ይሆናል፤ ስለዚህም እውነትንና ሰላምን ውደዱ።  \n" +   
                "20 ፤ የሠራዊት ጌታ እግዚአብሔር እንዲህ ይላል። በብዙ ከተሞች የሚቀመጡ አሕዛብ ገና ይመጣሉ፤  \n" +   
                "21 ፤ በአንዲትም ከተማ የሚኖሩ ሰዎች። እግዚአብሔርን እንለምን ዘንድ፥ የሠራዊትንም ጌታ እግዚአብሔርን እንፈልግ ዘንድ ኑ እንሂድ፤ እኔም እሄዳለሁ እያሉ ወደ ሌላ ከተማ ይሄዳሉ።  \n" +   
                "22 ፤ ብዙ ወገኖችና ኃይለኞች አሕዛብ በኢየሩሳሌም የሠራዊትን ጌታ እግዚአብሔርን ይፈልጉ ዘንድ፥ እግዚአብሔርንም ይለምኑ ዘንድ ይመጣሉ።  \n" +   
                "23 ፤ የሠራዊትም ጌታ እግዚአብሔር እንዲህ ይላል። በዚያ ዘመን ከአሕዛብ ቋንቋ ሁሉ አሥር ሰዎች የአንዱን አይሁዳዊ ሰው ልብስ ዘርፍ ይዘው። እግዚአብሔር ከእናንተ ጋር እንዳለ ሰምተናልና ከእናንተ ጋር እንሂድ ይላሉ።"));

        return new Chapter(8, verses);
    }

    private Chapter chapterNine() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "የእግዚአብሔር ቃል ሸክም በሴድራክ ምድር ላይ ነው፥ በደማስቆም ላይ ያርፋል፤ የእግዚአብሔር ዓይን ወደ ሰውና ወደ እስራኤል ነገድ ሁሉ ዘንድ ነው፤  \n" +   
                "2 ፤ ደግሞም በዳርቻዋ ባለችው በሐማት ላይ፥ እጅግ ጠቢበኞች በሆኑ በጢሮስና በሲዶና ላይ ነው።  \n" +   
                "3 ፤ ጢሮስም ምሽግን ለራስዋ ሠርታለች፥ ብሩንም እንደ አፈር ጥሩውንም ወርቅ እንደ መንገድ ጭቃ አከማችታለች።  \n" +   
                "4 ፤ እነሆ፥ ጌታ ይገፍፋታል፥ በባሕርም ላይ ያለውን ብርታትዋን ይመታል፤ እርስዋም በእሳት ትበላለች።  \n" +   
                "5 ፤ አስቀሎና አይታ ትፈራለች፤ ጋዛ ደግሞ አይታ እጅግ ትታመማለች፤ አቃሮንም እንዲሁ፥ ተስፋዋ ይቈረጣልና፤ ንጉሡም ከጋዛ ይጠፋል፥ በአስቀሎናም የሚቀመጥ አይገኝም።  \n" +   
                "6 ፤ የተደባለቀ ወገን በአዛጦን ይቀመጣል፥ የፍልስጥኤማውያንንም ትዕቢት አጠፋለሁ።  \n" +   
                "7 ፤ ደሙንም ከአፉ ውስጥ ርኩሱንም ነገር ከጥርሱ መካከል አስወግዳለሁ፤ እርሱም ደግሞ ለአምላካችን ቅሬታ ይሆናል፤ በይሁዳም እንደ አለቃ ይሆናል፥ አቃሮንም እንደ ኢያቡሳዊ ይሆናል።  \n" +   
                "8 ፤ እኔም ማንም እንዳይሄድና እንዳይመለስ እንደ ጠባቂ ጦር ሆኖ በቤቴ ዙሪያ ሰፈር አደርጋለሁ፤ አሁንም በዓይኔ አይቻለሁና ከዚህ በኋላ አስጨናቂ አያልፍባቸውም።  \n" +   
                "9 ፤ አንቺ የጽዮን ልጅ ሆይ፥ እጅግ ደስ ይበልሽ፤ አንቺ የኢየሩሳሌም ልጅ ሆይ፥ እልል በዪ፤ እነሆ፥ ንጉሥሽ ጻድቅና አዳኝ ነው፤ ትሑትም ሆኖ በአህያም፥ በአህያይቱ ግልገል በውርጫይቱ ላይ ተቀምጦ ወደ አንቺ ይመጣል።  \n" +   
                "10 ፤ ሰረገላውንም ከኤፍሬም ፈረሱንም ከኢየሩሳሌም አጠፋለሁ፤ የሰልፉም ቀስት ይሰበራል፥ ለአሕዛብም ሰላምን ይናገራል፤ ግዛቱም ከባሕር እስከ ባሕር፥ ከወንዙም እስከ ምድር ዳርቻ ድርስ ይሆናል።  \n" +   
                "11 ፤ ለአንቺም ደግሞ ስለ ቃል ኪዳንሽ ደም፥ እስሮችሽን ውኃ ከሌለበት ጕድጓድ አውጥቻለሁ።  \n" +   
                "12 ፤ እናንተ በተስፋ የምትኖሩ እስሮች ሆይ፥ ወደ ጽኑ አምባ ተመለሱ፤ ሁለት እጥፍ አድርጌ እንድመልስልሽ ዛሬ እነግርሻለሁ።  \n" +   
                "13 ፤ ይሁዳን ለእኔ ገትሬአለሁ፤ ቀስቱን በኤፍሬም ሞልቼአለሁ፤ ጽዮን ሆይ፥ ልጆችሽን በግሪክ ልጆች ላይ አስነሣለሁ፥ አንቺንም እንደ ኃያል ሰው ሰይፍ አደርግሻለሁ።  \n" +   
                "14 ፤ እግዚአብሔርም በእነርሱ ላይ ይገለጣል፥ ፍላጻውም እንደ መብረቅ ይወጣል፤ ጌታ እግዚአብሔርም መለከትን ይነፋል፥ በደቡብም ዐውሎ ነፋስ ይሄዳል።  \n" +   
                "15 ፤ የሠራዊት ጌታ እግዚአብሔር ይጠብቃቸዋል፤ እነርሱም ይበሉአቸዋል፥ የወንጭፉንም ድንጋዮች ይረግጣሉ፤ እንደ ወይን ጠጅም ይጠጡአቸዋል፥ እንደ ጥዋዎችም እንደ መሠዊያም ማዕዘኖች የተሞሉ ይሆናሉ።  \n" +   
                "16 ፤ በዚያም ቀን አምላካቸው እግዚአብሔር እንደ ሕዝቡ መንጋ ያድናቸዋል፤ እነርሱም ለአክሊል እንደሚሆኑ እንደ ከበሩ ድንጋዮች ይሆናሉ፥ በምድሩም ላይ ይብለጨለጫሉ።  \n" +   
                "17 ፤ በጎነቱ እንዴት ታላቅ ነው! ውበቱስ እንዴት ታላቅ ነው! እህል ጐበዛዝቱን፥ ጉሽ ጠጅም ቈነጃጅቱን ያለመልማል።"));

        return new Chapter(9, verses);
    }

    private Chapter chapterTen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "በኋለኛው ዝናብ ጊዜ ከእግዚአብሔር ዘንድ ዝናቡን ለምኑ፤ እግዚአብሔር መብረቅ ያደርጋል፤ እርሱም የበልግ ዝናብን ለእያንዳንዱም በሜዳ ውስጥ ሣርን ይሰጣል።  \n" +   
                "2 ፤ ተራፊም ከንቱነትን ተናግረዋልና፥ ምዋርተኞችም ውሸትን አይተዋልና፤ ሕልምንም የሚያዩ በሐሰት ተናግረዋል፥ በከንቱም ያጽናናሉ፤ እረኛም የላቸውምና እንደ በጎች ተቅበዝብዘዋል ተጨንቀውማል።  \n" +   
                "3 ፤ ቍጣዬ በእረኞች ላይ ነድዶአል፥ አውራ ፍየሎችንም እቀጣለሁ፤ የሠራዊት ጌታ እግዚአብሔርም የይሁዳን ቤት መንጋውን ጐብኝቶአል፥ በሰልፍም ውስጥ እንዳለ እንደ ክብሩ ፈረስ ያደርጋቸዋል።  \n" +   
                "4 ፤ ከእርሱ ዘንድ የማዕዘኑ ድንጋይ፥ ከእርሱም ዘንድ ችንካሩ፥ ከእርሱም ዘንድ የሰልፉ ቀስት፥ ከእርሱም ዘንድ አስገባሪው ሁሉ በአንድ ላይ ይመጣሉ።  \n" +   
                "5 ፤ በሰልፍም ጊዜ ጠላቶቻቸውን በመንገድ ጭቃ ውስጥ እንደሚረግጡ ኃያላን ይሆናሉ፤ እግዚአብሔርም ከእነርሱ ጋር ነውና ይዋጋሉ፥ ፈረሰኞችም ያፍራሉ።  \n" +   
                "6 ፤ ወድጃቸዋለሁና የይሁዳን ቤት አበረታለሁ፥ የዮሴፍንም ቤት አድናለሁ፤ አደላድላቸዋለሁም፤ እመልሳቸዋለሁ፤ እኔም አምላካቸው እግዚአብሔር ነኝና፥ እኔም እሰማቸዋለሁና እንዳልጣልኋቸው ይሆናሉ።  \n" +   
                "7 ፤ የኤፍሬምም ሰዎች እንደ ኃያላን ይሆናሉ፥ ልባቸውም የወይን ጠጅ እንደ ጠጣ ሰው ደስ ይለዋል፤ ልጆቻቸውም አይተው ደስ ይላቸዋል፥ ልባቸውም በእግዚአብሔር ሐሤት ያደርጋል።  \n" +   
                "8 ፤ ተቤዥቼአቸዋለሁና በፉጨት ጠርቼ እሰበስባቸዋለሁ፤ ቀድሞም በዝተው እንደ ነበሩ ይበዛሉ።  \n" +   
                "9 ፤ በአሕዛብም መካከል ብዘራቸው እንኳ በሩቅ አገር ሳሉ ያስቡኛል፥ ከልጆቻቸውም ጋር በሕይወት ይኖራሉ፥ ይመለሱማል።  \n" +   
                "10 ፤ ከግብጽም ምድር እመልሳቸዋለሁ፥ ከአሦርም እሰበስባቸዋለሁ፤ ወደ ገለዓድና ወደ ሊባኖስ ምድር አመጣቸዋለሁ፥ የሚበቃም ቦታ አይገኝላቸውም።  \n" +   
                "11 ፤ እርሱም በጭንቅ ባሕር ያልፋል፥ የባሕርንም ሞገድ ይመታል፥ የወንዙም ጥልቅ ሁሉ ይደርቃል፤ የአሦርም ትዕቢት ይዋረዳል፥ የግብጽም በትረ መንግሥት ይርቃል።  \n" +   
                "12 ፤ በአምላካቸው በእግዚአብሔር አበረታቸዋለሁ፥ በስሙም ይመካሉ፥ ይላል እግዚአብሔር።"));

        return new Chapter(10, verses);
    }

    private Chapter chapterEleven() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ሊባኖስ ሆይ፥ ደጆችህን ክፈት፥ እሳትም ዝግባዎችህን ትብላ።  \n" +   
                "2 ፤ የጥድ ዛፍ ሆይ፥ ዝግባ ወድቆአልና፥ ከበርቴዎችም ጠፍተዋልና ዋይ በል፤ እናንተም የባሳን ዛፎች ሆይ፥ ጽኑው ጫካ ተቈርጦአልና ዋይ በሉ።  \n" +   
                "3 ፤ የእረኞች ክብር ተዋርዶአልና የዋይታቸው ድምፅ ተሰምቶአል፤ የዮርዳኖስ ትዕቢት ተዋርዶአልና የአንበሶች ግሣት ድምፅ ተሰምቶአል።  \n" +   
                "4 ፤ አምላኬ እግዚአብሔር እንዲህ ብሎአል። ለእርድ የሚሆኑትን በጎች ጠብቅ።  \n" +   
                "5 ፤ የገዙአቸው ያርዱአቸዋል፥ ራሳቸውንም እንደ በደለኞች አድርገው አይቈጥሩም፤ የሸጡአቸውም። ባለ ጠጋ ሆነናልና እግዚአብሔር ይመስገን ይላሉ፤ እረኞቻቸውም አይራሩላቸውም።  \n" +   
                "6 ፤ ከእንግዲህ ወዲህ በምድር ላይ ለሚኖሩ አልራራም፥ ይላል እግዚአብሔር፤ እነሆም፥ ሰውን ሁሉ በባልንጀራውና በንጉሡ እጅ አሳልፌ እሰጣለሁ፤ ምድሪቱንም ይመታሉ፥ ከእጃቸውም አላድናቸውም።  \n" +   
                "7 ፤ እኔም ለእርድ የሚሆኑትን በጎች፥ የመንጋውን ችግረኞች ጠበቅሁ። ሁለት በትሮችንም ወሰድሁ፤ የአንዲቱን ስም ውበት የሁለተኛይቱንም ስም ማሰሪያ ብዬ ጠራሁ፤ መንጋውንም ጠበቅሁ።  \n" +   
                "8 ፤ በአንድ ወርም ሦስቱን እረኞች አጠፋሁ፤ ነፍሴም ተሰቀቀቻቸው፥ ነፍሳቸውም ደግሞ እኔን ጠላች።  \n" +   
                "9 ፤ እኔም። እናንተን አልጠብቅም፤ የሚሞተው ይሙት፥ የሚጠፋውም ይጥፋ፤ የቀረውም እያንዳንዱ የባልንጀራውን ሥጋ ይብላ አልሁ።  \n" +   
                "10 ፤ እኔም ከሕዝቦች ሁሉ ጋር የገባሁትን ቃል ኪዳኔን አፈርስ ዘንድ ውበት የተባለችውን በትሬን ወስጄ ቈረጥሁ።  \n" +   
                "11 ፤ በዚያም ቀን ተሰበረች፤ እንዲሁም እኔን የተመለከቱ የመንጋው ችግረኞች የእግዚአብሔር ቃል እንደ ነበረ አወቁ።  \n" +   
                "12 ፤ እኔም። ደስ ብሎአችሁ እንደ ሆነ ዋጋዬን ስጡኝ፤ ያለዚያ ግን ተዉት አልሁ። እነርሱም ለዋጋዬ ሠላሳ ብር መዘኑ።  \n" +   
                "13 ፤ እግዚአብሔርም። የተስማሙበትን የከበረውን ዋጋዬን በግምጃ ቤቱ ውስጥ አኑረው አለኝ። እኔም ሠላሳውን ብር ወስጄ በእግዚአብሔር ቤት ባለው በግምጃ ቤቱ ውስጥ አኖርሁት።  \n" +   
                "14 ፤ በይሁዳና በእስራኤል መካከል ያለውንም ወንድማማችነት እሰብር ዘንድ ማሰሪያ የተባለችውን ሁለተኛይቱን በትሬን ቈረጥሁ።  \n" +   
                "15 ፤ እግዚአብሔርም እንዲህ አለኝ። ዳግመኛም የሰነፍን እረኛ ዕቃ ውሰድ።  \n" +   
                "16 ፤ እነሆ፥ በአገሩ ውስጥ እረኛ አስነሣለሁ፤ እርሱም የጠፋውን አያስብም፥ የባዘነውን አይፈልግም፥ የተሰበረውን አይጠግንም፤ የዳነውንም አይቀልብም፥ ነገር ግን የሰባውን ሥጋ ይበላል፥ ሰኰናውንም ይቀለጣጥማል።  \n" +   
                "17 ፤ መንጋውን ለሚተው ለምናምንቴ እረኛ ወዮለት! ሰይፍ በክንዱና በቀኝ ዓይኑ ላይ ይሆናል፤ ክንዱም አጥብቃ ትደርቃለች፥ ቀኝ ዓይኑም ፈጽሞ ትጨልማለች።"));

        return new Chapter(11, verses);
    }

    private Chapter chapterTwelve() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "ስለ እስራኤል የተነገረ የእግዚአብሔር ቃል ሸክም ይህ ነው። ሰማያትን የዘረጋ፥ ምድርንም የመሠረተ፥ የሰውንም መንፈስ በውስጡ የሠራ እግዚአብሔር እንዲህ ይላል።  \n" +   
                "2 ፤ እነሆ፥ ኢየሩሳሌምን በዙሪያዋ ላሉት ለአሕዛብ ሁሉ የመንገድገድ ዋንጫ አደርጋታለሁ፤ ደግሞም ኢየሩሳሌም ስትከበብ በይሁዳ ላይ እንዲሁ ይሆናል።  \n" +   
                "3 ፤ በዚያም ቀን ኢየሩሳሌምን ለአሕዛብ ሁሉ ከባድ ድንጋይ አደርጋታለሁ፤ የሚሸከሙአት ሁሉ እጅግ ይቈስላሉ፤ የምድርም አሕዛብ ሁሉ በላይዋ ላይ ይከማቻሉ።  \n" +   
                "4 ፤ በዚያ ቀን፥ ይላል እግዚአብሔር፥ ፈረስን ሁሉ በድንጋጤ፥ ተቀማጭንም በእብድነት እመታለሁ፤ ዓይኖቼንም በይሁዳ ላይ እከፍታለሁ፥ የአሕዛብንም ፈረሶች ሁሉ በዕውርነት እመታለሁ።  \n" +   
                "5 ፤ የይሁዳም አለቆች በልባቸው። በኢየሩሳሌም ለሚኖሩ በአምላካቸው በሠራዊት ጌታ በእግዚአብሔር ብርታት አለ ይላሉ።  \n" +   
                "6 ፤ በዚያ ቀን የይሁዳን አለቆች በእንጨት መካከል እንዳለ ትንታግ፥ በነዶችም መካከል እንዳለ እንደ ፋና ነበልባል አደርጋቸዋለሁ፤ በቀኝና በግራ በዙሪያ ያሉትን አሕዛብ ሁሉ ይበላሉ፤ ከዚያም ወዲያ ኢየሩሳሌም በስፍራዋ በኢየሩሳሌም ትኖራለች።  \n" +   
                "7 ፤ እግዚአብሔርም የዳዊት ቤት ክብርና የኢየሩሳሌም ሰዎች ክብር በይሁዳ ክብር ላይ እንዳይታበይ የይሁዳን ድንኳኖች አስቀድሞ ያድናል።  \n" +   
                "8 ፤ በዚያ ቀን እግዚአብሔር በኢየሩሳሌም ለሚኖሩት ይመክትላቸዋል፤ በዚያም ቀን ከእነርሱ መካከል ደካማው እንደ ዳዊት ይሆናል፤ የዳዊትም ቤት በፊታቸው እንደ እግዚአብሔር መልአክ እንደ አምላክ ይሆናል።  \n" +   
                "9 ፤ በዚያም ቀን በኢየሩሳሌም ላይ የሚመጡትን አሕዛብ ሁሉ ለማጥፋት እጋደላለሁ።  \n" +   
                "10 ፤ በዳዊትም ቤት ላይ፥ በኢየሩሳሌምም በሚኖሩት ላይ፥ የሞገስንና የልመናን መንፈስ አፈስሳለሁ፤ ወደ እርሱም ወደ ወጉት ይመለከታሉ፤ ሰውም ለአንድያ ልጁ እንደሚያለቅስ ያለቅሱለታል፥ ሰውም ለበኵር ልጁ እንደሚያዝን በመራራ ኀዘን ያዝኑለታል።  \n" +   
                "11 ፤ በዚያ ቀን በመጊዶን ሜዳ እንደ ነበረው እንደ ሐዳድሪሞን ልቅሶ ታላቅ ልቅሶ በኢየሩሳሌም ይሆናል።  \n" +   
                "12 ፤ ምድሪቱም ታለቅሳለች፤ እያንዳንዱ ወገን ለብቻው፥ የዳዊት ቤት ወገን ለብቻው፥ ሴቶቻቸውም ለብቻቸው፤ የናታን ቤት ወገን ለብቻው፥ ሴቶቻቸውም ለብቻቸው፤  \n" +   
                "13 ፤ የሌዊ ቤት ወገን ለብቻው፥ ሴቶቻቸውም ለብቻቸው፤ የሰሜኢ ወገን ለብቻው፥ ሴቶቻቸውም ለብቻቸው፤  \n" +   
                "14 ፤ የቀሩት ወገኖች ሁሉ እያንዳንዱ ወገን ለብቻው፥ ሴቶቻቸውም ለብቻቸው ያለቅሳሉ።"));

        return new Chapter(12, verses);
    }

    private Chapter chapterThirteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "በዚያ ቀን ለዳዊት ቤትና በኢየሩሳሌም ለሚኖሩ ከኃጢአትና ከርኵሰት የሚያነጻ ምንጭ ይከፈታል።  \n" +   
                "2 ፤ በዚያ ቀን፥ ይላል የሠራዊት ጌታ እግዚአብሔር፥ የጣዖታትን ስም ከምድር አጠፋለሁ፥ ከዚያም በኋላ አይታሰቡም፤ ደግሞም ሐሰተኞችን ነቢያትና ርኩስ መንፈስን ከምድር ላይ አስወግዳለሁ።  \n" +   
                "3 ፤ ማንም ደግሞ ትንቢት ቢናገር የወለዱት አባቱና እናቱ። አንተ በእግዚአብሔር ስም ሐሰትን ተናግረሃልና በሕይወት አትኖርም ይሉታል፤ ትንቢትንም ሲናገር የወለዱት አባቱና እናቱ ይወጉታል።  \n" +   
                "4 ፤ በዚያም ቀን ነቢያቱ ሁሉ ትንቢትን ሲናገሩ እያንዳንዱ ስለ ራእዩ ያፍራል፤ ያታልሉም ዘንድ የማቅ ልብስ አይለብሱም።  \n" +   
                "5 ፤ እርሱ ግን። ከታናሽነቴ ጀምሮ ባሪያ ሆኜ ነበርሁና ገበሬ ሰው ነኝ እንጂ ነቢይ አይደለሁም ይላል።  \n" +   
                "6 ፤ ሰውም። ይህ በእጅህ መካከል ያለ ቍስል ምንድር ነው? ይለዋል። እርሱም። በወዳጆቼ ቤት የቈሰልሁት ቍስል ነው ይላል።  \n" +   
                "7 ፤ ሰይፍ ሆይ፥ ባልንጀራዬ በሆነው ሰው በእረኛዬ ላይ ንቃ፥ ይላል የሠራዊት ጌታ እግዚአብሔር፤ እረኛውን ምታ፥ በጎቹም ይበተናሉ፤ እጄንም በታናናሾች ላይ እመልሳለሁ።  \n" +   
                "8 ፤ በምድርም ሁሉ ላይ ሁለት ክፍል ተቈርጠው ይሞታሉ፥ ይላል እግዚአብሔር፤ ሦስተኛውም ክፍል በእርስዋ ውስጥ ይቀራል።  \n" +   
                "9 ፤ ሦስተኛውንም ክፍል ወደ እሳት አገባለሁ፥ ብርም እንደሚነጥር አነጥራቸዋለሁ፥ ወርቅም እንደሚፈተን እፈትናቸዋለሁ፤ እነርሱም ስሜን ይጠራሉ፥ እኔም እሰማቸዋለሁ፤ እኔም። ይህ ሕዝቤ ነው እላለሁ፤ እርሱም። እግዚአብሔር አምላኬ ነው ይላል።"));

        return new Chapter(13, verses);
    }

    private Chapter chapterFourteen() {
        List<Verse> verses = new ArrayList<>();
        verses.add(new Verse("1", "እነሆ፥ የእግዚአብሔር ቀን ይመጣል፥ ብዝበዛሽንም በውስጥሽ ይካፈላሉ።  \n" +   
                "2 ፤ አሕዛብንም ሁሉ በኢየሩሳሌም ላይ ለሰልፍ እሰበስባለሁ፤ ከተማይቱም ትያዛለች፥ ቤቶችም ይበዘበዛሉ፥ ሴቶችም ይነወራሉ፤ የከተማይቱም እኵሌታ ለምርኮ ይወጣል፥ የቀረው ሕዝብ ግን ከከተማ አይጠፋም።  \n" +   
                "3 ፤ እግዚአብሔርም ይወጣል፥ በሰልፍም ቀን እንደ ተዋጋ ከእነዚያ አሕዛብ ጋር ይዋጋል።  \n" +   
                "4 ፤ በዚያም ቀን እግሮቹ በኢየሩሳሌም ትይዩ በምሥራቅ በኩል ባለው በደብረ ዘይት ላይ ይቆማሉ፤ ደብረ ዘይትም በመካከል ወደ ምሥራቅና ወደ ምዕራብ ይሰነጠቃል፥ እጅግም ታላቅ ሸለቆ ይሆናል፤ የተራራውም እኵሌታ ወደ ሰሜን፥ እኵሌታውም ወደ ደቡብ ይርቃል።  \n" +   
                "5 ፤ የተራሮችም ሸለቆ እስከ አጸል ይደርሳልና በተራሮች ሸለቆ ትሸሻላችሁ፤ በይሁዳም ንጉሥ በዖዝያን ዘመን ከሆነው ከምድር መናወጥ ፊት እንደ ሸሻችሁ ትሸሻላችሁ፤ አምላኬ እግዚአብሔርም ከቅዱሳኑ ሁሉ ጋር ይመጣል።  \n" +   
                "6 ፤ በዚያም ቀን በረዶና ውርጭ እንጂ ብርሃን አይሆንም።  \n" +   
                "7 ፤ አንድ ቀንም ይሆናል፥ እርሱም በእግዚአብሔር ዘንድ የታወቀ ይሆናል፤ ቀንም አይሆንም፥ ሌሊትም አይሆንም፤ ሲመሽም ብርሃን ይሆናል።  \n" +   
                "8 ፤ በዚያም ቀን የሕይወት ውኃ ከኢየሩሳሌም ይወጣል፤ እኵሌታው ወደ ምሥራቁ ባሕር፥ እኵሌታውም ወደ ምዕራቡ ባሕር ይሄዳል፤ ይህ በበጋና በክረምት ይሆናል።  \n" +   
                "9 ፤ እግዚአብሔርም በምድር ሁሉ ላይ ይነግሣል፤ በዚያ ቀን እግዚአብሔር አንድ፥ ስሙም አንድ ይሆናል።  \n" +   
                "10 ፤ ምድር ሁሉ ከጌባ ጀምሮ በኢየሩሳሌምም ደቡብ በኩል እስካለችው እስከ ሬሞን ድረስ ተለውጣ እንደ ዓረባ ትሆናለች፤ እርስዋም ከፍ ከፍ ትላለች፥ ከብንያምም በር ጀምሮ እስከ ፊተኛው በር ስፍራ እስከ ማዕዘኑ በር ድረስ፥ ከሐናንኤልም ግንብ ጀምሮ እስከ ንጉሡ መጥመቂያ ድረስ በስፍራዋ ትኖራለች።  \n" +   
                "11 ፤ ሰዎችም ይኖሩባታል፥ ከዚያም ወዲያ እርግማን አይሆንም፤ ኢየሩሳሌምም ተዘልላ ትኖራለች።  \n" +   
                "12 ፤ እግዚአብሔርም ከኢየሩሳሌም ጋር የተዋጉትን አሕዛብ ሁሉ የሚቀሥፍበት ቸነፈር ይህ ነው፤ በእግራቸው ሲቆሙ ሥጋቸው ይበሰብሳል፥ ዓይኖቻቸውም በዓይነስባቸው ውስጥ ይበሰብሳሉ፥ ምላሳቸውም በአፋቸው ውስጥ ይበሰብሳል።  \n" +   
                "13 ፤ በዚያም ቀን ከእግዚአብሔር ዘንድ ታላቅ ሽብር በእነርሱ ላይ ይሆናል፤ እያንዳንዱም የባልንጀራውን እጅ ይይዛል፥ እጁም በባልንጀራው እጅ ላይ ይነሣል።  \n" +   
                "14 ፤ ይሁዳም ደግሞ በኢየሩሳሌም ውስጥ ሆኖ ይዋጋል፤ በዙሪያም ያሉት የአሕዛብ ሁሉ ሀብት እጅግ ብዙ ወርቅና ብር ልብስም ይሰበሰባል።  \n" +   
                "15 ፤ በፈረስና በበቅሎ፥ በግመልና በአህያ፥ በዚያም ሰፈር ባለ እንስሳ ሁሉ ላይ የሆነ ቸነፈር እንደዚያ ያለ ቸነፈር ይሆናል።  \n" +   
                "16 ፤ በኢየሩሳሌም ላይ ከመጡት ከአሕዛብ ሁሉ የቀሩት ሁሉ ለንጉሡ ለሠራዊት ጌታ ለእግዚአብሔር ይሰግዱ ዘንድ፥ የዳስ በዓልንም ያከብሩ ዘንድ በየዓመቱ ይወጣሉ።  \n" +   
                "17 ፤ ከምድርም ወገኖች ሁሉ ለንጉሡ ለሠራዊት ጌታ ለእግዚአብሔር ይሰግዱ ዘንድ ወደ ኢየሩሳሌም ለማይወጡ ለእነርሱ ዝናብ አይዘንብላቸውም።  \n" +   
                "18 ፤ የግብጽም ወገን ባይወጣ ወደዚያም ባይመጣ፥ እግዚአብሔር የዳስ በዓልን ያከብሩ ዘንድ የማይወጡትን አሕዛብ የሚቀሥፍበት ቸነፈር በእርሱ ላይ ይሆናል።  \n" +   
                "19 ፤ የግብጽ ቅጣት፥ የዳስ በዓልንም ያከብሩ ዘንድ የማይወጡት የአሕዛብ ሁሉ ቅጣት እንደዚህ ይሆናል።  \n" +   
                "20 ፤ በዚያ ቀን በፈረሶች ሻኵራ ላይ። ለእግዚአብሔር የተቀደሰ ተብሎ ይጻፋል፤ በእግዚአብሔርም ቤት ያሉ ምንቸቶች በመሠዊያው ፊት እንዳሉ ዳካዎች ይሆናሉ።  \n" +   
                "21 ፤ በኢየሩሳሌምና በይሁዳ ያሉ ምንቸቶችም ሁሉ ለሠራዊት ጌታ ለእግዚአብሔር የተቀደሱ ይሆናሉ፤ የሚሠዉትም ሰዎች ሁሉ ይመጣሉ ከእነዚያም ወስደው ይቀቅሉባቸዋል፤ በዚያም ቀን በሠራዊት ጌታ በእግዚአብሔር ቤት ከነዓናዊው ከእንግዲህ ወዲያ አይገኝም።"));

        return new Chapter(14, verses);
    }
}